[

	{
		"author":"Aristotle",
		"category":"Update",
		"quotedesc":"Educating the mind without educating the heart is no education at all."
    },
    {
		"author":"Aristotle",
		"category":"Update",
		"quotedesc":"Poverty is the parent of revolution and crime."
    },
    {
		"author":"Aristotle",
		"category":"Update",
		"quotedesc":"We are what we repeatedly do. Excellence, therefore, is not an act, but a habit."
	},
    {
		"author":"Aristotle",
		"category":"Update",
		"quotedesc":"All persons ought to endeavor to follow what is right, and not what is established."
	},

	

	{
		"author":"Aristotle",
		"category":"Update",
		"quotedesc":"The whole is greater than sum of its parts."
	},
	{
		"author":"Dr BR Ambedkar",
		"category":"Update",
		"quotedesc":"I measure the progress of a community by the degree of progress which women have achieved."
	},
	{
		"author":"Dr BR Ambedkar",
		"category":"Update",
		"quotedesc":"Life should be great rather than long."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"Poverty is the worst form of violence."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"Seven Deadly Sins. Wealth without work; Pleasure without conscience; Science without humanity; Knowledge without character; Politics without principle; Commerce without morality; Worship without sacrifice."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"An eye for an eye will only make the whole world blind."
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"Truth can be stated in a thousand different ways, yet each one can be true"
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"That which is selfish is immoral, and that which is unselfish is moral."
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"Talk to yourself once in a day.. otherwise you may miss meeting an excellent person in this world."
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"Take risks in your life, If you win, you can lead! If you loose, you can guide!"
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"Strength is life; Weakness is death."
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"Take up one idea, make that one idea your life. Think of it, dream of it, Live on that idea let the brain, muscles, nerves, every part of your body be full of that idea, and just leave every other idea alone. This is the way to success."
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"Learn everything that is good from others, but bring it in, and in your own way adsorb it; do not become others."
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"In a conflict between the heart and the brain, follow your heart."
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"That man has reached immortality who is disturbed by nothing material."
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"If i love myself despite my infinite faults, how can i hate anyone at the glimpse of a few faults!"
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"You are the creator of your own destiny"
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"We are what our thought have made us; So take care about what you think. Words are secondary. Thoughts live; They travel far."
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"If superstitions enters, the brain is gone"
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"Dare to be free, dare to go as far as your thought leads, and dare to carry that out in your life."
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"The fire that warms us can also consume us; it is not the fault of the fire."
	},
	{
		"author":"Swami Vivekananda",
		"category":"Update",
		"quotedesc":"Where can we go to find GOD if we cannot see him in ours own hearts and in every living being."
	},
	{
		"author":"Bertrand russell",
		"category":"Update",
		"quotedesc":"The fundamental cause of the trouble is that in modern world the stupids are cocksure while the intelligent are full of doubt."
	},
	{
		"author":"Benjamin Franklin",
		"category":"Update",
		"quotedesc":"An investment in knowledge always pays the best interest. "
	},
	{
		"author":"Benjamin Franklin",
		"category":"Update",
		"quotedesc":"He that can have patience can have what he will."
	},
	{
		"author":"Benjamin Franklin",
		"category":"Update",
		"quotedesc":"It is the first responsibility of every citizen to question authority."
	},
	{
		"author":"Benjamin Franklin",
		"category":"Update",
		"quotedesc":"Instead of cursing the darkness, light a candle."
	},
	{
		"author":"Franklin Roosevelt",
		"category":"Update",
		"quotedesc":"The only thing we have to fear is the fear itself."
	},
	{
		"author":"Franklin Roosevelt",
		"category":"Update",
		"quotedesc":"The test of our progress is not whether we add more to the abundance of those who have much; it is whether we provide enough for those who have little."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Anyone who has never made a mistake has never tried anything new. "
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Blind belief in authority is the greatest enemy of truth."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Education is what remains after one has forgotten what one has learned in school."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Great spirits have always encountered violent opposition from mediocre minds."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Genius is 1% talent and 99% percent hard work."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Imagination is more important than knowledge."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"I have no special talents. I am only passionately curious."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Everybody is a genius. But if you judge a fish by its ability to climb a tree, it will live its whole life believing that it is stupid."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"I know not with what weapons World War III will be fought, but World War IV will be fought with sticks and stones."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Logic will get you from A to Z; imagination will get you everywhere."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"In the middle of difficulty lies opportunity."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Life is like riding a bicycle. To keep your balance, you must keep moving."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Learn from yesterday, live for today, hope for tomorrow. The important thing is not to stop questioning."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Only a life lived for others is a life worthwhile."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"The woman who follows the crowd will usually go no further than the crowd. The woman who walks alone is likely to find herself in places no one has ever been before."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"Try not to become a man of success. Rather become a man of value."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"What is right is not always popular and what is popular is not always right."
	},
	{
		"author":"Einstein",
		"category":"Update",
		"quotedesc":"You never fail until you stop trying."
	},
	{
		"author":"Leo Tolstoy",
		"category":"Update",
		"quotedesc":"To get rid of enemy one must love him. "
	},
	{
		"author":"Leo Tolstoy",
		"category":"Update",
		"quotedesc":"Wrong does not cease to be wrong because the majority share in it."
	},
	{
		"author":"Leo Tolstoy",
		"category":"Update",
		"quotedesc":"Everyone thinks of changing the world, but no one thinks of changing himself."
	},
	{
		"author":"Napoleon Bonaparte",
		"category":"Update",
		"quotedesc":"Impossible is a word to be found only in the dictionary of fools."
	},
	{
		"author":"Napoleon Bonaparte",
		"category":"Update",
		"quotedesc":"The best cure for the body is a quiet mind"
	},
	{
		"author":"Napoleon Bonaparte",
		"category":"Update",
		"quotedesc":"Victory belongs to the most persevering."
	},
	{
		"author":"Napoleon Bonaparte",
		"category":"Update",
		"quotedesc":"It is the cause, not the death, that makes the martyr. "
	},
	{
		"author":"Napoleon Bonaparte",
		"category":"Update",
		"quotedesc":"There are only two forces that unite men - fear and interest."
	},
	{
		"author":"Napoleon Bonaparte",
		"category":"Update",
		"quotedesc":"It requires more courage to suffer than to die."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"Be the change that you wish to see in the world."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"Live as if you were to die tomorrow. Learn as if you were to live forever."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"First they ignore you, then they ridicule you, then they fight you, and then you win."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"In doing something, do it with love or never do it at all."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"Happiness is when what you think, what you say and what you do are in harmony."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"Strength does not come from physical capacity. It comes from an indomitable will."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"The future depends on what you do today."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"To believe in something, and not to live it, is dishonest."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"In a gentle way you can shake the world."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"God has no religion."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"There are people in the world so hungry, that God cannot appear to them except in the form of bread."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"The simplest acts of kindness are by far more powerful than a thousand heads bowing in prayer."
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"Your beliefs become your thoughts; Your thoughts become your words; Your words become your actions; Your actions become your habits; Your habits become your values; Your values become your destiny"
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"You can chain me, you can torture me, you can even destroy this body, but you will never imprison my mind"
	},
	{
		"author":"Mahatma Gandhi",
		"category":"Update",
		"quotedesc":"A man is the product of his thoughts. What he thinks, he becomes."
	}
]