[
		
    {
        "Year":"2013",
        "Question":"1. Though not very useful from the point of view of a connected political history of South India , the Sangam literature portrays the social and economic conditions of its time with remarkable vividness. Comment. (10 marks 200 words.)"
    },
    {
        "Year":"2013",
        "Question":"2a. Discuss the Tandava dance as recorded in the early Indian inscriptions. (5 marks- 100 words.)"
    },
    {
        "Year":"2013",
        "Question":"2b. Chola architecture represents a high watermark in the evolution of temple architecture. Discuss. (5 marks- 100 words.)"
    },
    {
        "Year":"2013",
        "Question":"3. Defying the barriers of age, gender and religion, the Indian women became the torch bearer during the struggle for freedom in India. Discuss. (10 marks-200 words)"
    },
    {
        "Year":"2013",
        "Question":"4. Several foreigners made India their homeland and participated in various movements. Analyze their role in the Indian struggle for freedom. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"5. In many ways, Lord Dalhousie was the founder of modern India. Elaborate. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"6. Critically discuss the objectives of Bhoodan and Gramdan movements initiated by Acharya Vinoba Bhave and their success. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"7. Write a critical note on the evolution and significance of the slogan “Jai Jawana Jai Kisan”. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"8. Discuss the contribution of Maulana Abul Kalam Azad to pre-and post independent India. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"Q9. Analyse the circumstances that led to Tashkent Agreement in 1966. Discuss the highlights of the agreement. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"Q10. Critically examine the compulsions which prompted India to play a decisive roles in the emergence of Bangladesh. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"11. “Latecomer” Industrial revolution in Japan involved certain factors that were markedly different from what west had experience. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"12. Africa was chopped into states artificially created by accident of European competition. Analyse. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"13. American Revolution was an economic revolt against mercantilism. Substantiate. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"14. What policy instruments were deployed to contain the great economic depression? 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"15. Discussion the various social problems which originated out of the speedy process of urbanization in India. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"16. Male membership needs to be encouraged in order to make women’s organization free from gender bias. Comment. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"17. Critically examine the effects of globalization on the aged population in India. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"18. Growing feeling of regionalism is an important factor in the generation of demand for a separate state. Discuss. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"19(a). What do you understand by the theory of continental drift? Discuss the prominent evidences in its support. 5 marks 100 words"
    },
    {
        "Year":"2013",
        "Question":"19(b) The recent cyclone on the east coast of India was called “Phailin”. How are the tropical cyclones named across the world? Elaborate. 5 marks-100 words."
    },
    {
        "Year":"2013",
        "Question":"20(a) Bring out the causes for the formation of heat islands in the urban habitat of the world. 5 marks 100 words"
    },
    {
        "Year":"2013",
        "Question":"20(b) What do you understand by the phenomenon of temperature inversion in meteorology? How does it affect the weather and the habitants of the place? 5 mark 100 words"
    },
    {
        "Year":"2013",
        "Question":"21. Major hot deserts in northern hemisphere are located between 20-30 degree north and on the western side of the continents. Why? 10 marks-200 words."
    },
    {
        "Year":"2013",
        "Question":"22(a) Bring out the causes for more frequent landslides in the Himalayas than in Western Ghats. 5 marks 100 words"
    },
    {
        "Year":"2013",
        "Question":"22(b) There is no formation of deltas by rivers of the Western Ghat. Why? 5 marks 100 words"
    },
    {
        "Year":"2013",
        "Question":"23(a) Do you agree that there is a growing trend of opening new sugar mills in the Southern states of India ? Discuss with justification. 5 marks 100 words"
    },
    {
        "Year":"2013",
        "Question":"23(b) Analyse the factors for highly decentralized cotton textile industry in India . 5 marks 100 words"
    },
    {
        "Year":"2013",
        "Question":"24. With growing scarcity of fossil fuels, the atomic energy is gaining more and more significance in India. Discuss the availability of raw material required for the generation of atomic energy in India and in the world. 10 marks-200 words"
    },
    {
        "Year":"2013",
        "Question":"25. It is said the India has substantial reserves of shale oil and gas, which can feed the needs of country for quarter century. However, tapping of the resources doesn’t appear to be high on the agenda. Discuss critically the availability and issues involved. 10 marks-200 words"
    },
    {
        "Year":"2014",
        "Question":"1. To what extent has the urban planning and culture of the Indus Valley Civilization provided inputs to the present day urbanization? Discuss."
    },
    {
        "Year":"2014",
        "Question":"2. Gandhara sculpture owed as much to the Romans as to the Greeks. Explain."
    },
    {
        "Year":"2014",
        "Question":"3. Taxila university was one of the oldest universities of the world with which were associated a number of renowned learned personalities of different disciplines. Its strategic location caused its fame to flourish, but unlike Nalanda, it is not considered as a university in the modern sense. Discuss."
    },
    {
        "Year":"2014",
        "Question":"4. The third battle of Panipat was fought in 1761. Why were so many empire-shaking battles fought at Panipat?"
    },
    {
        "Year":"2014",
        "Question":"5. Sufis and medieval mystic saints failed to modify either the religious ideas and practices or the outward structure of Hindu / Muslim societies to any appreciable extent. Comment."
    },
    {
        "Year":"2014",
        "Question":"6. Examine critically the various facets of economic policies of the British in India from mid-eighteenth century till independence."
    },
    {
        "Year":"2014",
        "Question":"7. In what ways did the naval mutiny prove to be the last nail in the coffin of British colonial aspirations in India?"
    },
    {
        "Year":"2014",
        "Question":"8. What were the major political, economic and social developments in the world which motivated the anti-colonial struggle in India? "
    },
    {
        "Year":"2014",
        "Question":"9. What were the events that led to the Suez Crisis in 1956? How did it deal a final blow to Britain’s self-image as a world power?"
    },
    {
        "Year":"2014",
        "Question":"10. The New Economic Policy – 1921 of Lenin had influenced the policies adopted by India soon after independence. Evaluate."
    },
    {
        "Year":"2014",
        "Question":"11. How does patriarchy impact the position of a middle class working woman in India?"
    },
    {
        "Year":"2014",
        "Question":"12. Why do some of the most prosperous regions of India have an adverse sex ratio for women? Give your arguments."
    },
    {
        "Year":"2014",
        "Question":"13. The life cycle of a joint family depends on economic factors rather than social values. Discuss."
    },
    {
        "Year":"2014",
        "Question":"14. Discuss the various economic and socio-cultural forces that are driving increasing feminization of agriculture in India."
    },
    {
        "Year":"2014",
        "Question":"15. How do the Indian debates on secularism differ from the debates in the West?"
    },
    {
        "Year":"2014",
        "Question":"16. Most of the unusual climatic happenings are explained as an outcome of the El-Nino effect. Do you agree?"
    },
    {
        "Year":"2014",
        "Question":"17. Why are the world’s fold mountain systems located along the margins of continents? Bring out the association between the global distribution of fold mountains and the earthquakes and volcanoes."
    },
    {
        "Year":"2014",
        "Question":"18. Explain the formation of thousands of islands in Indonesian and Philippines archipelagos."
    },
    {
        "Year":"2014",
        "Question":"19. Tropical cyclones are largely confined to South China Sea, Bay of Bengal and Gulf of Mexico. Why?"
    },
    {
        "Year":"2014",
        "Question":"20. Bring out the relationship between the shrinking Himalayan glaciers and the symptoms of climate change in the Indian sub-continent."
    },
    {
        "Year":"2014",
        "Question":"21. Whereas the British planters had developed tea gardens all along the Shivaliks and Lesser Himalayas from Assam to Himachal Pradesh, in effect they did not succeed beyond the Darjeeling area. Explain."
    },
    {
        "Year":"2014",
        "Question":"22. Why did the Green Revolution in India virtually by-pass the eastern region despite fertile soil and good availability of water?"
    },
    {
        "Year":"2014",
        "Question":"23. Account for the change in the spatial pattern of the Iron and Steel industry in the world."
    },
    {
        "Year":"2014",
        "Question":"24. Critically evaluate the various resources of the oceans which can be harnessed to meet the resource crisis in the world. "
    },
    {
        "Year":"2014",
        "Question":"25. How does India see its place in the economic space of rising natural resource rich Africa?"
    },
    {
        "Year":"2015",
        "Question":"1. The ancient civilization in Indian sub continent differed from those of Egypt, Mesopotamia and Greece in that its culture and traditions have been preserved without breakdown to the present day. Comment."
    },
    {
        "Year":"2015",
        "Question":"2. Mesolithic rock cut architecture of India not only reflects the cultural life of the times but also a fine aesthetic sense comparable to modern painting. Critically evaluate this comment."
    },
    {
        "Year":"2015",
        "Question":"3. How difficult would have been the achievement of Indian independence without Mahatma Gandhi? Discuss."
    },
    {
        "Year":"2015",
        "Question":"4. Mahatma Gandhi and Dr. B R Ambedkar, despite having divergent approaches and strategies, had a common goal of amelioration of the downtrodden. Elucidate."
    },
    {
        "Year":"2015",
        "Question":"5. It would have been difficult for the Constituent Assembly to complete its historic task of drafting the Constitution for Independent India in just three years, but its experience gained with the Government of India Act, 1935 .Discuss."
    },
    {
        "Year":"2015",
        "Question":"6. Why did the industrial revolution first occur in England? Discuss the quality of life of the people there during the industrialization. How does it compare with that in India at present times?"
    },
    {
        "Year":"2015",
        "Question":"7. To what extend can Germany be held responsible for causing the two World Wars? Discuss critically."
    },
    {
        "Year":"2015",
        "Question":"8. Describe any four cultural elements of diversity in India and rate their relative significance in building a national identity."
    },
    {
        "Year":"2015",
        "Question":"9. Critically examine whether growing population is the cause of poverty OR poverty is the mains cause of population increase in India."
    },
    {
        "Year":"2015",
        "Question":"10. How do you explain the statistics that show that the sex ratio in Tribes in India is more favourable to women than the sex ratio among Scheduled Castes?"
    },
    {
        "Year":"2015",
        "Question":"11. Discuss the changes in the trends of labour migration within and outside India in the last four decades."
    },
    {
        "Year":"2015",
        "Question":"12. Discuss the positive and negative effects of globalization on women in India?"
    },
    {
        "Year":"2015",
        "Question":"13. Debate the issue whether and how contemporary movements for assertion of Dalit identity work towards annihilation of caste."
    },
    {
        "Year":"2015",
        "Question":"14. Explain the factors responsible for the origin of ocean currents. How do they influence regional climates, fishing and navigation?"
    },
    {
        "Year":"2015",
        "Question":"15. Mumbai, Delhi and Kolkata are the three Mega cities of the country but the air pollution is much more serious problem in Delhi as compared to the other two. Why is this so?"
    },
    {
        "Year":"2015",
        "Question":"16. India is well endowed with fresh water resources. Critically examine why it still suffers from water scarcity."
    },
    {
        "Year":"2015",
        "Question":"17. The states of Jammu and Kashmir, Himachal Pradesh and Uttarakhand are reaching the limits of ecological carrying capacity due to tourism. Critically evaluate."
    },
    {
        "Year":"2015",
        "Question":"18. How far do you agree that the behaviour of the Indian monsoon has been changing due to humanizing landscape? Discuss."
    },
    {
        "Year":"2015",
        "Question":"19. Smart cities in India cannot sustain without smart villages. Discuss this statement in the backdrop of rural urban integration."
    },
    {
        "Year":"2015",
        "Question":"20. What are the economic significance of discovery of oil in Arctic Sea and its possible environmental consequences?"
    },
    {
        "Year":"2016",
        "Question":"1. Early Buddhist Stupa-art, while depicting folk motifs and narratives, successfully expounds Buddhist ideals. Elucidate."
    },
    {
        "Year":"2016",
        "Question":"2. Krishnadeva Raya, the king of Vijayanagar, was not only an accomplished scholar himself but was a also a great patron of learning and literature. Discuss."
    },
    {
        "Year":"2016",
        "Question":"3. Explain how the upraising of 1857 constitutes an important watershed in the evolution of British policies towards colonial India."
    },
    {
        "Year":"2016",
        "Question":"4. Discuss the role of women in the freedom struggle especially during the Gandhian phase."
    },
    {
        "Year":"2016",
        "Question":"5. Highlight the differences in the approach of Subhash Chandra Bose and Mahatma Gandhi in the struggle for freedom."
    },
    {
        "Year":"2016",
        "Question":"6. Has the formation of linguistic states strengthened the cause of Indian unity?"
    },
    {
        "Year":"2016",
        "Question":"7. The anti-colonial struggles in West Africa were led by the new elite of Western - educated Africans. Examine."
    },
    {
        "Year":"2016",
        "Question":"8. To what extent globalisation has influenced the core of cultural diversity in India? Explain."
    },
    {
        "Year":"2016",
        "Question":"9. “An essential condition to eradicate poverty is to liberate the poor from the process of deprivation.” Substantiate this statement with suitable examples."
    },
    {
        "Year":"2016",
        "Question":"10. Why are the tribals in India referred to as ‘the Scheduled Tribes’? Indicate the major provisions enshrined in the Constitution of India for their upliftment."
    },
    {
        "Year":"2016",
        "Question":"11. With a brief background of quality of urban life in India, introduce the objectives and strategy of the ‘Smart City Programme.”"
    },
    {
        "Year":"2016",
        "Question":"12. What is the basis of regionalism? Is it that unequal distribution of benefits of development on regional basis eventually promotes regionalism? Substantiate your answer."
    },
    {
        "Year":"2016",
        "Question":"13. Discuss the concept of air mass and explain its role in macro-climatic changes."
    },
    {
        "Year":"2016",
        "Question":"14. “The Himalayas are highly prone to landslides.”Discuss the causes and suggest suitable measures of mitigation."
    },
    {
        "Year":"2016",
        "Question":"15. The effective management of land and water resources will drastically reduce the human miseries. Explain."
    },
    {
        "Year":"2016",
        "Question":"16. South China Sea has assumed great geopolitical significance in the present context. Comment."
    },
    {
        "Year":"2016",
        "Question":"17. Major cities of India are becoming vulnerable to flood conditions. Discuss."
    },
    {
        "Year":"2016",
        "Question":"18. Present an account of the Indus Water Treaty and examine its ecological, economic and political implications in the context of changing bilateral relations."
    },
    {
        "Year":"2016",
        "Question":"19. Enumerate the problems and prospects of inland water transport in India."
    },
    {
        "Year":"2016",
        "Question":"20. In what way micro-watershed development projects help in water conservation in drought-prone and semi-arid regions of India?"
    },
    {
        "Year":"2017",
        "Question":"1. How do you justify the view that the level of excellence of the Gupta numismatic art is not at all noticeable in later times? (150 words)"
    },
    {
        "Year":"2017",
        "Question":"2. Clarify how mid-eighteenth century India was beset with the spectre of a fragmented polity. (150 words)"
    },
    {
        "Year":"2017",
        "Question":"3. Why did the ‘Moderates’ failed to carry conviction with the nation about their proclaimed ideology and political goals by the end of the nineteenth century? (150 words)"
    },
    {
        "Year":"2017",
        "Question":"4. What problems are germane to the decolonization process in the Malay Peninsula? (150 words)"
    },
    {
        "Year":"2017",
        "Question":"5. How does the Juno Mission of NASA help to understand the origin and evolution of the Earth? (150 words)"
    },
    {
        "Year":"2017",
        "Question":"6. “Inspite of adverse environmental impact, coal mining is still inevitable for development”. Discuss (150 words)"
    },
    {
        "Year":"2017",
        "Question":"7. Mention the advantages of the cultivation of pulses because of which the year 2016 was declared as the International Year of Pulses by United Nations. (150 words)"
    },
    {
        "Year":"2017",
        "Question":"8. How does the cryosphere affect global climate? (150 words)"
    },
    {
        "Year":"2017",
        "Question":"9. In the context of the diversity of India, can it be said that the regions form cultural units rather than the States? Give reasons with examples for your view point. (150 words)"
    },
    {
        "Year":"2017",
        "Question":"10. What are the two major legal initiatives by the State since Independence addressing discrimination against Scheduled Tribes(STs)? (150 words) (250 words)"
    },
    {
        "Year":"2017",
        "Question":"11. The spirit of tolerance and love is not only an interesting feature of Indian society from very early times, but it is also playing an important part at the present. Elaborate. (250 words)"
    },
    {
        "Year":"2017",
        "Question":"12. Examine how the decline of traditional artisanal industry in colonial India crippled the rural economy. (250 words)"
    },
    {
        "Year":"2017",
        "Question":"13. Highlight the importance of the new objectives that got added to the vision of Indian Independence since the twenties of the last century. (250 words)"
    },
    {
        "Year":"2017",
        "Question":"14. Account for variations in oceanic salinity and discuss its multi-dimensional effects. (250 words) "
    },
    {
        "Year":"2017",
        "Question":"15. Petroleum refineries are not necessarily located nearer to crude oil producing areas, particularly in many of the developing countries. Explain its implications. (250 words)"
    },
    {
        "Year":"2017",
        "Question":"16. In what way can floods be converted into a sustainable source of irrigation and all weather inland navigation in India? (250 words)"
    },
    {
        "Year":"2017",
        "Question":"17. What characteristics can be assigned to monsoon climate that succeeds in feeding more than 50 percent of the world population residing in Monsoon Asia? (250 words)"
    },
    {
        "Year":"2017",
        "Question":"18. The women’s questions arose in modern India as a part of the 19th century social reform movement. What are the major issues and debates concerning women in that period? (250 words)"
    },
    {
        "Year":"2017",
        "Question":"19. Distinguish between religiousness/religiosity and communalism giving one example of how the former has got transformed into the latter in independent India. (250 words)"
    },
    {
        "Year":"2017",
        "Question":"20. “The growth of cities as I.T. hubs has opened up new avenues of employment, but has also created new problems”. Substantiate this statement with examples (250 words)"
    },
    {
        "Year":"2018",
        "Question":"1. Safeguarding the Indian art heritage is the need of the moment. Comment (10)"
    },
    {
        "Year":"2018",
        "Question":"2. Assess the importance of the accounts of the Chinese and Arab travellers in the reconstruction of the history of India. (10)"
    },
    {
        "Year":"2018",
        "Question":"3. Throw light on the significance of the thoughts of Mahatma Gandhi in the present times. (10)"
    },
    {
        "Year":"2018",
        "Question":"4. Why is Indian Regional Navigational Satellite System (IRNSS) needed? How does it help in navigation? (10 )"
    },
    {
        "Year":"2018",
        "Question":"5. Why is India taking keen interest in the Arctic region? (10)"
    },
    {
        "Year":"2018",
        "Question":"6. Define mantle plume and explain its role in plate tectonics. (10)"
    },
    {
        "Year":"2018",
        "Question":"7. What are the consequences of spreading of ‘Dead Zones’ on marine ecosystem? (10)"
    },
    {
        "Year":"2018",
        "Question":"8. “Caste system is assuming new identities and associational forms. Hence, caste system cannot be eradicated in India.” Comment. (10)"
    },
    {
        "Year":"2018",
        "Question":"9. ‘Despite implementation of various programmes for eradication of poverty by the government in India, poverty is still existing’. Explain by giving reasons. (10)"
    },
    {
        "Year":"2018",
        "Question":"10. How the Indian concept of secularism different from the western model of secularism? Discuss. (10)"
    },
    {
        "Year":"2018",
        "Question":"11. The Bhakti movement received a remarkable re-orientation with the advent of Sri Chaitanya Mahaprabhu. Discuss. (15)"
    },
    {
        "Year":"2018",
        "Question":"12. Discuss whether formation of new states in recent times is beneficial or not for the economy of India. (15)"
    },
    {
        "Year":"2018",
        "Question":"13. Why indentured labour was taken by the British from India to their colonies? have they been able to preserve their cultural identity over there? (15)"
    },
    {
        "Year":"2018",
        "Question":"14. “The ideal solution of depleting ground water resources in India is water harvesting system.” How can it be made effective in urban areas? (15)"
    },
    {
        "Year":"2018",
        "Question":"15. Defining blue revolution, explain the problems and strategies for pisciculture development in India. (15)"
    },
    {
        "Year":"2018",
        "Question":"16. What is the significance of Industrial Corridors in India? Identifying industrial corridors, explain their main characteristics. (15)"
    },
    {
        "Year":"2018",
        "Question":"17. Mention core strategies for the transformation of aspirational districts in India and explain the nature of convergence, collaboration and competition for its success. (15)"
    },
    {
        "Year":"2018",
        "Question":"18. ‘Women’s movement in India has not addressed the issues of women of lower social strata.’ Substantiate your view. (15)"
    },
    {
        "Year":"2018",
        "Question":"19. ‘Globalisation is generally said to promote cultural homogenisation but due to this cultural specificities appear to be strengthened in the Indian society.’ Elucidate."
    },
    {
        "Year":"2018",
        "Question":"20. ‘Communalism arises either due to power struggle or relative deprivation.’ Argue by giving suitable illustrations. (15)"
    }
]