[
		
    {
        "Year":"2013",
        "Question":"1. With a consideration towards the strategy of inclusive growth, the new Companies Bill ,2013 has indirectly made CSR a mandatory obligation. Discuss the challenges expected in its implementation in right earnest. Also discuss other provisions in the Bill and their implications. (200 words)"
    },
    {
        "Year":"2013",
        "Question":"2. What were the reasons for the introduction of Fiscal Responsibility and Budget Management (FRBM) Act, 2013? Discuss critically its salient features and their effectiveness."
    },
    {
        "Year":"2013",
        "Question":"3. What is the meaning of the term ‘tax expenditure’? Taking housing sector as an example, discuss how it influences the budgetary policies of the government."
    },
    {
        "Year":"2013",
        "Question":"4. Food Security Bill is expected to eliminate hunger and malnutrition in India. Critically discuss various apprehensions in its effective implementation along with the concerns it has generated in WTO."
    },
    {
        "Year":"2013",
        "Question":"5. What are the different types of agriculture subsidies given to farmers at the national and at state levels? Critically analyse the agricultural subsidy regime with reference to the distortions created by it."
    },
    {
        "Year":"2013",
        "Question":"6. India needs to strengthen measures to promote the pink revolution in food industry for ensuring better nutrition and health. Critically elucidate the statement."
    },
    {
        "Year":"2013",
        "Question":"7. Examine the impact of liberalization on companies owned by Indians. Are they competing with the MNCs satisfactorily? Discuss."
    },
    {
        "Year":"2013",
        "Question":"8. Establish relationship between land reforms, agricultural productivity and elimination of poverty in the Indian economy. Discuss the difficulties in designing and implementation of agriculture – friendly land reforms in India."
    },
    {
        "Year":"2013",
        "Question":"9. a) Discuss the impact of FDI entry into Multi-trade retail sector on supply chain management in commodity trade pattern of the economy."
    },
    {
        "Year":"2013",
        "Question":"9. b) Though India allowed Foreign Direct Investment (FDI) in what is called multi-brand retail through the joint venture route in September 2012, the FDI, even after a year, has not picked up. Discuss the reasons."
    },
    {
        "Year":"2013",
        "Question":"10. Discuss the rationale for introducing the Goods and Services Tax (GST) in India. Bring out critically the reasons for the delay in roll out for its regime."
    },
    {
        "Year":"2013",
        "Question":"11. Write a note on India’s green energy corridor to alleviate the problem of conventional energy."
    },
    {
        "Year":"2013",
        "Question":"12. Adoption of PPP model for infrastructure development of the country has not been free of criticism. Critically discuss the pros and cons of the model."
    },
    {
        "Year":"2013",
        "Question":"13. Bringing out the circumstances in 2005 which forced amendment to the section 3(d) in Indian Patent Law, 1970, discuss how it has been utilized by the Supreme Court in its judgement in rejecting Novartis’ patent application for ‘Glivec’. Discuss briefly the pros and cons of the decision."
    },
    {
        "Year":"2013",
        "Question":"14. What do you understand by Fixed Dose drug Combinations (FDCs)? Discuss their merits and demerits."
    },
    {
        "Year":"2013",
        "Question":"15. What do you understand by Umpire Decision Review System in cricket? Discuss its various components. Explain how silicone tape on the edge of a bat may fool the system?"
    },
    {
        "Year":"2013",
        "Question":"16. a) What is a digital signature? What does its authentication mean? Give various salient built-in features of a digital signature."
    },
    {
        "Year":"2013",
        "Question":"16. b) How does the 3D printing technology work? List out the advantages and disadvantages of the technology."
    },
    {
        "Year":"2013",
        "Question":"17. a) What is an FRP composite material? How are they manufactured? Discuss their application in aviation and automobile industries."
    },
    {
        "Year":"2013",
        "Question":"17. b) What do you understand by Run-of-river hydroelectricity project? How is it different from any other hydroelectricity project?"
    },
    {
        "Year":"2013",
        "Question":"18. How important are vulnerability and risk assessment for pre-disaster management? As an administrator, what are key areas that you would focus on in a Disaster Management System?"
    },
    {
        "Year":"2013",
        "Question":"19. What are the consequences of Illegal mining? Discuss the Ministry of Environment and Forest’s concept of GO AND NO GO zones for coal mining sector."
    },
    {
        "Year":"2013",
        "Question":"20. Enumerate the National Water Policy of India. Taking river Ganges as an example, discuss the strategies which may be adopted for river water pollution control and management. What are the legal provisions of management and handling of hazardous wastes in India?"
    },
    {
        "Year":"2013",
        "Question":"21. Money laundering poses a serious security threat to a country’s economic sovereignty. What is its significance for India and what steps are required to be taken to control this menace?"
    },
    {
        "Year":"2013",
        "Question":"22. What are social networking sites and what security implications do these sites present?"
    },
    {
        "Year":"2013",
        "Question":"23. Cyber warfare is considered by some defense analysts to be a larger threat than even Al Qaeda or terrorism. What do you understand by Cyber warfare? Outline the cyber threats which India is vulnerable to and bring out the state of the country’s preparedness to deal with the same."
    },
    {
        "Year":"2013",
        "Question":"24. Article 244 of the Indian Constitution relates to administration of schedules area and tribal areas. Analyse the impact of non-implementation of the provisions of the Fifth schedule on the growth of Left Wing extremism."
    },
    {
        "Year":"2013",
        "Question":"25. How far are India’s internal security challenges linked with border management particularly in view of the long porous borders with most countries of South Asia and Myanmar?"
    },
    {
        "Year":"2014",
        "Question":"1. Normally countries shift from agriculture to industry and then later to services, but India shifted directly from agriculture to services. What are the reasons for the huge growth-services vis-a-vis industry in the country? Can India become a developed country without a strong industrial base?"
    },
    {
        "Year":"2014",
        "Question":"2. “While we flaunt India’s demographic dividend, we ignore the dropping rates of employability.” What are we missing while doing so? Where will the jobs that India desperately needs come from? Explain."
    },
    {
        "Year":"2014",
        "Question":"3. There is also a point of view that Agricultural Produce Market Committees [APMCs) set up under the State Acts have not only impeded the development of agriculture but also have been the cause of food inflation in India. Critically examine."
    },
    {
        "Year":"2014",
        "Question":"4. “In the villages itself no form of credit organization will be suitable except the cooperative society.” – All India Rural Credit Survey. Discuss this statement in the background of agricultural finance in India. What constraints and challenges do financial institutions supplying agricultural finance face? How can technology be used to better reach and serve rural clients?"
    },
    {
        "Year":"2014",
        "Question":"5. The Right to Fair Compensation and Transparency in Land Acquisition, Rehabilitation and Resettlement Act, 2013 has come into effect from 1st January, 2014. What are the key issues which would get addressed with the Act in place? What implications would it have on industrialization and agriculture in India?"
    },
    {
        "Year":"2014",
        "Question":"6. Capitalism has guided the world economy to unprecedented prosperity. However, it often encourages short-sightedness and contributes to wide disparities between the rich and the poor. In this light, would it be correct to believe and adopt capitalism for bringing inclusive growth in India? Discuss."
    },
    {
        "Year":"2014",
        "Question":"7. Explain how Private Public Partnership arrangements, in long gestation infrastructure projects, can transfer unsustainable liabilities to the future. What arrangements need to be put in place to ensure that successive generations’ capacities are not compromised? "
    },
    {
        "Year":"2014",
        "Question":"8. National Urban Transport Policy emphasises on ‘moving people’ instead of ‘moving vehicles’. Discuss critically the success of the various strategies of the Government in this regard."
    },
    {
        "Year":"2014",
        "Question":"9. Foreign Direct Investment (FDI) in the defence sector is now set to be liberalized: What influence this is expected to have on Indian defence and economy in the short and long run?"
    },
    {
        "Year":"2014",
        "Question":"10. Scientific research in Indian universities is declining, because a career in science is not as attractive as are business professions, engineering or administration, and the universities are becoming consumer-oriented. Critically comment."
    },
    {
        "Year":"2014",
        "Question":"11. Can overuse and free availability of antibiotics without Doctor’s prescription, be contributors to the emergence of drug-resistant diseases in India? What are the available mechanisms for monitoring and control? Critically discuss the various issues involved."
    },
    {
        "Year":"2014",
        "Question":"12. In a globalized world, Intellectual Property Rights assume significance and are a source of litigation. Broadly distinguish between the terms—Copyrights, Patents and Trade Secrets."
    },
    {
        "Year":"2014",
        "Question":"13. Should the pursuit of carbon credits and clean development mechanisms set up under UNFCCC be maintained even though there has been a massive slide in the value of a carbon credit? Discuss with respect to India’s energy needs for economic growth."
    },
    {
        "Year":"2014",
        "Question":"14. Drought has been recognized as a disaster in view of its spatial expanse, temporal duration, slow onset and lasting effects on vulnerable sections. With a focus on the September 2010 guidelines from the National Disaster Management Authority (NDMA), discuss the mechanisms for preparedness to deal with likely El Nino and La Nina fallouts in India."
    },
    {
        "Year":"2014",
        "Question":"15. Environmental Impact Assessment studies are increasingly undertaken before a project is cleared by the Government. Discuss the environmental impacts of coal fired thermal plants located at coal pitheads. "
    },
    {
        "Year":"2014",
        "Question":"16. “The diverse nature of India as a multi-religious and multi-ethnic society is not immune to the impact of radicalism which is seen in her neighbourhood.\"Discuss along with strategies to be adopted  to counter this environment "
    },
    {
        "Year":"2014",
        "Question":"17. International civil aviation laws provide all countries complete and exclusive sovereignty over the airspace above their territory. What do you understand by ‘airspace’ What are the implications of these laws on the space above this airspace? Discuss the challenges which this poses and suggest ways to contain the threat."
    },
    {
        "Year":"2014",
        "Question":"18. How does illegal transborder migration pose a threat to India’s security? Discuss the strategies to curb this, bringing out the factors which give impetus to such migration."
    },
    {
        "Year":"2014",
        "Question":"19. In 2012, the longitudinal marking for high-risk areas for piracy was moved from 65 degrees east to 78 degrees east in the Arabian Sea by the International Maritime Organisation. What impact does this have on India’s maritime security concerns? "
    },
    {
        "Year":"2014",
        "Question":"20. China and Pakistan have entered into an agreement for development of an economic corridor. What threat does this pose for India’s security? Critically examine."
    },
    {
        "Year":"2015",
        "Question":"1. The nature of economic growth in India in recent times is often described as a jobless growth. Do you agree with this view? Give arguments in favour of your answer."
    },
    {
        "Year":"2015",
        "Question":"2. Livestock rearing has a big potential for providing non- farm employment and income in rural areas. Discuss suggesting suitable measures to promote this sector in India."
    },
    {
        "Year":"2015",
        "Question":"3. In the view of the declining average size of land holdings in India which has made agriculture non – viable for a majority of farmers should contract farming and land leasing be promoted in agriculture? Critically evaluate the pros and cons."
    },
    {
        "Year":"2015",
        "Question":"4. How can the Digital India program help farmers to improve farm productivity and income? What step has the government taken in this regard?"
    },
    {
        "Year":"2015",
        "Question":"5. In what way could replacement of price subsidy with direct benefit Transfer (DBT) change the scenario of subsidies in India? Discuss."
    },
    {
        "Year":"2015",
        "Question":"6. What are the impediments in marketing and supply chain management in developing the food processing industry in India? Can e-commerce help in overcoming this bottleneck?"
    },
    {
        "Year":"2015",
        "Question":"7. Craze for gold in Indian has led to surge in import of gold in recent years and put pressure on balance of payments and external value of rupee. In view of this, examine the merits of Gold Monetization scheme."
    },
    {
        "Year":"2015",
        "Question":"8. “Success of make in India program depends on the success of Skill India programme and radical labour reforms.” Discuss with logical arguments."
    },
    {
        "Year":"2015",
        "Question":"9. To what factors can be the recent dramatic fall in equipment cost and tariff of solar energy be attributed? What implications does the trend have for thermal power producers and related industry?"
    },
    {
        "Year":"2015",
        "Question":"10. There is a clear acknowledgement that Special Economic Zones (SEZs) are a tool of industrial development, manufacturing and exports. Recognising this potential, the whole instrumentality of SEZs require augmentation. Discuss the issue plaguing the success of SEZs with respect to taxation, governing laws and administration."
    },
    {
        "Year":"2015",
        "Question":"11. What do you understand by “Standard Positioning System” and “Precision positioning system” in the GPS era? Discuss the advantage India perceives from its ambitious IRNSS programme employing just seven satellites."
    },
    {
        "Year":"2015",
        "Question":"12. What are the areas of prohibitive labour that can be sustainably managed by robots? Discuss the initiatives that can propel the research in premier research institutes for substantive and gainful innovation."
    },
    {
        "Year":"2015",
        "Question":"13. Discuss the advantage and security implication of cloud hosting of servers vis-a-vis in house machine based hosting for government business."
    },
    {
        "Year":"2015",
        "Question":"14. India’s Traditional Knowledge Digital Library (TKDL) which has a database containing formatted information on more than 2 million medicinal formulations is proving a powerful weapon in country’s fight against erroneous patents. Discuss the pro and cons of making the database available publicly available under open source licensing."
    },
    {
        "Year":"2015",
        "Question":"15. Discuss the Namami Gange and National Mission for Clean Ganga (NMCG) programmes and causes of mixed results from the previous schemes. What quantum leaps can help preserve the river Ganga better than incremental inputs?"
    },
    {
        "Year":"2015",
        "Question":"16. The frequency of earthquakes appears to have increased in the Indian subcontinent. However, India’s preparedness for mitigating their impact has significant gaps. Discuss various aspects."
    },
    {
        "Year":"2015",
        "Question":"17. Human right activists constantly highlight the fact that the Armed forces (Special Powers) Act, 1958 (AFSPA) is a draconian act leading to cases of human right abuses by security forces. What sections of AFSPA are opposed by the activists. Critically evaluate the requirement with reference to the view held by Apex Court."
    },
    {
        "Year":"2015",
        "Question":"18. Religious indoctrination via social media has resulted in Indian youth joining the ISIS. What is ISIS and its mission? How can ISIS be dangerous to the internal security of our country."
    },
    {
        "Year":"2015",
        "Question":"19. The persisting drives of the government for development of large industries in backward areas have resulted in isolating the tribal population and the farmers who face multiple displacements. With Malkangiri and Naxalbari foci, discuss the corrective strategies needed to win the Left Wing Extremism (LWE) doctrine affected citizens back into mainstream of social and economic growth."
    },
    {
        "Year":"2015",
        "Question":"20. Considering the threats cyberspace poses for the country, India needs a “Digital Armed Forces” to prevent crimes. Critically evaluate the National Cyber Security Policy, 2013 outlining the challenges perceived in its effective implementation."
    },
    {
        "Year":"2016",
        "Question":"1. How globalization has led to the reduction of employment in the formal sector of the Indian economy? Is increased informalization detrimental to the development of the country?"
    },
    {
        "Year":"2016",
        "Question":"2. Women empowerment in India needs gender budgeting. What are the requirements and status of gender budgeting in the Indian context?"
    },
    {
        "Year":"2016",
        "Question":"3. Pradhan Mantri Jan Dhan Yojana (PMJDY) is necessary for bringing unbanked to the institutional finance fold. Do you agree with this for financial inclusion of the poor section of the Indian society? Give arguments to justify your opinion."
    },
    {
        "Year":"2016",
        "Question":"4. What are ‘Smart Cities’? Examine their relevance for urban development in India. Will it increase rural-urban differences? Give arguments for ’Smart Villages’ in the light of PURA and RURBAN Mission."
    },
    {
        "Year":"2016",
        "Question":"5. Justify the need for FDI for the development of the Indian economy. Why there is gap between MOUs signed and actual FDIs? Suggest remedial steps to be taken for increasing actual FDIs in India."
    },
    {
        "Year":"2016",
        "Question":"6. Comment on the challenges for inclusive growth which include careless and useless manpower in the Indian context. Suggest measures to be taken for facing these challenges."
    },
    {
        "Year":"2016",
        "Question":"7. What is water-use efficiency? Describe the role of micro-irrigation in increasing the water-use efficiency."
    },
    {
        "Year":"2016",
        "Question":"8. What is allelopathy? Discuss its role in major cropping systems of irrigated agriculture."
    },
    {
        "Year":"2016",
        "Question":"9. Discuss the role of land reforms in agricultural development. Identify the factors that were responsible for the success of land reforms in India."
    },
    {
        "Year":"2016",
        "Question":"10. Given the vulnerability of Indian agriculture to vagaries of nature, discuss the need for crop insurance and bring out the salient features of the Pradhan Mantri Fasal Bima Yojana (PMFBY)."
    },
    {
        "Year":"2016",
        "Question":"11. Give an account of the current status and the targets to be achieved pertaining to renewable energy sources in the country. Discuss in brief the importance of National Programme on Light Emitting Diodes (LEDs)."
    },
    {
        "Year":"2016",
        "Question":"12. Discuss India’s achievements in the field of Space Science and Technology. How the application of this technology has helped India in its socio-economic development?"
    },
    {
        "Year":"2016",
        "Question":"13. Why is nanotechnology one of the key technologies of the 21st century? Describe the salient features of Indian Government’s Mission on Nano-science and Technology and the scope of its application in the development process of the country."
    },
    {
        "Year":"2016",
        "Question":"14. Rehabilitation of human settlements is one of the important environmental impacts which always attracts controversy while planning major projects. Discuss the measures suggested for mitigation of this impact while proposing major developmental projects."
    },
    {
        "Year":"2016",
        "Question":"15. The frequency of urban floods due to high intensity rainfall is increasing over the years. Discussing the reasons for urban floods, highlight the mechanisms for preparedness to reduce the risk during such events."
    },
    {
        "Year":"2016",
        "Question":"16. With reference to National Disaster Management Authority (NDMA) guidelines, discuss the measures to be adopted to mitigate the impact of recent incidents of cloudbursts in many places of Uttarakhand."
    },
    {
        "Year":"2016",
        "Question":"17. The terms ‘Hot Pursuit’ and ‘Surgical Strikes’ are often used in connection with armed action against terrorist attacks. Discuss the strategic impact of such actions."
    },
    {
        "Year":"2016",
        "Question":"18. ‘Terrorism is emerging as a competitive industry over the last few decades.” Analyse the above statement. "
    },
    {
        "Year":"2016",
        "Question":"19. Border management is a complex task due to difficult terrain and hostile relations with some countries. Elucidate the challenges and strategies for effective border management."
    },
    {
        "Year":"2016",
        "Question":"20. Use of internet and social media by non-state actors for subversive activities is a major security concern. How have these been misused in the recent past? Suggest effective guidelines to curb the above threat."
    },
    {
        "Year":"2017",
        "Question":"1. Among several factors for India’s potential growth, savings rate is the most effective one. Do you agree? What are the other factors available for growth potential? (Answer in 150 words)"
    },
    {
        "Year":"2017",
        "Question":"2. Account for the failure of manufacturing sector in achieving the goal of labour intensive exports rather than capital-intensive exports. Suggest measures for more labour-intensive rather than capital-intensive exports."
    },
    {
        "Year":"2017",
        "Question":"3. Examine the developments of Airports in India through Joint Ventures under Public- Private Partnership(PPP) model. What are the challenges faced by the authorities in this regard."
    },
    {
        "Year":"2017",
        "Question":"4. Explain various types of revolutions, took place in Agriculture after Independence in India. How these revolutions have helped in poverty alleviation and food security in India?"
    },
    {
        "Year":"2017",
        "Question":"5. What are the reasons for poor acceptance of cost effective small processing unit? How the food processing unit will be helpful to uplift the socio-economic status of poor farmers?"
    },
    {
        "Year":"2017",
        "Question":"6. Stem cell therapy is gaining popularity in India to treat a wide variety of medical conditions including leukaemia, Thallessemia, damaged sornea and several burns. Describe briefly what stem cell therapy is and what advantages it has over other treatments?"
    },
    {
        "Year":"2017",
        "Question":"7. India has achieved remarkable successes in unmanned space missions including the Chandrayaan and Mars Orbitter Mission, but has not ventured into manned space mission, both in terms of technology and logistics? Explain critically"
    },
    {
        "Year":"2017",
        "Question":"8. Not many years ago, river linking was a concept but it is becoming reality in the country. Discuss the advantages of river linking and its possible impact on the environment."
    },
    {
        "Year":"2017",
        "Question":"9. Discuss the potential threats of Cyber attack and the security framework to prevent it."
    },
    {
        "Year":"2017",
        "Question":"10. The north-eastern region of India has been infested with insurgency for a very long time. Analyze the major reasons for the survival of armed insurgency in this region."
    },
    {
        "Year":"2017",
        "Question":"11. One of the intended objectives of Union Budget 2017-18 is to ‘transform, energize and clean India’. Analyse the measures proposed in the Budget 2017-18 to achieve the objective."
    },
    {
        "Year":"2017",
        "Question":"12. “Industrial growth rate has lagged behind in the overall growth of Gross-Domestic- Product(GDP) in the post-reform period” Give reasons. How far the recent changes is Industrial Policy are capable of increasing the industrial growth rate?"
    },
    {
        "Year":"2017",
        "Question":"13. What are the salient features of ‘inclusive growth’? Has India been experiencing such a growth process? Analyze and suggest measures for inclusive growth.  (250 words, 15 marks)"
    },
    {
        "Year":"2017",
        "Question":"14. What are the major reasons for declining rice and wheat yield in the cropping system? How crop diversification is helpful to stabilize the yield of the crop in the system? (Answer in 250 words)"
    },
    {
        "Year":"2017",
        "Question":"15. How do subsidies affect the cropping pattern, crop diversity and economy of farmers? What is the significance of crop insurance, minimum support price and food processing for small and marginal farmers?"
    },
    {
        "Year":"2017",
        "Question":"16. Give an account of the growth and development of nuclear science and technology in India. What is the advantage of fast breeder reactor programme in India?"
    },
    {
        "Year":"2017",
        "Question":"17. ‘Climate Change’ is a global problem. How India will be affected by climate change? How Himalayan and coastal states of India will be affected by climate change?"
    },
    {
        "Year":"2017",
        "Question":"18. On December 2004, tsumani brought havoc on 14 countries including India. Discuss the factors responsible for occurrence of Tsunami and its effects on life and economy. In the light of guidelines of NDMA (2010) describe the mechanisms for preparedness to reduce the risk during such events."
    },
    {
        "Year":"2017",
        "Question":"19. Mob violence is emerging as a serious law and order problem in India. By giving suitable examples, analyze the causes and consequences of such violence."
    },
    {
        "Year":"2017",
        "Question":"20. The scourge of terrorism is a grave challenge to national security. What solutions do you suggest to curb this growing menace? What are the major sources of terrorist funding?"
    },
    {
        "Year":"2018",
        "Question":"1.“Access to affordable, reliable, sustainable and modern energy is the sine qua non to achieve Sustainable Development Goals (SDGs)”.Comment on the progress made in India in this regard. (150 Words, 10 Marks)"
    },
    {
        "Year":"2018",
        "Question":"2.Comment on the important changes introduced in respect of the Long term Capital Gains Tax (LCGT) and Dividend Distribution Tax (DDT) in the Union Budget for 2018-2019. (150 Words, 10 Marks)"
    },
    {
        "Year":"2018",
        "Question":"3.What do you mean by Minimum Support Price (MSP)? How will MSP rescue the farmers from the low income trap? (150 Words, 10 Marks)"
    },
    {
        "Year":"2018",
        "Question":"4.Examine the role of supermarkets in supply chain management of fruits, vegetables and food items. How do they eliminate number of intermediaries? (150 Words, 10 Marks)"
    },
    {
        "Year":"2018",
        "Question":"5.Discuss the work of ‘Bose-Einstein Statistics’ done by Prof. Satyendra Nath Bose and show how it revolutionized the field of Physics. (150 Words, 10 Marks)"
    },
    {
        "Year":"2018",
        "Question":"6.What are the impediments in disposing the huge quantities of discarded solid wastes which are continuously being generated? How do we remove safely the toxic wastes that have been accumulating in our habitable environment? (150 Words, 10 Marks)"
    },
    {
        "Year":"2018",
        "Question":"7.What is wetland? Explain the Ramsar concept of ‘wise use’ in the context of wetland conservation. Cite two examples of Ramsar sites from India. (150 Words, 10 Marks)"
    },
    {
        "Year":"2018",
        "Question":"8.Sikkim is the first ‘Organic State’ in India. What are the ecological and economical benefits of Organic State? (150 Words, 10 Marks)"
    },
    {
        "Year":"2018",
        "Question":"9.The China Pakistan Economic Corridor (CPEC) is viewed as a cardinal subset of China’s larger ‘One Belt One Road’ initiative. Give a brief description of CPEC and enumerate the reasons why India has distanced itself from the same. (150 Words, 10 Marks)"
    },
    {
        "Year":"2018",
        "Question":"10.Left Wing Extremism (LWE) is showing a downward trend, but still affects many parts of the country. Briefly explain the Government of India’s approach to counter the challenges posed by LWE. (150 Words, 10 Marks)"
    },
    {
        "Year":"2018",
        "Question":"11.How are the principles followed by NITI Aayog different from those followed by the erstwhile planning commission in India?(250 Words, 15 Marks)"
    },
    {
        "Year":"2018",
        "Question":"12.How would the recent phenomena of protectionism and currency manipulations in world trade affect macroeconomic stability of India? (250 Words, 15 Marks)"
    },
    {
        "Year":"2018",
        "Question":"13.Assess the role of National Horticulture Mission (NHM) in boosting the production, productivity and income of horticulture farms. How far has it succeeded in increasing the income of farmers? (250 Words, 15 Marks)"
    },
    {
        "Year":"2018",
        "Question":"14.How has the emphasis on certain crops brought about changes in cropping patterns in recent past? Elaborate the emphasis on millets production and consumption. (250 Words, 15 Marks)"
    },
    {
        "Year":"2018",
        "Question":"15.Why is there so much activity in the field of biotechnology in our country? How has this activity benefitted the field of biopharma? (250 Words, 15 Marks)"
    },
    {
        "Year":"2018",
        "Question":"16.With growing energy needs should India keep on expanding its nuclear energy programme? Discuss the facts and fears associated with nuclear energy. (250 Words, 15 Marks)"
    },
    {
        "Year":"2018",
        "Question":"17.How does biodiversity vary in India? How is the Biological Diversity Act,2002 helpful in conservation of flora and fauna? (250 Words, 15 Marks)"
    },
    {
        "Year":"2018",
        "Question":"18.Describe various measures taken in India for Disaster Risk Reduction (DRR) before and after signing ‘Sendai Framework for DRR (2015-2030)’. How is this framework different from ‘Hyogo Framework for Action, 2005’? (250 Words, 15 Marks)"
    },
    {
        "Year":"2018",
        "Question":"19.Data security has assumed significant importance in the digitized world due to rising cyber-crimes. The Justice B. N. Srikrishna Committee Report addresses issues related to data security. What, in your view, are the strengths and weaknesses of the Report relating to protection of personal data in cyber space? (250 Words, 15 Marks)"
    },
    {
        "Year":"2018",
        "Question":"20.India’s proximity to two of the world’s biggest illicit opium-growing states has enhanced her internal security concerns. Explain the linkages between drug trafficking and other illicit activities such as gunrunning, money laundering and human trafficking. What countermeasures should be taken to prevent the same? (250 Words, 15 Marks)"
    }
]