	[
		
		{
			"Year":"1979",
			"Question":"2. What light does the study of earthquake, waves throw on the inner constitution of the earth?"
		},
		{
			"Year":"1979",
			"Question":"3. Discuss the polar Front theory and examine how far it can be applied to explain the origin of tropical cyclones."
		},
		{
			"Year":"1979",
			"Question":"4. What factors control the density of ocean waters? Show how differences of surface density determine the movements of water (a) in the open ocean and (b) between the ocean and its partially enclosed seas."
		},
		{
			"Year":"1979",
			"Question":"5. ‘The land regulates the destinies of peoples with a blind brutality? (Ratzal). Discuss fully the arguments in favour and against this view."
		},
		{
			"Year":"1979",
			"Question":"6. ‘The 49th parallel is a boundary without a frontier the Himalayas is a frontier without a boundary.? Discuss fully, bringing out the implications of this to the countries involved."
		},
		{
			"Year":"1979",
			"Question":"7. Examine the aims and assets the achievements of Prince Henry and Navigator."
		},
		{
			"Year":"1979",
			"Question":"8. ‘The successful location of iron and steel plants is largely a matter of transportation costs, not merely of raw materials but also of finished products.? Discuss with illustrate examples."
		},
		{
			"Year":"1979",
			"Question":"9. ‘Till about 1700 A.D. the history of India, was to a large extent delimited by its Geography.? Analyse fully."
		},
		{
			"Year":"1979",
			"Question":"10. Describe the main racial characteristics and the cultural attainments of either the Todas or the Santhals."
		},
		{
			"Year":"1979",
			"Question":"11. ‘The distinction between ‘Wet-Zone’ and ‘Dry-Zone is fundamental in the agriculture of the Monsoon lands, resulting in typical crop combinations?. Discuss with respect to either India or China."
		},
		{
			"Year":"1979",
			"Question":"Candidates should attempt Questions 1 and any four of the remaining questions, selecting"
		},
		{
			"Year":"1979",
			"Question":"1. With the help of selected examples, explain the relative importance of raw materials, and markets in the location and development of cotton textile industry."
		},
		{
			"Year":"1979",
			"Question":"2. Explain the significance of diagnostic surveys for regional planning."
		},
		{
			"Year":"1979",
			"Question":"3. Give a critical assessment of the concept of rural –urban fringe. What criteria would you suggest to democrat the rural urban fringe of Indian cities?"
		},
		{
			"Year":"1979",
			"Question":"4. ‘The direct effect of physical factors on the distribution of population tends to decline as civilization becomes more advanced.? Discuss this statement."
		},
		{
			"Year":"1979",
			"Question":"6. No aviator or navigator can do without the charts based on Mercator’s and Gnomonic projections in order to reach his destination covering the least possible distance. Justify this statement."
		},
		{
			"Year":"1979",
			"Question":"7. Give the geographical factors which affect the distribution and density of population in India. Is India over-populated? Discuss the various measures for solving the population problem of India."
		},
		{
			"Year":"1979",
			"Question":"8. Account for the causes of soil erosion in India and discuss the method to control it."
		},
		{
			"Year":"1979",
			"Question":"9. Comment on the development of iron and steel industry in India since Independence and elucidate the future prospects of the Industry."
		},
		{
			"Year":"1979",
			"Question":"10. ‘A correct delineation and articulation of economic regions in geographic terms is an essential pre-requisite of economic development in developing country?. Justify this statement with reference to economic regionalization in India."
		},
		{
			"Year":"1979",
			"Question":"11. Do you consider that the agrarian problem lies at the root of all problems in India today? Support your answer with proper arguments."
		},
		{
			"Year":"1979",
			"Question":"12. Assess the importance of Damodar Valley project or any other multipurpose river valley project, in the economy of the region."
		},
		{
			"Year":"1980",
			"Question":"2. State, in detail, and appraise fully the arguments in favour of and against the theory of Continental Drift."
		},
		{
			"Year":"1980",
			"Question":"3. Discuss the complete mechanism by means of which the atmosphere is able to maintain its heat-balance. Is the atmosphere getting progressively hotter, and if so, why?"
		},
		{
			"Year":"1980",
			"Question":"4. Describe and account for the surface currents of the Indian Ocean and explain how and why they differ from those of the Atlantic."
		},
		{
			"Year":"1980",
			"Question":"5. Discuss the scope of human Geography."
		},
		{
			"Year":"1980",
			"Question":"6. Is it true to say that Machinder's \"Citadel of land power\" stands mightier than ever, even at the present day?"
		},
		{
			"Year":"1980",
			"Question":"7. What were the significant geographical ideas of the Arabs of the 10th and 12th centuries? How did they differ from those of their Christian contemporaries?"
		},
		{
			"Year":"1980",
			"Question":"8. Analyse the factors of localization of the Iron and Steel industry with special reference to India. Suggest an ideal location for this industry in India and make a comparative assessment of the advantages and disadvantages of Visakapatnam and Salem steel plants."
		},
		{
			"Year":"1980",
			"Question":"9. \"The gates of India have become water gates and the way to India, the way of the sea.\" (Sir Thomas Holdich). Analyse the role of geographical factors in controlling, through well defined gates, the entry into India of migrants, both in peace and in war, from the earliest times and assess their relative importance."
		},
		{
			"Year":"1980",
			"Question":"10. Discuss the basic geographical conditions, under which the pre-historic civilization of Indus Valley flourished and describe the nature and structure of the pre-historic cities of the region."
		},
		{
			"Year":"1980",
			"Question":"11. Assess the nature of the \"food problem\" of India, both qualitatively and quantitatively at the present time. What practical suggestions can you offer towards its solutions? "
		},
		{
			"Year":"1980",
			"Question":"1. \"The economic development of a country depends as much on he stage of development of the people as on the able resources. Discuss this statement with examples."
		},
		{
			"Year":"1980",
			"Question":"2. Discuss with examples the factors of origin and growth of towns and cities."
		},
		{
			"Year":"1980",
			"Question":"3. What are the determinants of population growth? Discuss comparatively the trends population growth in the developed and the developing countries of the world, mentioning the socio-economic implications of these trends in each case."
		},
		{
			"Year":"1980",
			"Question":"6. Give a critical account of the recent changes in agriculture in India which have contributed to the agricultural development in general, and the green revolution in particular."
		},
		{
			"Year":"1980",
			"Question":"7. Asses the comparative geographical importance of the power resources in the development of industrial landscape of India."
		},
		{
			"Year":"1980",
			"Question":"8. \"The density of population is, as it were, the synthesis of all geographical phenomena. \"Examine this statement with reference to the spatial patterns of population distribution and density in India."
		},
		{
			"Year":"1980",
			"Question":"9. Discuss the structure and evolution of the Himalayas."
		},
		{
			"Year":"1980",
			"Question":"10. Give an ideal geographical regionalization of India."
		},
		{
			"Year":"1981",
			"Question":"3. With particular reference to India, explain the origin of the \"monsoon\". Describe and account for the World distribution of monsoon climates, bringing out the significant differences between each of them."
		},
		{
			"Year":"1981",
			"Question":"4. With suitable examples selected from different part of the World, discuss, in detail, the problems in using either language or religion as a criterion for boundary determinations."
		},
		{
			"Year":"1981",
			"Question":"5. Present the classification of Oceanic deposits and account for the origin, types and distribution of Pelagic deposits in the World Oceans."
		},
		{
			"Year":"1981",
			"Question":"6. Analyse the factors of localization of the cotton-textile industries, and assess how far their location has been influenced by the availability of indigenous raw materials and proximity to the markets."
		},
		{
			"Year":"1981",
			"Question":"7. \"Over two thirds of the crop land of the United States is devoted to feed crops and only slightly over one-fifth to food crops.\" Discuss the implications of the above statement. Explain with reasons why the conditions are totally different in India."
		},
		{
			"Year":"1981",
			"Question":"8(a) Sir Halford Mackinder (b) Sir Dudley Stamp"
		},
		{
			"Year":"1981",
			"Question":"8(i) Definition and Scope of Economic Geography"
		},
		{
			"Year":"1981",
			"Question":"8(ii) Central Business District"
		},
		{
			"Year":"1981",
			"Question":"8(iii) Demographic Transition"
		},
		{
			"Year":"1981",
			"Question":"8(iv) Significance of Projected Profiles"
		},
		{
			"Year":"1981",
			"Question":"2. Examine the role of pull and push factors in the migration of population. (a) Major Soil Types of India  (b) Trend of Population Growth in India since 1901, and Significant Contributory Factors  (c) Rajasthan Canal Project (d) Bases of Geographical Regionalization of India."
		},
		{
			"Year":"1981",
			"Question":"6. Discuss the effect of relief and climate on the distribution of crops in India."
		},
		{
			"Year":"1981",
			"Question":"7. Make an assessment of the relative significance of renewable and non-renewable energy resources of India. What suggestions would you give for solving the energy-crisis in India?"
		},
		{
			"Year":"1981",
			"Question":"8. Explain the various population problems of India and suggest as to how this large human-resource can be made useful in the economic development of the country."
		},
		{
			"Year":"1982",
			"Question":"3. Discuss the mountain building process in the world with a special reference to the origin of the Himalayas."
		},
		{
			"Year":"1982",
			"Question":"4. \"In the northern part of the Indian ocean there is a complete reversal of currents between winter and summer as a result of the alternating monsoon winds.\" Discuss."
		},
		{
			"Year":"1982",
			"Question":"5. \"The position of United States in respect of power is almost impregnable at present and in future. The U.S.S.R. is well situated although less so than the Unites States.\""
		},
		{
			"Year":"1982",
			"Question":"6. Discuss the factors of location of iron and steel industries in Great Britain with special reference to the shifts in their location after the World War II."
		},
		{
			"Year":"1982",
			"Question":"7. Discuss the contributions of either Paul Vidal De La Blache or W.M. Davis in advancement of our geographical knowledge."
		},
		{
			"Year":"1982",
			"Question":"8. Mention the types of farming commonly being practised in the tropics. Discuss their significance and the present position in the international market."
		},
		{
			"Year":"1982",
			"Question":"1(a) Discuss with suitable examples the influence of environment on productive occupation in the world"
		},
		{
			"Year":"1982",
			"Question":"1(b) What is meant by Urban Functions? How are they different from Rural Functions?"
		},
		{
			"Year":"1982",
			"Question":"1(c) Critically examine the concept of optimum population."
		},
		{
			"Year":"1982",
			"Question":"1(d) Is the Quantitative method in Geography a means to an end or the Geographic method itself? Discuss clearly bringing out the purpose of Geography."
		},
		{
			"Year":"1982",
			"Question":"2. What is regional survey? How does it lead to planning? Discuss with suitable examples."
		},
		{
			"Year":"1982",
			"Question":"3. Discuss the distribution pattern of population in India. State how geographic factors have influenced it."
		},
		{
			"Year":"1982",
			"Question":"4. Which projection will you choose for the drawing of a map of the world to indicate sea routes? Discuss its properties."
		},
		{
			"Year":"1982",
			"Question":"5(a) Discuss the structure of the Peninsular India."
		},
		{
			"Year":"1982",
			"Question":"5(b) Discuss the value of the Narbada Irrigation Project in economic development of Western India."
		},
		{
			"Year":"1982",
			"Question":"5(c) What are the problems of the Cotton Textile Industry in India?"
		},
		{
			"Year":"1982",
			"Question":"5(d) Assess the iron ore resources of India."
		},
		{
			"Year":"1982",
			"Question":"6. Give a brief account of the Power Resources of India and indicate how far they are developed."
		},
		{
			"Year":"1982",
			"Question":"7. India's budget is a gamble with the Monsoon. Elaborate the statement. How far does the variability of rainfall influence agriculture? What remedies have been effected? Divide India into its natural regions. State the basis which you have adopted."
		},
		{
			"Year":"1983",
			"Question":"1(a) Polycyclic land mass"
		},
		{
			"Year":"1983",
			"Question":"1(b) Jet stream"
		},
		{
			"Year":"1983",
			"Question":"1(c) Ecological imbalance"
		},
		{
			"Year":"1983",
			"Question":"1(d) World energy crisis"
		},
		{
			"Year":"1983",
			"Question":"3. 'Landscape is the function of structure, process and stage.' Discuss."
		},
		{
			"Year":"1983",
			"Question":"4. Divide world into major biotic regions giving the basis of your division."
		},
		{
			"Year":"1983",
			"Question":"5. Discuss different types of maribe resources and mention their possible utilization."
		},
		{
			"Year":"1983",
			"Question":"6. Write a critical essay on the quantitative revolution in Geography."
		},
		{
			"Year":"1983",
			"Question":"7. Briefly discuss the trend of urbanisation in the world since the beginning of the present century."
		},
		{
			"Year":"1983",
			"Question":"8. Discuss the food and nutrition problems of the world."
		},
		{
			"Year":"1983",
			"Question":"1(a) Examine the origin of the Deccan lavas and describe the scenery associated with it."
		},
		{
			"Year":"1983",
			"Question":"1(b) Comment on the role of social forestry in the economy of India."
		},
		{
			"Year":"1983",
			"Question":"1(c) Give a brief account of the petroleum resources of India."
		},
		{
			"Year":"1983",
			"Question":"1(d) Discuss the problems of livestock raising in India."
		},
		{
			"Year":"1983",
			"Question":"2. \"There is a gulf between rainfall statistics and water availability.\" Elucidate this statement with reference to the agricultural efficiency of any region in India."
		},
		{
			"Year":"1983",
			"Question":"3. Linguistic regions in India may have a cultural reality but no economic base. Examine this view illustrate your answer with suitable examples."
		},
		{
			"Year":"1983",
			"Question":"4. Discuss the factors which interact to limit the area within which a crop may be successfully grown commercially in India. Give examples to justify your arguments."
		},
		{
			"Year":"1983",
			"Question":"5(a) The inadequacy of transport is the major obstacle to the trade and production of India."
		},
		{
			"Year":"1983",
			"Question":"5(b) Factors contributing to the growth of the urban fringe of either Calcutta or Bombay."
		},
		{
			"Year":"1983",
			"Question":"5(c) \"Core Areas\" for successful regional planning in India."
		},
		{
			"Year":"1983",
			"Question":"5(d) The North Western Frontiers of India and the related political problem."
		},
		{
			"Year":"1983",
			"Question":"6. What are the factors influencing the localization of industry? Illustrate your answer with reference to the Iron and Steel industry of India."
		},
		{
			"Year":"1983",
			"Question":"7. Indian cities are lacking in layout and function. How far is this true and what historical and cultural factors are responsible for these features?"
		},
		{
			"Year":"1983",
			"Question":"8. How far is it true to say that the Indian Ocean is actually and potentially a major focus of international relations and dispute?"
		},
		{
			"Year":"1984",
			"Question":"1(a) Karst land forms"
		},
		{
			"Year":"1984",
			"Question":"1(b) Marine resources"
		},
		{
			"Year":"1984",
			"Question":"1(c) Urban sphere of influence"
		},
		{
			"Year":"1984",
			"Question":"1(d) Federalism"
		},
		{
			"Year":"1984",
			"Question":"3. Discuss the mountain-building processes with suitable examples."
		},
		{
			"Year":"1984",
			"Question":"4. Discuss the concept of warm and cold fronts and the weather associated with them."
		},
		{
			"Year":"1984",
			"Question":"5. Discuss man's role in creating ecological imbalances taking examples from a geographical region."
		},
		{
			"Year":"1984",
			"Question":"6. Critically examine the development of determinism and possibilism in Geography."
		},
		{
			"Year":"1984",
			"Question":"7. Discuss the petroleum resources of the Middle East and its impact on international politics."
		},
		{
			"Year":"1984",
			"Question":"8. Discuss the general distributional pattern of industrial development in the world and its associated problems."
		},
		{
			"Year":"1984",
			"Question":"1(a) Mountains as climatic barriers and their effect on the Indian Monsoons."
		},
		{
			"Year":"1984",
			"Question":"1(b) Why do rivers flood? State the areas of occurrence of floods in India."
		},
		{
			"Year":"1984",
			"Question":"1(c) Problems involved in the economic development of tribal areas of India."
		},
		{
			"Year":"1984",
			"Question":"1(d) Dairy Industry in India."
		},
		{
			"Year":"1984",
			"Question":"2. Discuss the problems of agricultural development in the arid and semi -arid regions of India."
		},
		{
			"Year":"1984",
			"Question":"3. Discuss the value of a quantitative analysis of crop combinations for an agricultural regionalization of India. Illustrate your answer from an area of which you have personal knowledge."
		},
		{
			"Year":"1984",
			"Question":"4. \"The present economic policy of India represents an attempt to maintain a balance between a subsistence agricultural economy and a top-heavy industrial economy.\" Critically examine the statement."
		},
		{
			"Year":"1984",
			"Question":"5(a) Unity and diversity are both inherent in Federalism."
		},
		{
			"Year":"1984",
			"Question":"5(b) The sea as a source of raw materials."
		},
		{
			"Year":"1984",
			"Question":"5(c) Importance of coastal shipping in India."
		},
		{
			"Year":"1984",
			"Question":"5(d) Fertilizer industry of India."
		},
		{
			"Year":"1984",
			"Question":"6. Discuss the location of and the modern trends in, the cotton textile industry of India."
		},
		{
			"Year":"1984",
			"Question":"7. Discuss the impact of the development of electrical power in India on its industrialisation."
		},
		{
			"Year":"1984",
			"Question":"8. What contribution has the geographer to make to an understanding of the problems of land use in big cities?"
		},
		{
			"Year":"1985",
			"Question":"1(a) Hydrological Cycle"
		},
		{
			"Year":"1985",
			"Question":"1(b) Ecosystem Concept"
		},
		{
			"Year":"1985",
			"Question":"1(c) Rural Settlement Patterns"
		},
		{
			"Year":"1985",
			"Question":"1(d) Regional Concept in Geography"
		},
		{
			"Year":"1985",
			"Question":"3. Discuss the character of the main types of force and earth movements, involved in the production of land forms."
		},
		{
			"Year":"1985",
			"Question":"4. Classify soils of the world and discuss the distribution and characteristics of each."
		},
		{
			"Year":"1985",
			"Question":"5. Discuss the sources and nature of various deposit found on the floor of the oceans."
		},
		{
			"Year":"1985",
			"Question":"6. Discuss the causes and consequences of major inter national migrations of the present time."
		},
		{
			"Year":"1985",
			"Question":"7. Discuss the concepts of heartland and rimland and examine their present day validity."
		},
		{
			"Year":"1985",
			"Question":"8. Mention different types of world agriculture and describe the areas and salient features of each type."
		},
		{
			"Year":"1985",
			"Question":"1(a) Describe the physiographic characteristics of the Western Himalayas."
		},
		{
			"Year":"1985",
			"Question":"1(b) To what extent has the high yielding variety programme helped agricultural development in India?"
		},
		{
			"Year":"1985",
			"Question":"1(c) Why has attention been given to the development of marine fisheries in India? Describe the efforts that have been directed for their development."
		},
		{
			"Year":"1985",
			"Question":"1(d) Describe the impact of the rise in population density on economic development in India."
		},
		{
			"Year":"1985",
			"Question":"2. Attempt a division of India into climatic regions and described their characteristics and floral conditions."
		},
		{
			"Year":"1985",
			"Question":"3. Write an account of the growth and utilisation of irrigation potential in India with particular reference to canal irrigation."
		},
		{
			"Year":"1985",
			"Question":"4. Discuss the concept of land reform and indicate its importance for promoting agricultural development in India."
		},
		{
			"Year":"1985",
			"Question":"5(a) Importance of road transport in India-Development under the Plans."
		},
		{
			"Year":"1985",
			"Question":"5(b) Rural settlement patterns in the Ganga Valley."
		},
		{
			"Year":"1985",
			"Question":"5(c) Industrial development in India during the Second and Third Plans."
		},
		{
			"Year":"1985",
			"Question":"5(d) Problems of slums and urban development with particular reference to any metropolis in India."
		},
		{
			"Year":"1985",
			"Question":"6. Write an account of the raw materials, location, present situation and future prospects of the paper industry in India."
		},
		{
			"Year":"1985",
			"Question":"7. Discuss the regional disparities in the growth of manufacturing industries in India. Suggest remedies."
		},
		{
			"Year":"1985",
			"Question":"8. Discuss the quality distribution and utilisation of coal in India."
		},
		{
			"Year":"1986",
			"Question":"2(a) World's biotic regions"
		},
		{
			"Year":"1986",
			"Question":"2(b) Pelagic deposits"
		},
		{
			"Year":"1986",
			"Question":"2(c) Demographic transition"
		},
		{
			"Year":"1986",
			"Question":"2(d) Diffusion of innovation"
		},
		{
			"Year":"1986",
			"Question":"3. Discuss the views of W.M. Davis and Walter Penck on the cycle of erosion."
		},
		{
			"Year":"1986",
			"Question":"4. Compare the basis of the climatic classification of Koppen with that of Thornthwaite's classification."
		},
		{
			"Year":"1986",
			"Question":"5. Give an account of marine resources and discuss their present day utilization."
		},
		{
			"Year":"1986",
			"Question":"6. What is meant by quantitative revolution in Geography? Discuss its impact on the development of the subject."
		},
		{
			"Year":"1986",
			"Question":"7. Define the urban sphere of influences and discuss different methods of determining the spheres of influence of cities."
		},
		{
			"Year":"1986",
			"Question":"8. Discuss the genetic classification of international boundaries. How does it differ from the morphological classification?"
		},
		{
			"Year":"1986",
			"Question":"1(a) The drainage systems of the two regions. Peninsular and extra-Peninsular India are very different in their character. What are these difference and way?"
		},
		{
			"Year":"1986",
			"Question":"1(b) Discuss the environmental problems regarding industrial pollution in India."
		},
		{
			"Year":"1986",
			"Question":"1(c) Discuss briefly the utilization, distribution and production of manganese in India."
		},
		{
			"Year":"1986",
			"Question":"1(d) Describe the programmes for management and development of forests in India under the National Forest Policy. Mention briefly the roles of other institutions in the development of forestry in the country."
		},
		{
			"Year":"1986",
			"Question":"2. Describe the problems of production and distribution of food crops in India from the regional point of view."
		},
		{
			"Year":"1986",
			"Question":"3. Discuss the geographical bases for rural industrialization for rural development."
		},
		{
			"Year":"1986",
			"Question":"4. Give an account of the infrastructural factors necessary for promoting agricultural development in the dry zones of India with specific examples."
		},
		{
			"Year":"1986",
			"Question":"5(a) Development of Railway transport in India during different plan periods."
		},
		{
			"Year":"1986",
			"Question":"5(b) Functional and hierarchical patterns of Indian cities."
		},
		{
			"Year":"1986",
			"Question":"5(c) Aluminium industry in India."
		},
		{
			"Year":"1986",
			"Question":"5(d) Regional Planning in India."
		},
		{
			"Year":"1986",
			"Question":"6. Discuss the location, present situation and future prospects of the jute industry in India."
		},
		{
			"Year":"1986",
			"Question":"7. What is an industrial complex? Describe the growth, problems and prospects of any major industrial complex in India."
		},
		{
			"Year":"1986",
			"Question":"8. Examine the geographical bases for growth of regional consciousness and regionalism during last three decades in India."
		},
		{
			"Year":"1987",
			"Question":"1(a) Characteristics of monsoon forests"
		},
		{
			"Year":"1987",
			"Question":"1(b) Systems approach in Geography"
		},
		{
			"Year":"1987",
			"Question":"1(c) Concepts of nation and state"
		},
		{
			"Year":"1987",
			"Question":"1(d) Theories of agricultural location."
		},
		{
			"Year":"1987",
			"Question":"3. Give a reasoned account of the contents of the Atlantic Ocean and their impact on the climatic conditions of the coastal regions."
		},
		{
			"Year":"1987",
			"Question":"4. Discuss critically the characteristics of tropical cyclones and analyse the extent to which they differ from the temperate cyclones."
		},
		{
			"Year":"1987",
			"Question":"5. Discuss the evolution and characteristics of the land forms of graciated regions."
		},
		{
			"Year":"1987",
			"Question":"6. Give an account of the existing distributional pattern of population in the world and give your assessment regarding the importance of geographical factors for such a pattern."
		},
		{
			"Year":"1987",
			"Question":"7. Examine the various theories concerning the internal structure of cities and discuss how far they are applicable to Indian cities."
		},
		{
			"Year":"1987",
			"Question":"18. Give an account of the pattern of international trade and examine the linkages between resource endowed regions and resource utilizing regions."
		},
		{
			"Year":"1987",
			"Question":"1(a) Give the salient features of the Aravallis is with respect to geologic structure, relief and impact on human settlements."
		},
		{
			"Year":"1987",
			"Question":"1(b) Discuss the ecological problems associated with the use of river water resources in India."
		},
		{
			"Year":"1987",
			"Question":"1(c) Outline the impact of land reform measures on agricultural development in India."
		},
		{
			"Year":"1987",
			"Question":"1(d) Indicate the criteria of identification, demarcate the industrially backward areas of India and enumerate the main hurdles in their development."
		},
		{
			"Year":"1987",
			"Question":"2. Analyse the mechanism of Indian Monsoon. How are the spatial temporal variations and vicissitudes in precipitation related to this mechanism?"
		},
		{
			"Year":"1987",
			"Question":"3. Discuss the population problem of India in regional perspective and make specific suggestions for tackling the problem with respect to the broad population regions."
		},
		{
			"Year":"1987",
			"Question":"4. Outline the agricultural regions of India indicating the bases of regionalization. Bring out the factors responsible for the emergence of different crop combination in different regions."
		},
		{
			"Year":"1987",
			"Question":"5(a) Functional and Morphological Typology of Indian cities"
		},
		{
			"Year":"1987",
			"Question":"5(b) Agro-based Industries of India"
		},
		{
			"Year":"1987",
			"Question":"5(c) Centre-State relations and multi-level planning in India"
		},
		{
			"Year":"1987",
			"Question":"5(d) Geopolitical significance of Industrial Policy in Indian Ocean"
		},
		{
			"Year":"1987",
			"Question":"6. Trace the evolution of Industrial Policy in India and bring on its impact on industrial development of the country."
		},
		{
			"Year":"1987",
			"Question":"7. Discuss the significance, traffic flow pattern, emerging trends and problems of road transport in India."
		},
		{
			"Year":"1987",
			"Question":"8. Analyse the causes and consequences of regional disparity in the economic development of India and outline measures to reduce disparity."
		},
		{
			"Year":"1988",
			"Question":"2(a) Environmental Determinism"
		},
		{
			"Year":"1988",
			"Question":"2(b) Coral reets"
		},
		{
			"Year":"1988",
			"Question":"2(c) Geopolitics"
		},
		{
			"Year":"1988",
			"Question":"2(d) Karst landforms"
		},
		{
			"Year":"1988",
			"Question":"3. Attempt a classification of air masses and give the characteristic features and associated weather conditions of each class."
		},
		{
			"Year":"1988",
			"Question":"4. Discuss, in detail, man's impact on ecosystem as a result of the modern technological advancement."
		},
		{
			"Year":"1988",
			"Question":"5. Critically analyse the concept of plate tectonics and bring out the evidences to support it."
		},
		{
			"Year":"1988",
			"Question":"6. Give a critical account of the cultural evolution of man. Illustrate your answer with suitable examples."
		},
		{
			"Year":"1988",
			"Question":"7. Analyse Christaller's Central Place Theory and the modifications introduced in it and examine its relevance in the present day context."
		},
		{
			"Year":"1988",
			"Question":"8. Discuss the various sources of energy and their uses. Suggest the measures to overcome the present day energy crisis."
		},
		{
			"Year":"1988",
			"Question":"1(a) Bring out the role of irrigation in rural development of India."
		},
		{
			"Year":"1988",
			"Question":"1(b) Give the geographical cases of unity and diversity in India"
		},
		{
			"Year":"1988",
			"Question":"1(c) Discuss the utilization and conservation of coal of India resources."
		},
		{
			"Year":"1988",
			"Question":"1(d) Evaluate the Koppen's scheme of climatic regionalization of India."
		},
		{
			"Year":"1988",
			"Question":"2. Explain the salient features of the structure, relief and drainage of the Himalayas."
		},
		{
			"Year":"1988",
			"Question":"3. Analyse the ecological significance of forests in different regions of India indicating the impact of rapid deforestation."
		},
		{
			"Year":"1988",
			"Question":"4. Analyse the relationship between cropping intensity and agricultural productivity and throw light on the measures of increasing the cropping intensity in India."
		},
		{
			"Year":"1988",
			"Question":"5(a) Location and growth of Fertilizer Industry in India."
		},
		{
			"Year":"1988",
			"Question":"5(b) Characteristics of Rural-Urban Fringe in India."
		},
		{
			"Year":"1988",
			"Question":"5(c) Significance of District Planning in India."
		},
		{
			"Year":"1988",
			"Question":"5(d) The Sino-Indian Boundary."
		},
		{
			"Year":"1988",
			"Question":"6. Discuss the process, pattern and impact of urbanisation in India."
		},
		{
			"Year":"1988",
			"Question":"7. Differentiate between River Basin and Command Area. Discuss the advantages and disadvantages of River Basins as planning regions in India. Give concrete examples."
		},
		{
			"Year":"1988",
			"Question":"8. Demarcate the major industrial regions of India and analyse the structure and contribution to the national economy of any one of them."
		},
		{
			"Year":"1989",
			"Question":"1(a) Rejuvenated landforms"
		},
		{
			"Year":"1989",
			"Question":"1(b) Ocean bottom relief"
		},
		{
			"Year":"1989",
			"Question":"1(c) Major cultural realms of the world"
		},
		{
			"Year":"1989",
			"Question":"1(d) Classification of cities"
		},
		{
			"Year":"1989",
			"Question":"3. Explain the origin, characteristics and distribution of temperate cyclones."
		},
		{
			"Year":"1989",
			"Question":"4. Divide the world into major biotic regions and explain the basis of your division."
		},
		{
			"Year":"1989",
			"Question":"5. Examine the causes of ecological imbalances and briefly explain the measures taken to rectify them."
		},
		{
			"Year":"1989",
			"Question":"6. Write an essay on the contribution of European geographers to the development of geographic thought."
		},
		{
			"Year":"1989",
			"Question":"7. Discuss in detail the Heartland concept of Mackinder and the criticism it has attracted in recent years."
		},
		{
			"Year":"1989",
			"Question":"8. Review in detail the various theories of the location of industries."
		},
		{
			"Year":"1989",
			"Question":"1(a) Explain the causes of soil erosion occurring over extensive areas in certain parts of India. What measures would you suggest for solving this problem?"
		},
		{
			"Year":"1989",
			"Question":"1(b) Discuss the problems of the tribal areas and suggest measures for solving them."
		},
		{
			"Year":"1989",
			"Question":"1(c) Assess the fish resources of India and examine the present and future prospects of their exploitation."
		},
		{
			"Year":"1989",
			"Question":"1(d) Analyse the spatial patterns of the utilization of ground water for tube-well irrigation in different parts of India."
		},
		{
			"Year":"1989",
			"Question":"2. Give an outline of the geological history of the Peninsular India and in its terms. Explain the salient features of the relief of the areas."
		},
		{
			"Year":"1989",
			"Question":"3. Analyse the recent trends in the growth and density of population of India and evaluate the socio-economic and environmental problems generated by them."
		},
		{
			"Year":"1989",
			"Question":"4. Formulate a suitable agricultural land-use policy that will achieve the twin goals of optimum agricultural efficiency and crop productivity."
		},
		{
			"Year":"1989",
			"Question":"5(a) Decentralization of industries for achieving regional balance in economic growth"
		},
		{
			"Year":"1989",
			"Question":"5(b) Significance of inland waterways in the development of transportation and trade"
		},
		{
			"Year":"1989",
			"Question":"5(c) Role of rural markets in regional development"
		},
		{
			"Year":"1989",
			"Question":"5(d) Regional consciousness and national integration"
		},
		{
			"Year":"1989",
			"Question":"6. Attempt a spatial analysis of the development of minerals based industries in relation to mineral resource potentialities and their exploitation in different states of India."
		},
		{
			"Year":"1989",
			"Question":"7. Discuss the recent trends in urbanisation in India and briefly describe the main characteristics and problems of the major Indian cities."
		},
		{
			"Year":"1989",
			"Question":"8. Analyse the prevailing patterns of regional disparities in the socio-economic development of India and evaluate the role of the five-year plans in reducing them."
		},
		{
			"Year":"1990",
			"Question":"2(a) Plate tectonics"
		},
		{
			"Year":"1990",
			"Question":"2(b) Land capability"
		},
		{
			"Year":"1990",
			"Question":"2(c) Diffusion of innovation in agricultural technology"
		},
		{
			"Year":"1990",
			"Question":"2(d) Quantitative and behavioural revolutions in Geography"
		},
		{
			"Year":"1990",
			"Question":"3. Analyse the differences in the models of slope evolution proposed by Davis and Penk."
		},
		{
			"Year":"1990",
			"Question":"4. Explain the basic criteria used in Thornthwaite's 1948 classification of climates."
		},
		{
			"Year":"1990",
			"Question":"5. Discuss the theories of the formation of coral reefs proposed by Daly, Darwin and Davis."
		},
		{
			"Year":"1990",
			"Question":"6. Examine the causes of the international migrations of the last 50 years or so and the socio-economic and political problems generated by them."
		},
		{
			"Year":"1990",
			"Question":"7. Enumerate the different models of the internal structure of cities. Choose one of them and discuss it in its application to a particular city."
		},
		{
			"Year":"1990",
			"Question":"8. Give an account of the spatial pattern of world food production and analyse the related problems of malnutrition and malnutrition diseases."
		},
		{
			"Year":"1990",
			"Question":"1(a) What is the significance of land capability classification in land use planning? Explain the method of long capability classification adopted by the All India land use and soil survey organisation."
		},
		{
			"Year":"1990",
			"Question":"1(b) Critically examine the political consequences of the regionalization of our country on the basis of language."
		},
		{
			"Year":"1990",
			"Question":"1(c) Analyse the cause of the low literacy rate of India. Suggest feasible measures for raising the literacy level."
		},
		{
			"Year":"1990",
			"Question":"1(d) Discuss the spatial variation in the developmental levels of canal irrigation in India in relation to the physical setting."
		},
		{
			"Year":"1990",
			"Question":"2. Explain some of the important theories of the origin of the South-West monsoon in India. Evaluate the impact of its characteristics with occurrence of floods and droughts in different parts of our country."
		},
		{
			"Year":"1990",
			"Question":"3. Assess the fossil fuel reserves of India in terms of current and future demands for energy. Examine the present and future and prospects of their utilization."
		},
		{
			"Year":"1990",
			"Question":"4. Analyse critically whether the existing cropping in different parts of India would need any change for better agriculture performance in future."
		},
		{
			"Year":"1990",
			"Question":"5(a) Location and development of cement industry"
		},
		{
			"Year":"1990",
			"Question":"5(b) Function, Classification and hierarchy of urban settlements"
		},
		{
			"Year":"1990",
			"Question":"5(c) Growth of urban slums and problems associated with them"
		},
		{
			"Year":"1990",
			"Question":"5(d) The international boundary of India and related issues"
		},
		{
			"Year":"1990",
			"Question":"6. Evaluate the contribution of the major ports of India to its international trade."
		},
		{
			"Year":"1990",
			"Question":"7. Construct a spatial pattern of industrial development in our country. Identify the industrially back ward areas and asses their potentialities for future development."
		},
		{
			"Year":"1990",
			"Question":"8. What is meant by integrated rural development planning? What are its components? What has been the extent of its success in relation to its objectives."
		},
		{
			"Year":"1991",
			"Question":"1(a) Polycyclic landforms"
		},
		{
			"Year":"1991",
			"Question":"1(b) Hydrological cycle"
		},
		{
			"Year":"1991",
			"Question":"1(c) World energy crisis"
		},
		{
			"Year":"1991",
			"Question":"1(d) Concept of 'Limits to Growth'"
		},
		{
			"Year":"1991",
			"Question":"3. Analyse the sequential development of landforms in either Karst or Coastal region."
		},
		{
			"Year":"1991",
			"Question":"4. Draw a hypsographic curve to represent the major physicographic units of the ocean and comment on their permanency. "
		},
		{
			"Year":"1991",
			"Question":"5. Explain the origin, distribution and characteristics of tropical cyclones."
		},
		{
			"Year":"1991",
			"Question":"6. Explain the major contribution by Arab geographers of the early medieval period in the development of geographic thought."
		},
		{
			"Year":"1991",
			"Question":"7. Trace and account for the various trends of population growth in the world during the present century."
		},
		{
			"Year":"1991",
			"Question":"8. Examine the world patterns of industrial development and explain the problems of industrial development of national levels."
		},
		{
			"Year":"1991",
			"Question":"1(a) Explain the origin and consequences of earthquakes in the Himalayas with special reference to the Uttarkashi earth quake 1991."
		},
		{
			"Year":"1991",
			"Question":"1(b) Analyse the extent of urban population growth in India in the last four decades."
		},
		{
			"Year":"1991",
			"Question":"1(c) Critically examine the relationship between deforestation and environmental degradation with specific examples from any one region in India."
		},
		{
			"Year":"1991",
			"Question":"1(d) What is meant by Operation Flood? Discuss the manner of its implementation and its success in India."
		},
		{
			"Year":"1991",
			"Question":"2. Elucidate the character of the Himalayan Rivers and examine their role in the Indian plains."
		},
		{
			"Year":"1991",
			"Question":"3. Identify the major tribal communities in India by regions and examine the problems common to all of them and the ways of their solution."
		},
		{
			"Year":"1991",
			"Question":"4. Discuss the role of animal husbandry in the agricultural economy of India with special reference to any one region."
		},
		{
			"Year":"1991",
			"Question":"5(a) Discuss the advantages and disadvantages of Industrial Centralisation with specific examples."
		},
		{
			"Year":"1991",
			"Question":"5(b) Give an account of the major groups of agro based industries of India. Critically examine their contribution to regional economy and rural employment."
		},
		{
			"Year":"1991",
			"Question":"5(c) Explain the basis and characteristics of Dispersed Settlements in the N.E. Region of India."
		},
		{
			"Year":"1991",
			"Question":"5(d) Discuss the political issued involved in the Tin Bigha or Siachen dispute."
		},
		{
			"Year":"1991",
			"Question":"6. Analyse the role of different types of transport in the commodity flows of the Delta regions of East India."
		},
		{
			"Year":"1991",
			"Question":"7. Explain the hierarchical pattern of Indian cities and discuss their growth and distribution."
		},
		{
			"Year":"1991",
			"Question":"8. Discuss the changes brought about in Indian agriculture by the successive Five-Year Plans, mentioning their successes and failures."
		},
		{
			"Year":"1992",
			"Question":"1(a) Classification of Earth Movements"
		},
		{
			"Year":"1992",
			"Question":"1(b) Concept of Ecosystem"
		},
		{
			"Year":"1992",
			"Question":"1(c) Land capability versus Land use efficiency"
		},
		{
			"Year":"1992",
			"Question":"1(d) Central place theory"
		},
		{
			"Year":"1992",
			"Question":"3. Explain the factors causing rejuvenation in landscape and describe the resultant landforms."
		},
		{
			"Year":"1992",
			"Question":"4. Discuss the origin, movements and characteristics of air masses and explain their role in influencing world climates."
		},
		{
			"Year":"1992",
			"Question":"5. Present a classification of the soils of the world and give their economic significance."
		},
		{
			"Year":"1992",
			"Question":"6. Give a comparative assessment of the works of Humboldt and Ritter leading to the foundation of modern geographical thought."
		},
		{
			"Year":"1992",
			"Question":"7. Citing suitable examples from India, explain the role of site and other physical factors in determining the types and patterns of rural settlements."
		},
		{
			"Year":"1992",
			"Question":"8. Discuss the theories of Industrial location propounded by any two of the following: Weber: Hoover and Smith."
		},
		{
			"Year":"1992",
			"Question":"1(a) Explain the characteristics and productivity of the Regur black soils of India"
		},
		{
			"Year":"1992",
			"Question":"1(b) Discuss the role of social forestry in any one region of India."
		},
		{
			"Year":"1992",
			"Question":"1(c) Explain the distribution and characteristics of dry zone agriculture."
		},
		{
			"Year":"1992",
			"Question":"1(d) What is meant by Green Revolution? Explain its successes and failures."
		},
		{
			"Year":"1992",
			"Question":"2. Discuss the major characteristics of the Indian monsoon with special emphasis on the causative factors."
		},
		{
			"Year":"1992",
			"Question":"3. Examine critically the major factors responsible for the growth of two highest population density zones in India."
		},
		{
			"Year":"1992",
			"Question":"4. Explain the distribution of the major mineral resources of the Deccan plateau together with the extent of their exploitation."
		},
		{
			"Year":"1992",
			"Question":"5(a) Types of rural industries and their basis in the Rajasthan Gujarat region."
		},
		{
			"Year":"1992",
			"Question":"5(b) Major characteristics of the rural-urban fringe around metropolitan cities."
		},
		{
			"Year":"1992",
			"Question":"5(c) Salient features of Tribal area planning."
		},
		{
			"Year":"1992",
			"Question":"5(d) Major issues involved in the sino-Indian boundary conflict. "
		},
		{
			"Year":"1992",
			"Question":"6. Discuss the basis on which the current network of Airways is built in India, highlighting its role in the overall transportation milieu."
		},
		{
			"Year":"1992",
			"Question":"7. Describe briefly the internal structure of Indian cities, together with the ensuing problems. Illustrate your answer with specific examples."
		},
		{
			"Year":"1992",
			"Question":"8. Examine critically the advantages and disadvantages of multi-level planning with special reference to India."
		},
		{
			"Year":"1993",
			"Question":"1(a) Treppen concept"
		},
		{
			"Year":"1993",
			"Question":"1(b) Biotic succession"
		},
		{
			"Year":"1993",
			"Question":"1(c) Measures of agricultural efficiency"
		},
		{
			"Year":"1993",
			"Question":"1(d) System approach in Geography"
		},
		{
			"Year":"1993",
			"Question":"3. Discuss, with examples, the influence of volcanism and diastrophism on the evolution of landscape."
		},
		{
			"Year":"1993",
			"Question":"4. Give a reasoned account of the distribution of salinity in the oceans and partially enclosed seas."
		},
		{
			"Year":"1993",
			"Question":"5. Define ecosystem and describe briefly its various components. Also discuss how and to what extent the modern man has affected the various types of ecosystems."
		},
		{
			"Year":"1993",
			"Question":"6. Discuss the major international streams of migration in the world in recent times and account for the relationship that exists between population pressure areas and migration prospects."
		},
		{
			"Year":"1993",
			"Question":"7. Define umland and discuss, with specific examples, the criteria for its delimitation."
		},
		{
			"Year":"1993",
			"Question":"8. Give an account of the agricultural typology of the world as presented by Whittlesey and critically examine the parameters used in its delineation."
		},
		{
			"Year":"1993",
			"Question":"1(a) Explain the geographical factors responsible for the growth of mangrove vegetation in India and discuss its role in coastal ecology."
		},
		{
			"Year":"1993",
			"Question":"1(b) Elucidate the current population policy of India and comment on its effectiveness."
		},
		{
			"Year":"1993",
			"Question":"1(c) Explain the role of institutional factors in the development of agriculture in India."
		},
		{
			"Year":"1993",
			"Question":"1(d) Analyses the changes in the literacy rate during the post independence period in India."
		},
		{
			"Year":"1993",
			"Question":"2. 'India presents an example of unity in diversity.' Elucidate this statement in this context of India's physical and human aspects."
		},
		{
			"Year":"1993",
			"Question":"3. Delineate the flood prone areas of India by drawing a sketch map in the answer book and discuss the causes and consequences of floods in the North Indian plains."
		},
		{
			"Year":"1993",
			"Question":"4. Critically examine the marine resources of India and discuss the problems encountered in their development."
		},
		{
			"Year":"1993",
			"Question":"5(a) Growth of agro-based industries in Uttar Pradesh and Bihar."
		},
		{
			"Year":"1993",
			"Question":"5(b) Role and characteristics of rural market centres in different parts of India."
		},
		{
			"Year":"1993",
			"Question":"5(c) Distinguishing features of an urban slum and its position in metropolitan area."
		},
		{
			"Year":"1993",
			"Question":"5(d) Major causes for regional disparities in the development of India."
		},
		{
			"Year":"1993",
			"Question":"6. Identify the important periods of industrialisation in India and analyse the character of its two most developed industrial regions."
		},
		{
			"Year":"1993",
			"Question":"7. Discuss briefly the overall pattern of inter-regional trade in India."
		},
		{
			"Year":"1993",
			"Question":"8. Examine critically the geographical basis of the Indian federation."
		},
		{
			"Year":"1994",
			"Question":"1(a) Bioldiversity"
		},
		{
			"Year":"1994",
			"Question":"1(b) Models in Geography"
		},
		{
			"Year":"1994",
			"Question":"1(c) Sustainable development"
		},
		{
			"Year":"1994",
			"Question":"1(d) Slums and squatter settlements"
		},
		{
			"Year":"1994",
			"Question":"3. Discuss the concept of cycle of erosion and bring out clearly the difference between the view of Davis and Penck."
		},
		{
			"Year":"1994",
			"Question":"4. Explain the basis of Koppen's classification of climates. Also mention its merits and limitations."
		},
		{
			"Year":"1994",
			"Question":"5. Indicate the major biotic regions of the world and discuss the ecological aspects of the monsoon region."
		},
		{
			"Year":"1994",
			"Question":"6. Examine critically the concepts of 'determinism' and possibilism. Bring out the significance of regional concept."
		},
		{
			"Year":"1994",
			"Question":"7. Oil has placed in the hands of Arab nations a tremendous geopolitical weapon with which to wield power. Comment."
		},
		{
			"Year":"1994",
			"Question":"8. Discuss Van Thunen's model of agricultural land use and examine if the model is applicable in India."
		},
		{
			"Year":"1994",
			"Question":"1(a) Explain the drainage characteristics of Peninsular India."
		},
		{
			"Year":"1994",
			"Question":"1(b) Elucidate the population density types in India."
		},
		{
			"Year":"1994",
			"Question":"1(c) Examine the nature and extent of environmental degradation in the Himalayas."
		},
		{
			"Year":"1994",
			"Question":"1(d) Explain the salient features of Sardar Sarover Project and elucidate the controversy related to its implementation. 2. Discuss the recent theories put forward to explain the origin and mechanism of the Indian Monsoon."
		},
		{
			"Year":"1994",
			"Question":"3. Examine the forest resources of India and explain the principles of conservation which could be applied to improve the forest wealth of India."
		},
		{
			"Year":"1994",
			"Question":"4. Differentiate between agricultural efficiency and agricultural productivity and discuss the methods used in the determination of agricultural efficiency in India."
		},
		{
			"Year":"1994",
			"Question":"5(a) Identification of industrially backward areas and problems in their development."
		},
		{
			"Year":"1994",
			"Question":"5(b) Competitive and complementary character of the Indian rail-route and road network."
		},
		{
			"Year":"1994",
			"Question":"5(c) Internal structure of an Indian city."
		},
		{
			"Year":"1994",
			"Question":"5(d) Problems of militancy in India's border states."
		},
		{
			"Year":"1994",
			"Question":"6. Draw a sketch map to delineate the major industrial complexes of India and discuss their important characteristics."
		},
		{
			"Year":"1994",
			"Question":"7. Bring out the salient characteristics of Indian urbanization with suitable examples."
		},
		{
			"Year":"1994",
			"Question":"8. Discuss the growth of regional planning in India and account for regional disparities in development."
		},
		{
			"Year":"1995",
			"Question":"1(a) Natural Hazards"
		},
		{
			"Year":"1995",
			"Question":"1(b) Inversion of temperature"
		},
		{
			"Year":"1995",
			"Question":"1(c) Food from the sea"
		},
		{
			"Year":"1995",
			"Question":"1(d) Dryland farming"
		},
		{
			"Year":"1995",
			"Question":"3. Discuss the limitations of the theory of Continental Drift and show how the theory of Plate Tectonics is an improvement over it."
		},
		{
			"Year":"1995",
			"Question":"4. Explain the life-cycle of a temperate cyclone and also describe the weather associated with it."
		},
		{
			"Year":"1995",
			"Question":"5. 'Man must realize the importance of maximizing agricultural production without destroying the ecological basis on which our entire food production systems rests.' Explain with examples."
		},
		{
			"Year":"1995",
			"Question":"6. Discuss the contributions of Al Biruni towards the development of geographical knowledge."
		},
		{
			"Year":"1995",
			"Question":"7. Examine the theories about population control and explain the relative merits of these theories in limiting population growth."
		},
		{
			"Year":"1995",
			"Question":"8. Explain and illustrate the models of internal structure of cities as proposed by Burgess and Hovt. Mention also the limitations of these models."
		},
		{
			"Year":"1995",
			"Question":"1(a) Explain the factors responsible for uneven distribution of rainfall in India."
		},
		{
			"Year":"1995",
			"Question":"1(b) Examine the origin and characteristics of the soils of the North Indian Plain."
		},
		{
			"Year":"1995",
			"Question":"1(c) Discuss the problems of tribal areas in India."
		},
		{
			"Year":"1995",
			"Question":"1(d) Elucidate the measures taken to limit the growth of population in India."
		},
		{
			"Year":"1995",
			"Question":"2. Draw a sketch-map in your answer book to delineate the main physiographic regions of India and provide a reasoned account of the relief and structure of the Himalayan region."
		},
		{
			"Year":"1995",
			"Question":"3. Examine the fossil fuel resources of India with particular reference to the present and future demands for energy."
		},
		{
			"Year":"1995",
			"Question":"4. Discuss the role of infrastructural, scientific and technological development in the recent transformation of Indian agriculture."
		},
		{
			"Year":"1995",
			"Question":"5(a) Recent changes in India's basic industrial policy."
		},
		{
			"Year":"1995",
			"Question":"5(b) Role of rural market centres in promoting intra and inter-regional trade."
		},
		{
			"Year":"1995",
			"Question":"5(c) Land-use characteristics of the rural urban fringe in India."
		},
		{
			"Year":"1995",
			"Question":"5(d) Importance of India in the geopolitics of the Indian Ocean realm."
		},
		{
			"Year":"1995",
			"Question":"6. Examine critically the factors for the localization of iron and steel industry in India with special reference to the newer centres of steel production."
		},
		{
			"Year":"1995",
			"Question":"7. Explain, with the help of suitable examples and illustrations, the distribution of various patterns of rural settlements in India."
		},
		{
			"Year":"1995",
			"Question":"8. Give the hierarchy of planning regions and bring out the role of metropolitan planning in fostering regional development in India."
		},
		{
			"Year":"1996",
			"Question":"1(a) Growth of population and food resources of the world"
		},
		{
			"Year":"1996",
			"Question":"1(b) Desertification and its preventive measures"
		},
		{
			"Year":"1996",
			"Question":"1(c) Globalization of trade and industry"
		},
		{
			"Year":"1996",
			"Question":"1(d) Man and the Amazon rainforest"
		},
		{
			"Year":"1996",
			"Question":"3. Discuss the processes of mechanical and chemical weathering and show their relationship with soil formation."
		},
		{
			"Year":"1996",
			"Question":"4. Examine critically the drawbacks of Koppen's Classification of climates. Explain how Thornthwaite attempted to overcome Koppen's limitations."
		},
		{
			"Year":"1996",
			"Question":"5. Explain and illustrate the ocean floor topography and give a detailed account of the Mid-Atlantic Ridge."
		},
		{
			"Year":"1996",
			"Question":"6. \"The emergence of Behavioural Geography was due to the disillusionment with axioms on which models were based and the axioms were far removed from reality.\" Comment."
		},
		{
			"Year":"1996",
			"Question":"7. Examine the bases of classification of agricultural regions as proposed by Whittlesey and explain the causes for the essential different between intensive subsistence tillage with rice dominant and without rice in the crop association."
		},
		{
			"Year":"1996",
			"Question":"8. Without the Mediterranean Europe could not be held, with out the Middle East the Mediterranean could not be held. Discuss."
		},
		{
			"Year":"1996",
			"Question":"1(a) Examine the origin and characteristics of the antecedent drainage system of the Himalayas."
		},
		{
			"Year":"1996",
			"Question":"1(b) Explain the criteria used in the identification of drought-prone areas in India."
		},
		{
			"Year":"1996",
			"Question":"1(c) Discuss the distribution and characteristics of the evergreen forest in India."
		},
		{
			"Year":"1996",
			"Question":"1(d) Elucidate the genesis of ethnic and cultural diversities in India."
		},
		{
			"Year":"1996",
			"Question":"2. Draw a sketch-map in your answer book to delineate the main climatic regions of India and discuss the important climatic characteristics of each region."
		},
		{
			"Year":"1996",
			"Question":"3. Critically examine the metalliferous mineral resources of India with particular reference to their present and future demands."
		},
		{
			"Year":"1996",
			"Question":"4. Discuss the importance of irrigation in Indian Agriculture and describe the methods of irrigation practised in either the Ganga Valley or the Karnataka-Maharashtra region."
		},
		{
			"Year":"1996",
			"Question":"5(a) Geographical impediments in the development of inland waterways in India."
		},
		{
			"Year":"1996",
			"Question":"5(b) Factors for the growth of slums in the metropolitan cities of India."
		},
		{
			"Year":"1996",
			"Question":"5(c) Magnitude of regional imbalances in economic development in India."
		},
		{
			"Year":"1996",
			"Question":"5(d) Geographical basis of the Indian Federation."
		},
		{
			"Year":"1996",
			"Question":"6. Analyse the factors for the localization of either the cotton textile or the sugar industry in India and note the recent trends in the industry."
		},
		{
			"Year":"1996",
			"Question":"7. Name the million cities of India according 2001 census and critically examine the factors for unprecedented growth in their population in the last 50 years."
		},
		{
			"Year":"1996",
			"Question":"8. Explain the salient features of the tribal development programme with particular reference to either Dandakaranya or Chotanagpur."
		},
		{
			"Year":"1997",
			"Question":"1(a) Buffer zone"
		},
		{
			"Year":"1997",
			"Question":"1(b) Marine resources, biotic, mineral and energy resources"
		},
		{
			"Year":"1997",
			"Question":"1(c) Weathering and soil formation"
		},
		{
			"Year":"1997",
			"Question":"1(d) Rural-urban fringe"
		},
		{
			"Year":"1997",
			"Question":"3. Discuss the concept of polycyclic landforms and present an analytical study of the polycyclic landforms of a selected region."
		},
		{
			"Year":"1997",
			"Question":"4. Define air masses. How do they originate? Classify them and state the characteristics of any one type."
		},
		{
			"Year":"1997",
			"Question":"5. Examine critically the theories of the formation of coral reefs and atolls."
		},
		{
			"Year":"1997",
			"Question":"6. \"Water is a scarce resource in plenty.\" Comment and discuss its importance in the balanced habitat development. Support your answer with examples from Asia."
		},
		{
			"Year":"1997",
			"Question":"7. Critically examine Alfred Weler's Theory of the Location of Industries."
		},
		{
			"Year":"1997",
			"Question":"8. Critically examine the concept of dualism with special reference to physical versus human Geography."
		},
		{
			"Year":"1997",
			"Question":"1(a) Discuss the origin and main geographic feature of Thar Desert of India"
		},
		{
			"Year":"1997",
			"Question":"1(b) Examine the significance of social forestry in the rural economy of India."
		},
		{
			"Year":"1997",
			"Question":"1(c) Examine the genesis of racial diversity in India."
		},
		{
			"Year":"1997",
			"Question":"1(d) Discuss the impact of green revolution on the agricultural production in India."
		},
		{
			"Year":"1997",
			"Question":"2. Critically examine the factors affecting the distributional pattern of population in India."
		},
		{
			"Year":"1997",
			"Question":"3. Evaluate the nature of ecological problem in India and suggest measures for their measurement."
		},
		{
			"Year":"1997",
			"Question":"4. Divide peninsular India into agricultural regions. Explain the basis of such a regionalization."
		},
		{
			"Year":"1997",
			"Question":"5(a) Analyse the locational pattern of cement industry in India."
		},
		{
			"Year":"1997",
			"Question":"5(b) Examine the census concept of urban areas in India."
		},
		{
			"Year":"1997",
			"Question":"5(c) Discuss the nature of commodity flows in India."
		},
		{
			"Year":"1997",
			"Question":"5(d) Evaluate the benefits of Block Level development planning in India."
		},
		{
			"Year":"1997",
			"Question":"6. Critically examine the locational pattern and trend of production of forest based industries in India."
		},
		{
			"Year":"1997",
			"Question":"7. Draw a sketch map of India showing major river basins. Examine the feasibility of the concept of river basins as a planning unit."
		},
		{
			"Year":"1997",
			"Question":"8. Explain the basis and consequences of the establishment and implementation of recommendations of the State Reorganisation Commission in India since 1950s."
		},
		{
			"Year":"1998",
			"Question":"1(a) Soil genesis"
		},
		{
			"Year":"1998",
			"Question":"1(b) Geomorphic processes"
		},
		{
			"Year":"1998",
			"Question":"1(c) Locational Triangle"
		},
		{
			"Year":"1998",
			"Question":"1(d) Types of Farming"
		},
		{
			"Year":"1998",
			"Question":"3. Discuss the concept of volcanicity and show how the theory of Plate Tectonics explains the mechanism of volcanism and volcanic eruptions."
		},
		{
			"Year":"1998",
			"Question":"4. Discuss the nature and composition of earth's atmosphere."
		},
		{
			"Year":"1998",
			"Question":"5. Explain and illustrate the submarine relief of the Atlantic Ocean."
		},
		{
			"Year":"1998",
			"Question":"6. What is understood by quantification in Geography? Discuss the significance of quantification in modern geographical studies with examples."
		},
		{
			"Year":"1998",
			"Question":"7. Explain the term resource management. Discuss its relevance in the context of global resource scarcity and the future of mankind."
		},
		{
			"Year":"1998",
			"Question":"8. Examine the impact of advanced agricultural technology on environment. Support your answer with examples."
		},
		{
			"Year":"1998",
			"Question":"1(a) Evaluate the feasibility of the proposed Ganga-Cauveri drainage link."
		},
		{
			"Year":"1998",
			"Question":"1(b) Discuss the role of institutional factors in the efficiency and productivity of agriculture in India."
		},
		{
			"Year":"1998",
			"Question":"1(c) Examine the resources of Andaman and Nicobar Islands."
		},
		{
			"Year":"1998",
			"Question":"1(d) Bring out the present day position of exploitation and processing of nuclear minerals in India."
		},
		{
			"Year":"1998",
			"Question":"2. Critically examine the problems and prospects of tribal areas in India."
		},
		{
			"Year":"1998",
			"Question":"3. Discuss the cropping patterns in different agricultural regions of India."
		},
		{
			"Year":"1998",
			"Question":"4. Examine the pattern of distribution and mode of exploitation of bauxite in India."
		},
		{
			"Year":"1998",
			"Question":"5(a) Examine the importance of industrial estates in India."
		},
		{
			"Year":"1998",
			"Question":"5(b) Discuss the geographical control of rural settlement pattern in India."
		},
		{
			"Year":"1998",
			"Question":"5(c) Explain the role of railways as a unifying factor in Indian economy."
		},
		{
			"Year":"1998",
			"Question":"5(d) Discuss the geopolitical importance of Indian Ocean area."
		},
		{
			"Year":"1998",
			"Question":"6. Bring out the trands in the development of fertilizer industry in India."
		},
		{
			"Year":"1998",
			"Question":"7. Discuss the concept of city region and referring to Indian cities, examine critically functional indicators used for delimiting the city region."
		},
		{
			"Year":"1998",
			"Question":"8. Discuss the role of languages in regional consciousness and national integration in India."
		},
		{
			"Year":"1999",
			"Question":"1(a) Cs type of climate, as per Koeppen's classification"
		},
		{
			"Year":"1999",
			"Question":"1(b) Submarine canyons"
		},
		{
			"Year":"1999",
			"Question":"1(c) Gravity model"
		},
		{
			"Year":"1999",
			"Question":"1(d) Primate city"
		},
		{
			"Year":"1999",
			"Question":"3. Bring out the distinctions between the continental drift theory and the plate tectonics theory."
		},
		{
			"Year":"1999",
			"Question":"4. Make a comparative study of the tropical and temperate cyclones."
		},
		{
			"Year":"1999",
			"Question":"5. Discuss the relevance of watershed', as an ecosystem for the purpose of sustainable development."
		},
		{
			"Year":"1999",
			"Question":"6. Describe the sequence of major paradigm shifts in geographic thought during the twentieth century."
		},
		{
			"Year":"1999",
			"Question":"7. Bring out the contrast between the internal structure of the pre-industrial and industrial cities."
		},
		{
			"Year":"1999",
			"Question":"8. How far do the patterns of economic development and those of human development correspond with each other in the world? Illustrate your answer with examples."
		},
		{
			"Year":"1999",
			"Question":"1(a) Explain the rise of the Himalayan ranges."
		},
		{
			"Year":"1999",
			"Question":"1(b) Elucidate the mechanism of the Indian Monsoon."
		},
		{
			"Year":"1999",
			"Question":"1(c) Examine the need for conservation of biotic resources in India."
		},
		{
			"Year":"1999",
			"Question":"1(d) Discuss the genesis of ethnic and racial diversities in India."
		},
		{
			"Year":"1999",
			"Question":"2. Write an essay on the role of animal husbandry and household industries in the development of rural economy in India."
		},
		{
			"Year":"1999",
			"Question":"3. Discuss the factors for the localization of either the cement or the cotton textile industry in India and analyse the pattern of its distribution."
		},
		{
			"Year":"1999",
			"Question":"4. Critically examine the role of infrastructural and institutional factors in the recent transformation of Indian agriculture."
		},
		{
			"Year":"1999",
			"Question":"5(a) Role of rural market centres in fostering intra and inter-regional trade in India."
		},
		{
			"Year":"1999",
			"Question":"5(b) Hierarchical pattern of Indian towns."
		},
		{
			"Year":"1999",
			"Question":"5(c) Nature and utility of multi-level planning in India."
		},
		{
			"Year":"1999",
			"Question":"5(d) Regional consciousness versus national integration in India."
		},
		{
			"Year":"1999",
			"Question":"6. Explain with suitable examples and sketch-maps, the distribution of various patterns of rural settlements in India."
		},
		{
			"Year":"1999",
			"Question":"7. Analyse the causes of regional disparities in the economic development of India and suggest measures for their removal."
		},
		{
			"Year":"1999",
			"Question":"8. Critically examine the complementary and competitive character of the Indian rail - routes and the road network."
		},
		{
			"Year":"2000",
			"Question":"2. With reference to the theory of Plate Tectonics, explain the origin and growth of the young Fold Mountain Systems of the world."
		},
		{
			"Year":"2000",
			"Question":"3. Give an account of the types and distribution of precipitation on the surface of the earth."
		},
		{
			"Year":"2000",
			"Question":"4. Discuss the causes and consequences of environmental degradation and highlight the related conservation measures."
		},
		{
			"Year":"2000",
			"Question":"5(a) T-S diagram"
		},
		{
			"Year":"2000",
			"Question":"5(b) Soil Profile"
		},
		{
			"Year":"2000",
			"Question":"5(c) Rank-Size Rule"
		},
		{
			"Year":"2000",
			"Question":"5(d) The limits to growth"
		},
		{
			"Year":"2000",
			"Question":"6. Discuss the causes and consequences of population migration in the world."
		},
		{
			"Year":"2000",
			"Question":"7. Explain the basis and applicability of Christallar's Central Place Theory. Bring out the recent modifications."
		},
		{
			"Year":"2000",
			"Question":"8. What is a region? Discuss the types of regions and the methods of regionalization."
		},
		{
			"Year":"2000",
			"Question":"2. Describe the structure and relief features of Peninsular India."
		},
		{
			"Year":"2000",
			"Question":"3. Analyse the distribution of population in India in the perspective of natural resources and identify the over-populated and under-populated regions in the country."
		},
		{
			"Year":"2000",
			"Question":"4. Discuss the growth, location and distribution of Iron and Steel Industry in India."
		},
		{
			"Year":"2000",
			"Question":"5(a) Explain the concept of multi-level planning in India."
		},
		{
			"Year":"2000",
			"Question":"5(b) Analyse the recent trends in Indian International Trade."
		},
		{
			"Year":"2000",
			"Question":"5(c) Examine the National Forest Policy of India."
		},
		{
			"Year":"2000",
			"Question":"5(d) Discuss the environmental impact of the growth of slums in Indian cities."
		},
		{
			"Year":"2000",
			"Question":"6. Describe the salient characteristics of the morphology of Indian cities."
		},
		{
			"Year":"2000",
			"Question":"7. Analyse the role of India in the geo-politics of the Indian Ocean Region."
		},
		{
			"Year":"2000",
			"Question":"8. Give a reasoned account of either flood hazards or drought hazards occurring in India, and also suggest measures for controlling them."
		},
		{
			"Year":"2001",
			"Question":"2. Present a critical analysis of the theory of Isostasy."
		},
		{
			"Year":"2001",
			"Question":"3. Discuss the concept of airmasses and present their classification."
		},
		{
			"Year":"2001",
			"Question":"4. Discuss the concept, components and functioning of an ecosystem."
		},
		{
			"Year":"2001",
			"Question":"5(a) Agro-forestry"
		},
		{
			"Year":"2001",
			"Question":"5(b) Radical Approach in Human Geography"
		},
		{
			"Year":"2001",
			"Question":"5(c) Concept of optimum population"
		},
		{
			"Year":"2001",
			"Question":"5(d) Formation of coral reefs"
		},
		{
			"Year":"2001",
			"Question":"6. Examine the spatial patterns of development disparity prevailing in the world."
		},
		{
			"Year":"2001",
			"Question":"7. Critically examine the role of growth centres and growth poles in regional development process."
		},
		{
			"Year":"2001",
			"Question":"8. Discuss the concept and application of systems analysis in Human Geography."
		},
		{
			"Year":"2001",
			"Question":"2. Discuss the relief features of Indian Northern Plains."
		},
		{
			"Year":"2001",
			"Question":"3. Examine the geographical basis of agro-climatic planning regions of India."
		},
		{
			"Year":"2001",
			"Question":"4. Describe the growth, characteristics and distribution pattern of India's industrial regions."
		},
		{
			"Year":"2001",
			"Question":"5(a) Elucidate the sex and age structure of the population of India."
		},
		{
			"Year":"2001",
			"Question":"5(b) Give a brief account of the second order regions of India's Peninsular Plateau."
		},
		{
			"Year":"2001",
			"Question":"5(c) Explain the sequence of vegetation zones of the Himalayas."
		},
		{
			"Year":"2001",
			"Question":"5(d) Provide the geographical background and characteristics of the distribution of Hill Stations of India."
		},
		{
			"Year":"2001",
			"Question":"6. Discuss the geopolitical importance of India's Land Boundaries."
		},
		{
			"Year":"2001",
			"Question":"7. Explain the concept of watershed and its utility in land management."
		},
		{
			"Year":"2001",
			"Question":"8. Explain the geographical characteristics of the regional distribution of earthquakes in India."
		},
		{
			"Year":"2002",
			"Question":"2. Provide a critique of the 'geographical cycle' model, propounded by Davis."
		},
		{
			"Year":"2002",
			"Question":"3. Discuss the criteria which Thomthwaite adopted for his 1948 classification of world climates."
		},
		{
			"Year":"2002",
			"Question":"4. Write in detail on the concept of biosphere as an ecosystem."
		},
		{
			"Year":"2002",
			"Question":"5(a) Geosynclines"
		},
		{
			"Year":"2002",
			"Question":"5(b) Neo-environmentalism"
		},
		{
			"Year":"2002",
			"Question":"5(c) Isolated states"
		},
		{
			"Year":"2002",
			"Question":"5(d) Rimland Theory"
		},
		{
			"Year":"2002",
			"Question":"6. Bring out the main points of difference between the central place theories of Christaller and Losch."
		},
		{
			"Year":"2002",
			"Question":"7. Write an essay on sustainable development from the perspective of Geography."
		},
		{
			"Year":"2002",
			"Question":"8. To what extend do the regional patterns of economic development and human development in the world correspond with each other? Highlight situations of departure, in particular."
		},
		{
			"Year":"2002",
			"Question":"2. Explain the origin, mechanism and characteristics of Summer Monsoon in India."
		},
		{
			"Year":"2002",
			"Question":"3. Critically evaluate the dual impacts of green revolution in India."
		},
		{
			"Year":"2002",
			"Question":"4. Discuss the oil and natural gas pipeline networks in India. Highlight their complementary role in regional development."
		},
		{
			"Year":"2002",
			"Question":"5(a) Account for the present distributional pattern of population density in India."
		},
		{
			"Year":"2002",
			"Question":"5(b) Analyse the role of policy of liberalization on industrial landscape of India."
		},
		{
			"Year":"2002",
			"Question":"5(c) Discuss the salient features of Cauvery Water Award."
		},
		{
			"Year":"2002",
			"Question":"5(d) Elucidate the role of Tribal Development Blocks in development of Tribal areas."
		},
		{
			"Year":"2002",
			"Question":"6. Explain the causes, impacts and remedial measures of earthquake disaster."
		},
		{
			"Year":"2002",
			"Question":"7. In what way the language, religion and tradition can form the basis of cultural regionalization of India? Elaborate."
		},
		{
			"Year":"2002",
			"Question":"8. Give a reasoned account of regional disparities in economic development in India and bring out the contribution of decentralized planning in solving this problem."
		},
		{
			"Year":"2003",
			"Question":"2. Explain the sequential development of landforms associated with the coastal areas."
		},
		{
			"Year":"2003",
			"Question":"3. Discuss the mechanism and significance of tricellular meridional circulation of atmosphere."
		},
		{
			"Year":"2003",
			"Question":"4. Present a concise account of bottom relief of the Indian Ocean."
		},
		{
			"Year":"2003",
			"Question":"5(a) Genesis of Soils"
		},
		{
			"Year":"2003",
			"Question":"5(b) Environmental Pollution"
		},
		{
			"Year":"2003",
			"Question":"5(c) Concept of limits to growth"
		},
		{
			"Year":"2003",
			"Question":"5(d) Regional imbalance"
		},
		{
			"Year":"2003",
			"Question":"6. Present a critical analysis of human and welfare approaches in Human Geography."
		},
		{
			"Year":"2003",
			"Question":"7. Examine the concept of sphere of urban influence and discuss the qualitative and quantitative methods used in its delimitation."
		},
		{
			"Year":"2003",
			"Question":"8. Critically examine the stages of Economic Growth Model propounded by Rostov. Illustrate your answer with suitable examples."
		},
		{
			"Year":"2003",
			"Question":"2. Highlight the salient differences between the Himalayan and the Peninsular drainage systems."
		},
		{
			"Year":"2003",
			"Question":"3. Give an account of the success and prospects of Blue Revolution with comments on its impacts on rural economy of India."
		},
		{
			"Year":"2003",
			"Question":"4. Discuss the growing importance of ports in foreign trade of India."
		},
		{
			"Year":"2003",
			"Question":"5(a) Discuss the census definition of urban areas in India"
		},
		{
			"Year":"2003",
			"Question":"5(b) Explain the concept of Command Area Development in respect of Multi-Purpose Projects of India."
		},
		{
			"Year":"2003",
			"Question":"5(c) Identify the drought-prone areas of India and discuss the measures of their development."
		},
		{
			"Year":"2003",
			"Question":"5(d) Make an appraisal of the role of India in the geopolitics of the Indian Ocean."
		},
		{
			"Year":"2003",
			"Question":"6. Discuss the programmes and policy of development of dry areas in India."
		},
		{
			"Year":"2003",
			"Question":"7. Present an account of the experience of regional planning in India in the context of Damodar Valley."
		},
		{
			"Year":"2003",
			"Question":"8. Explain the causes of regional disparities in economic development of India."
		},
		{
			"Year":"2004",
			"Question":"2. Describe the landforms which are products of endogenetic forces."
		},
		{
			"Year":"2004",
			"Question":"3. How would the impact of global warming differ from one part of the earth to another? Give a reasoned account."
		},
		{
			"Year":"2004",
			"Question":"4. Discuss the mid-Atlantic Ridge in terms of its origin, extent and relief."
		},
		{
			"Year":"2004",
			"Question":"5(a) Peneplain"
		},
		{
			"Year":"2004",
			"Question":"5(b) Pelagic deposits"
		},
		{
			"Year":"2004",
			"Question":"5(c) Potential evapotranspiration"
		},
		{
			"Year":"2004",
			"Question":"5(d) Growth pole"
		},
		{
			"Year":"2004",
			"Question":"6. To what extent are the heartland and Rimland theories helpful in understanding the world political situation today? Express your opinion clearly."
		},
		{
			"Year":"2004",
			"Question":"7. Discuss various strategies for correcting regional imbalances."
		},
		{
			"Year":"2004",
			"Question":"8. Distinguish between radical and welfare approaches in geographic studies."
		},
		{
			"Year":"2004",
			"Question":"2. Discuss the role of spatial pattern of rainfall and temperature in the delimitation of climatic regions of India, especially with reference to Stamp's climatic regionalization."
		},
		{
			"Year":"2004",
			"Question":"3. Identify the important biotic-resource regions of India. Highlight, in brief the problems and remedial measures of biotic-resource conservation in India."
		},
		{
			"Year":"2004",
			"Question":"4. Give a comparative account of the development of River Water Transport in precolonial and post-independence periods in India. Highlight the role of River Transport in regional development."
		},
		{
			"Year":"2004",
			"Question":"5(a) Evaluate the population policy of India and examine its relevance to the nation's population control."
		},
		{
			"Year":"2004",
			"Question":"5(b) How do slums develop? Give concrete suggestions for their improvement"
		},
		{
			"Year":"2004",
			"Question":"5(c) Write an essay on the origin, dimensions and implications of Sino-Indian border dispute."
		},
		{
			"Year":"2004",
			"Question":"5(d) Evaluate the concept of sustainable growth and development."
		},
		{
			"Year":"2004",
			"Question":"6. \"Economic characteristics of an area exert a much more direct effect upon its population patterns than do the physical characteristics.\" Explain with examples."
		},
		{
			"Year":"2004",
			"Question":"7. Explain the causes, impacts and remedial measures of flood-hazards in Middle and Lower Ganga plain."
		},
		{
			"Year":"2004",
			"Question":"8. Examine the regional development policy of India in various Five Year Plans."
		},
		{
			"Year":"2005",
			"Question":"2. \"Structure is a dominant control factor in the evolution of landforms.\" Discuss with suitable examples."
		},
		{
			"Year":"2005",
			"Question":"3. Discuss the main features of the climatic classification system evolved by Koppen. Also point out its anomalies."
		},
		{
			"Year":"2005",
			"Question":"4. Bring out the major problems of environmental pollution at global scale and suggest measures to check it."
		},
		{
			"Year":"2005",
			"Question":"5(a) Role of seismic waves in the study of earth's interior"
		},
		{
			"Year":"2005",
			"Question":"5(b) Soil erosion and conservation"
		},
		{
			"Year":"2005",
			"Question":"5(c) A real differentiation"
		},
		{
			"Year":"2005",
			"Question":"5(d) Concept of primate city"
		},
		{
			"Year":"2005",
			"Question":"6. Examine the Heart land theory, and assess its merits and demerits."
		},
		{
			"Year":"2005",
			"Question":"7. Discuss Weber's theory of industrial location, and assess its relevance in the present day context."
		},
		{
			"Year":"2005",
			"Question":"8. What is a region? Discuss the methods of regionalization."
		},
		{
			"Year":"2005",
			"Question":"2. \"Non-conventional energy is the energy of the future in India.\" Justify this statement."
		},
		{
			"Year":"2005",
			"Question":"3. Present an account of the success and constraints of White Revolution in India."
		},
		{
			"Year":"2005",
			"Question":"4. What is the Golden Quadrilateral? Discuss the progress made in its execution and impacts on Indian economy."
		},
		{
			"Year":"2005",
			"Question":"5(a) Identify the tribal of India and highlight their important problems."
		},
		{
			"Year":"2005",
			"Question":"5(b) Discuss briefly the principal types of rural settlements in India."
		},
		{
			"Year":"2005",
			"Question":"5(c) Elucidate the concept of sustainable growth and development."
		},
		{
			"Year":"2005",
			"Question":"5(d) Discuss Panchayati Raj as a measure of decentralized planning in India."
		},
		{
			"Year":"2005",
			"Question":"6. Give an account of the distribution of flood-prone areas of India and the programmes and policy of controlling the impact of floods in the country."
		},
		{
			"Year":"2005",
			"Question":"7. Examine the relationship between Geography and regional planning."
		},
		{
			"Year":"2005",
			"Question":"8. Discuss the experience of regional planning in India in the context of the National Capital Region."
		},
		{
			"Year":"2006",
			"Question":"2. Critically evaluate the continental drift hypothesis of A. Wegener."
		},
		{
			"Year":"2006",
			"Question":"3. Compare the structure and associated weather conditions of tropical cyclone with that of temperate cyclone."
		},
		{
			"Year":"2006",
			"Question":"4. Discuss the global ecological imbalances and their management."
		},
		{
			"Year":"2006",
			"Question":"5(a) Distribution of soils"
		},
		{
			"Year":"2006",
			"Question":"5(b) Cultural regions of the world"
		},
		{
			"Year":"2006",
			"Question":"5(c) Sustainable development"
		},
		{
			"Year":"2006",
			"Question":"5(d) Ocean currents of Northern Atlantic Ocean"
		},
		{
			"Year":"2006",
			"Question":"6. In urban Geography, what are the concepts of primate city and Rank Size Rule? Discuss in details."
		},
		{
			"Year":"2006",
			"Question":"7. What is the concept of a region? Discuss the types of regions."
		},
		{
			"Year":"2006",
			"Question":"8. Write down main agricultural types and their associated features with special reference to Whittlesey. Show these regions on the world map provided to you."
		},
		{
			"Year":"2006",
			"Question":"2. Give a critical account of the recent theories of origin of Indian monsoon with special reference to Jet Stream Theory."
		},
		{
			"Year":"2006",
			"Question":"3. Discuss the problems and prospects of dry zone agriculture in India and highlight strategies and schemes for its development."
		},
		{
			"Year":"2006",
			"Question":"4. Trace the evolution of industries in India & evaluate the role of multinationals & liberalization policies in this context."
		},
		{
			"Year":"2006",
			"Question":"5(a) Discuss the causes and consequences of sex-ratio variations in India."
		},
		{
			"Year":"2006",
			"Question":"5(b) Examine the geographical basis of Indian federalism."
		},
		{
			"Year":"2006",
			"Question":"5(c) Write an essay on the population explosion and food security in India."
		},
		{
			"Year":"2006",
			"Question":"5(d) Discuss the elements and approaches of town planning in India."
		},
		{
			"Year":"2006",
			"Question":"6. Explain the morphology of Indian cities in the background of existing morphological models."
		},
		{
			"Year":"2006",
			"Question":"7. Present an account of tribals, tribal areas and their problems in India."
		},
		{
			"Year":"2006",
			"Question":"8. Explain the processes and patterns of regional disparities in India and suggest suitable measures for brining about the regional balances."
		},
		{
			"Year":"2007",
			"Question":"2. Discuss the development of local winds, and their influence on local weather, giving three examples of the well-known local winds in the world."
		},
		{
			"Year":"2007",
			"Question":"3. Discuss the different bases for classifying the ocean deposits and give a detailed account of pelagic deposits of the oceans."
		},
		{
			"Year":"2007",
			"Question":"4. Define the concept of isostasy and discuss the postulations of Airy and Pratt."
		},
		{
			"Year":"2007",
			"Question":"5(a) Social Forestry and environmental conservation"
		},
		{
			"Year":"2007",
			"Question":"5(b) Dualism in Geography"
		},
		{
			"Year":"2007",
			"Question":"5(c) Eustatic changes of Sea-level"
		},
		{
			"Year":"2007",
			"Question":"5(d) Delineation of Urban Fringe"
		},
		{
			"Year":"2007",
			"Question":"6. Explain the concept of sustainable development and propose a model for agricultural development."
		},
		{
			"Year":"2007",
			"Question":"7. Give an account of the functional bases to central place hierarchy."
		},
		{
			"Year":"2007",
			"Question":"8. Write a note on the parameters used to describe the demographic transitions in the developing countries like India."
		},
		{
			"Year":"2007",
			"Question":"2. Explain the different views put forth about the origin of Himalayas and divide Himalayas into vertical divisions."
		},
		{
			"Year":"2007",
			"Question":"3. Discuss the need of conservation and utility of water resource in India."
		},
		{
			"Year":"2007",
			"Question":"4. \"The institutional factors have grip over the crop pattern and crop productivity on Indian agriculture.\" Justify."
		},
		{
			"Year":"2007",
			"Question":"5(a) Discuss the policies and programmes of Integrated Rural Development Programmes in India."
		},
		{
			"Year":"2007",
			"Question":"5(b) Explain the causes and consequence of migration."
		},
		{
			"Year":"2007",
			"Question":"5(c) Write a critical note on the Cauvery River Dispute."
		},
		{
			"Year":"2007",
			"Question":"5(d) Critically examine the Panchayati Raj setup."
		},
		{
			"Year":"2007",
			"Question":"6. Bring out the impact of multinationals and liberalization on the Industrial Economy/Pattern of India."
		},
		{
			"Year":"2007",
			"Question":"7. Discuss environmental problems of India in the context of rapid economic development and population growth."
		},
		{
			"Year":"2007",
			"Question":"8. \"Slums are urban menace.\" Elucidate with Indian cities as examples."
		},
		{
			"Year":"2008",
			"Question":"2. Critically examine the concept of geomorphic cycle and discuss the views of W.M.Davis and W. Penck.60"
		},
		{
			"Year":"2008",
			"Question":"3. Discuss the mechanics and origin of the monsoon winds and explain the role of El Nino on Monsoon circulation.60"
		},
		{
			"Year":"2008",
			"Question":"4. Describe the ideal conditions for coral reef formation and discuss the glacial control theory of coral reef formation. 60"
		},
		{
			"Year":"2008",
			"Question":"5a) Desertification as an environmental hazards"
		},
		{
			"Year":"2008",
			"Question":"5b) Primate Cities"
		},
		{
			"Year":"2008",
			"Question":"5c) Seafloor spreading theory"
		},
		{
			"Year":"2008",
			"Question":"5d) Behavioral Geography"
		},
		{
			"Year":"2008",
			"Question":"6. Discuss the social and economic theories of population growth. 60"
		},
		{
			"Year":"2008",
			"Question":"7. Describe the laws of international boundaries and frontier.60"
		},
		{
			"Year":"2008",
			"Question":"8. Describe the view of von Thunen on agricultural location. 60"
		},
		{
			"Year":"2008",
			"Question":"2. Distinguish between the Himalayan and the peninsular drainage system.60"
		},
		{
			"Year":"2008",
			"Question":"3. Discuss the bases of identifying agro climate zones and explain the core strategies for agricultural development. 60"
		},
		{
			"Year":"2008",
			"Question":"4. Explain the factors promoting the rapid growth and development of the automobile industry in India, giving suitable example.60"
		},
		{
			"Year":"2008",
			"Question":"5a). Suggest appropriate energy policy for minimizing energy crisis in India."
		},
		{
			"Year":"2008",
			"Question":"5b). Describe and explain the spatial patterns of literacy in India."
		},
		{
			"Year":"2008",
			"Question":"5c). Assess the geographical significance of Indian Ocean."
		},
		{
			"Year":"2008",
			"Question":"5d). Explain the concept of sustainable development and examine its relevance."
		},
		{
			"Year":"2008",
			"Question":"6. ‘ Unplanned urban development has created numerous problems’ Comment.60"
		},
		{
			"Year":"2008",
			"Question":"7. Critically examine the bases of state reorganization in India since Independence. 60"
		},
		{
			"Year":"2008",
			"Question":"8. Discuss the problems and Prospects of development of catchment and command areas.60"
		},
		{
			"Year":"2009",
			"Question":"1a) Highlights the geomorphic features essentially found in topographies under the second cycle of Erosion. 20"
		},
		{
			"Year":"2009",
			"Question":"1b) Give a brief account of principal land biomes and their latitudinal distribution.20"
		},
		{
			"Year":"2009",
			"Question":"1c) Discuss views on slope development provided by L.C. King. 20"
		},
		{
			"Year":"2009",
			"Question":"3. a) Explain factors contributing to the global climate change 20"
		},
		{
			"Year":"2009",
			"Question":"3b). Discuss the consequences of Climate Change on agriculture and food security, and on the Coastal Zones of the world. 20"
		},
		{
			"Year":"2009",
			"Question":"3c) How does Climate change affect urban areas? 20"
		},
		{
			"Year":"2009",
			"Question":"4. a) Examine economic significance of the resources of the Continental Shelf of the Indian Ocean. 30"
		},
		{
			"Year":"2009",
			"Question":"4b) Comment on marine heat budget and the oceanic Circulation system. 30"
		},
		{
			"Year":"2009",
			"Question":"5a) Weight Triangle"
		},
		{
			"Year":"2009",
			"Question":"5b) ‘Limit to Growth’ Model"
		},
		{
			"Year":"2009",
			"Question":"5c) Tropical atmospheric instability"
		},
		{
			"Year":"2009",
			"Question":"5d) Zonal and Azonal soils"
		},
		{
			"Year":"2009",
			"Question":"6. a). Provide a geographical account of global production and distribution of food.30"
		},
		{
			"Year":"2009",
			"Question":"6b) ‘Quantitative Revolution and model building provided an empirical basis for geographical research’ – Elaborate. 30"
		},
		{
			"Year":"2009",
			"Question":"7. Elaborate the concept of Megalopolis and discuss the characteristics and problems related to two such regions selecting one each from North America and Europe. 60 "
		},
		{
			"Year":"2009",
			"Question":"8. a). Provide a broad classification of world cultural regions. 30"
		},
		{
			"Year":"2009",
			"Question":"8b). Highlights the significance of environmental issues in Regional Planning. 30"
		},
		{
			"Year":"2009",
			"Question":"1a) Discuss the formation and their distribution of the major soil types of India. 30"
		},
		{
			"Year":"2009",
			"Question":"2b) Give reasons as to why rainfall variability is a characteristic features of India’s monsoons. 30"
		},
		{
			"Year":"2009",
			"Question":"3c) Distinguish between the West and East coasts of India in terms of their evolution, present topography and drainage pattern 60 . "
		},
		{
			"Year":"2009",
			"Question":"4. Examine the role of raw materials in the location of the Iron and Steel Industry in India. Illustrate your answer with suitable examples. 60"
		},
		{
			"Year":"2009",
			"Question":"5a). What is the role of the Triple Transport System in the regional development of India ?"
		},
		{
			"Year":"2009",
			"Question":"5b). Explain the factors responsible for the distribution of Sugar Industry in India."
		},
		{
			"Year":"2009",
			"Question":"5c). State the geographical factors which influence rural house types in India."
		},
		{
			"Year":"2009",
			"Question":"5d). Giving reason , identify the chronic drought prone areas of India."
		},
		{
			"Year":"2009",
			"Question":"6. What are the cause and consequences of environmental degradation in India’s industrial areas? Give specific examples. 60"
		},
		{
			"Year":"2009",
			"Question":"7. There is no sharp divide where an urban settlement stops and rural areas begins.? Analyze the statement with reference to the sprawl of Indian cities. 60"
		},
		{
			"Year":"2009",
			"Question":"8. a). How do the ‘push’ and ‘pull’ factors operate for the emergence of slums in the metropolises of India?30"
		},
		{
			"Year":"2009",
			"Question":"8b). Discuss the impact of globlisation of India’s industry and agriculture sectors. 30"
		},
		{
			"Year":"2010",
			"Question":"1a. essential conditions for development of karst topography"
		},
		{
			"Year":"2010",
			"Question":"1b. ocean deposits"
		},
		{
			"Year":"2010",
			"Question":"1c. inversion of temperature"
		},
		{
			"Year":"2010",
			"Question":"1d. floristic kingdoms, based on their global distribution"
		},
		{
			"Year":"2010",
			"Question":"2. a. bring out the relevance of seismic study in determining the structure of the interior of the earth . 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"2b. weathering is complex phenomenon involving a number of process & is influenced by various factors. Elaborate. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"3. a. what is polar front? How does cyclone develop along this front? Describe the weather conditions associated with it. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"3b. examine the various kinds of atmospheric humidity & their associated forms. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"4.a. explain the scientifically sound methods of bathymetry & give an account of the bottom topography of the atlantic ocean. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"4b. give an account of the structure of ecosystem & describe its functional aspects. 30 mrks "
		},
		{
			"Year":"2010",
			"Question":"5a . neo-determinism"
		},
		{
			"Year":"2010",
			"Question":"5b. occidental culture realm"
		},
		{
			"Year":"2010",
			"Question":"5c. optimum population"
		},
		{
			"Year":"2010",
			"Question":"5d. growth poles"
		},
		{
			"Year":"2010",
			"Question":"5e. von thunen’s concept of economic rent."
		},
		{
			"Year":"2010",
			"Question":"6.a. critically examine the method of deriving human development index. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"6b. famine to a considerable extent, ia man made hazard. Elaborate. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"7.a. critically examine the changing perspective of on the concept of a real differentiation. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"7b. bring out the sequential improvements in models of city structure of by e. w. burgeese, homer hoyt, & harris & ullman. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"8.a. discuss the role of world trade organization in determining the pattern of world trade. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"8b. huge populations of developing countries are not a curse. These may be & also are an asset , if situations are properly managed. Elaborate on this assertion. 30 mrks."
		},
		{
			"Year":"2010",
			"Question":"2. explain Himalayan orogeny & illustrate how the process has affected the geomorphic characteristics of marco divisions of Himalayas. 60 mrks"
		},
		{
			"Year":"2010",
			"Question":"3. a. discuss the spatial distribution of natural vegetation in India with the help of sketched map. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"3b. examine the problems & prospects of agro-based industries in bihar. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"4.a. discuss the emerging pattern of surface water utilization in India. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"4b. assess as to how surface water utilization affects food production & food security in the country. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"5a. role of physiography in cross border terrorism"
		},
		{
			"Year":"2010",
			"Question":"5b. offshore oilfields & coastal ecology"
		},
		{
			"Year":"2010",
			"Question":"5c. spatial pattern of soil erosion in India"
		},
		{
			"Year":"2010",
			"Question":"5d. ethnic diversity of north-eastern states"
		},
		{
			"Year":"2010",
			"Question":"6.a. define an epidemic & discuss the occurrence of chikungunya in India . 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"6b. identify the regions affected by chikungunya with the help of sketched map & bring out the regional pattern of the disease. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"7.a. outline the role of class II & class III towns in urban process of India & indicate their contribution towards balanced urban development. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"7b. how does formation of national park help ecological restoration & conservation? Explain with suitable examples. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"8.a. explain how demographic transaction created demographic divide in contemporary India. 30 mks"
		},
		{
			"Year":"2010",
			"Question":"8b. what is regionalism? Discuss how regionalism affects the developmental process with suitable examples. 30 mks."
		},
		{
			"Year":"2011",
			"Question":"1(a) Geomagnetism and paleomagnetism"
		},
		{
			"Year":"2011",
			"Question":"1(b) Rossby waves and Jet Stream"
		},
		{
			"Year":"2011",
			"Question":"1(c) Salinity patterns in Indian Ocean"
		},
		{
			"Year":"2011",
			"Question":"1(d) Soil profile in Zonal and Azonal soils"
		},
		{
			"Year":"2011",
			"Question":"1(e) Marine Ecosystem"
		},
		{
			"Year":"2011",
			"Question":"2. (a) Name the climatically controlled agents of erosion. Explain how they differ in terms of properties of matter. Compare the landforms produced by each one of them. 30"
		},
		{
			"Year":"2011",
			"Question":"2(b) Explain the concept of Isostasy as postulated by Airy and Pratt. 30"
		},
		{
			"Year":"2011",
			"Question":"3. (a) Give an account of global distribution of precipitation. 30"
		},
		{
			"Year":"2011",
			"Question":"3(b) Contemporary global climate change is an anthropogenic phenomenon. Discuss. 30"
		},
		{
			"Year":"2011",
			"Question":"4. (a)Temperature, salinity and density differences in ocean water are the prime causes of ocean water circulation. Elaborate. 30"
		},
		{
			"Year":"2011",
			"Question":"4(b) Define the term biome. List the terrestrial biomes and describe the characteristics of Savanna biome. 30"
		},
		{
			"Year":"2011",
			"Question":"5(a) Welfare Approach in Human Geography"
		},
		{
			"Year":"2011",
			"Question":"5(b) Secondary cities in the context of urbanization in developing world"
		},
		{
			"Year":"2011",
			"Question":"5(c) Isodapane in the Theory of Industrial Location"
		},
		{
			"Year":"2011",
			"Question":"5(d) Population and Food security"
		},
		{
			"Year":"2011",
			"Question":"5(e) Ingredients of Sustainable Development"
		},
		{
			"Year":"2011",
			"Question":"6. (a) Discuss the impact of positivism in paradigm shift in Geography. 30"
		},
		{
			"Year":"2011",
			"Question":"6(b) Enumerate alternative strategies of planning for backward regions. 30"
		},
		{
			"Year":"2011",
			"Question":"7. (a) Distinguish between boundaries and frontiers. Identify different types of boundaries."
		},
		{
			"Year":"2011",
			"Question":"7(b) Mention the agricultural regions as classified by whittlessey and discuss their relevance. 30"
		},
		{
			"Year":"2011",
			"Question":"8. (a) Discuss System Approach and its applicability in Geography. 30"
		},
		{
			"Year":"2011",
			"Question":"8(b) Critically examine the salient features of Central Place Theory propounded by Christaller and Losch. 30"
		},
		{
			"Year":"2011",
			"Question":"2. Present a comparative analysis of the regimes of Himalayan and Peninsular rivers of India and examine their implications in the irrigation system of the country. 60"
		},
		{
			"Year":"2011",
			"Question":"3. (a) Identify the major biosphere reserves of India and discuss their role in the conservation of forest and wildlife. 30"
		},
		{
			"Year":"2011",
			"Question":"3(b) Give an account of potentiality and prospects of development of marine resources of India. 30"
		},
		{
			"Year":"2011",
			"Question":"4. (a) Discuss the potentiality and status of aqua-culture in the Ganga Plain. 30"
		},
		{
			"Year":"2011",
			"Question":"4(b) Assess the scope and development of Pharmaceutical Industry in India. 30"
		},
		{
			"Year":"2011",
			"Question":"5(a) Prospects of Rainbow Revolution in India."
		},
		{
			"Year":"2011",
			"Question":"5(b) Karewa Deposits and their economic significance."
		},
		{
			"Year":"2011",
			"Question":"5(c) Impact of land tenure on agriculture productivity in India."
		},
		{
			"Year":"2011",
			"Question":"5(d) Agro-forestry in India."
		},
		{
			"Year":"2011",
			"Question":"6. (a) Assess the growing importance of air transport in India and examine its role in the regional development of the country. 30"
		},
		{
			"Year":"2011",
			"Question":"6(b) Discuss the spatital pattern of intra-regional migration in India and examine its implications in regional development. 30"
		},
		{
			"Year":"2011",
			"Question":"7. (a) Differentiate between conurbations and metropolitan regions. Give a reasoned account of emerging conurbations in India. 30"
		},
		{
			"Year":"2011",
			"Question":"7(b) Identify the ravine-affected areas in India and discuss the environmental and economic impacts of their reclamation. 30"
		},
		{
			"Year":"2011",
			"Question":"8. (a) Discuss the problems of environmental degradation generated by urban wastes in India. 30"
		},
		{
			"Year":"2011",
			"Question":"8(b) Analyse the causes of desertification in India. Represent the desertified areas of the country on a sketch map and suggest remedial measures to control it. 30"
		},
		{
			"Year":"2012",
			"Question":"1a.Palaeozoic glacial evidence for Continental Drift."
		},
		{
			"Year":"2012",
			"Question":"1b.Systems approach to landform analysis."
		},
		{
			"Year":"2012",
			"Question":"1c.Compare and contrast tropical cyclone and temperature cyclone."
		},
		{
			"Year":"2012",
			"Question":"1d.Major components of IGBP."
		},
		{
			"Year":"2012",
			"Question":"1e. Different layers of ocean water"
		},
		{
			"Year":"2012",
			"Question":"2a.Explain how Bosche and Haldenhang lead to the Theory of Slope Replacement."
		},
		{
			"Year":"2012",
			"Question":"2b.Classify airmasses and explain how ‘cP’ airmass affects global climate."
		},
		{
			"Year":"2012",
			"Question":"3a.Discuss how different types of mining lead to different types of environmental problems."
		},
		{
			"Year":"2012",
			"Question":"3b.Adaptation and distribution of animals in the Ethiopian realm."
		},
		{
			"Year":"2012",
			"Question":"3c.Impact of Cryopsphare on global climate."
		},
		{
			"Year":"2012",
			"Question":"4a.Characteristics of the standard epigene cycle of erosion."
		},
		{
			"Year":"2012",
			"Question":"4b.Programmes initiated by the International Council of Science on Earth System studies."
		},
		{
			"Year":"2012",
			"Question":"4c.“Atolls present the most challenging explaination in the evolution of coral reefs”, Discuss."
		},
		{
			"Year":"2012",
			"Question":"5a.Relevance of distance decay principle in Indian cities."
		},
		{
			"Year":"2012",
			"Question":"5b.Impact of migration on urban demography."
		},
		{
			"Year":"2012",
			"Question":"5c.Similarities in the population distribution of southern continents and reasons for the same."
		},
		{
			"Year":"2012",
			"Question":"5d.Status of infant morality rate in the world."
		},
		{
			"Year":"2012",
			"Question":"5e.Problem faced by industries which developed due to inertia."
		},
		{
			"Year":"2012",
			"Question":"6a. Evaluate the various models on population density distribution in urban centres."
		},
		{
			"Year":"2012",
			"Question":"6b.“Though 70% of Indian population is rural, urban planning is crucial to the development of India.” Discuss."
		},
		{
			"Year":"2012",
			"Question":"7a. Salient features of watershed planning and its advantages and disadvantages."
		},
		{
			"Year":"2012",
			"Question":"7b. Impact of changing fertility ratio on world population"
		},
		{
			"Year":"2012",
			"Question":"7c. “Colonial forces resulted in the primate pattern of urban process in most Southern Asian countries.” Discuss."
		},
		{
			"Year":"2012",
			"Question":"8a. Regional shifts in the world urbanization after 1950 and the varied characteristics of urban process."
		},
		{
			"Year":"2012",
			"Question":"8b. Impact of failure of Monsoon on Gujarat Agro-climate zone."
		},
		{
			"Year":"2012",
			"Question":"8c. Locational significance of Rotterdam in European economy."
		},
		{
			"Year":"2012",
			"Question":"1a.Explain the structure characteristics of the Deccan plateau."
		},
		{
			"Year":"2012",
			"Question":"1b. Discuss the role of spatial pattern of rainfall and temperature in the delimitation of climatic region of India, specially with reference to stamp’s climatic regionalization."
		},
		{
			"Year":"2012",
			"Question":"2a.Delineate the mineral belts of India and mention their distinctive features."
		},
		{
			"Year":"2012",
			"Question":"2b.Divide India into agricultural regions and critically examine the role of ecological and human factors responsible for transformation of agricultural economy in any one region."
		},
		{
			"Year":"2012",
			"Question":"3a.Describe the development of textile industry in India."
		},
		{
			"Year":"2012",
			"Question":"3b.Examine the role of road transport in regional development taking suitable examples from an area you have studied in detail."
		},
		{
			"Year":"2012",
			"Question":"4.Identify the spatial pattern of agro-industrial regions of India. Analyse the potentiality of Malwa as an important agro-industrial region of the future."
		},
		{
			"Year":"2012",
			"Question":"5a.Factors affecting innovation diffusion."
		},
		{
			"Year":"2012",
			"Question":"5b.Linguistic diversity in North-eastern states."
		},
		{
			"Year":"2012",
			"Question":"5c.Geographical reason for the variation in literacy from state to state in India."
		},
		{
			"Year":"2012",
			"Question":"5d.Identity Tsunami affected areas and give their management problems in India."
		},
		{
			"Year":"2012",
			"Question":"5e.Morphological characteristics of villages situated in hilly regions."
		},
		{
			"Year":"2012",
			"Question":"6a.Evaluate the population policy of India and examine its relevance to the nation’s population control."
		},
		{
			"Year":"2012",
			"Question":"6b.Give an account of geographical conditions responsible for the development of different types of rural settlement in India."
		},
		{
			"Year":"2012",
			"Question":"7a.Examine the origin, dimensions and implications of the Sino-Indian border dispute."
		},
		{
			"Year":"2012",
			"Question":"7b.Exaplain the causes, impact and remedial measures of flood-hazards in the middle Ganga plain. Represent the flood-affected areas of middle Ganga plain on a sketch map in your answer-book."
		},
		{
			"Year":"2012",
			"Question":"8a.Examine the relevance of linkage of rivers in India with special reference to Ganga-Cauveri linkage canal."
		},
		{
			"Year":"2012",
			"Question":"8b.How age structure affects dependency ratio? Explain with suitable examples."
		},
		{
			"Year":"2012",
			"Question":"8c.Elucidate the role of Tribal Development Blocks in the development of Tribal area."
		},
		{
			"Year":"2013",
			"Question":"1a.Differences between Normal cycle and Arid cycle of Davis."
		},
		{
			"Year":"2013",
			"Question":"1b.Differentiate Storm Surges and Seiches."
		},
		{
			"Year":"2013",
			"Question":"1c.Uniqueness of fauna in the Notogean realm."
		},
		{
			"Year":"2013",
			"Question":"1d.Impact of Pleistocene Ice Age on the crust of the Earth."
		},
		{
			"Year":"2013",
			"Question":"1e.Types of endemic plants and their degree of vulnerability to extinction."
		},
		{
			"Year":"2013",
			"Question":"2a.With suitable examples, bring out the impact of local winds on the climate of an area. 20"
		},
		{
			"Year":"2013",
			"Question":"2b.What are the characteristics that make CHC a serious threat to the ecosystem? Give examples. 15"
		},
		{
			"Year":"2013",
			"Question":"2c.What is ‘Base level’? Explain the types of base level. 15"
		},
		{
			"Year":"2013",
			"Question":"3a.“Offshore Acoustic Study helped the development of the concept of sea floor spreading.” Explain.20"
		},
		{
			"Year":"2013",
			"Question":"3b.Discuss Dew point and the various forms of condensation. 15"
		},
		{
			"Year":"2013",
			"Question":"3c.Bring out the relationship between climate and vegetation in the Mountain Biome.15"
		},
		{
			"Year":"2013",
			"Question":"4a.Compare the Subsidence and Glacial control theories on the formation of coral reefs. 25"
		},
		{
			"Year":"2013",
			"Question":"4b.Explain the levels of Noise pollution and the legislative measures to control it. 25"
		},
		{
			"Year":"2013",
			"Question":"5a.”Ellen Churchill Semple is an ardent supporter of Determinism.” Explain."
		},
		{
			"Year":"2013",
			"Question":"5b. Role of Venezuela in the production and export of oil."
		},
		{
			"Year":"2013",
			"Question":"5c. Misra’s theoretical stages of Rural – Urban Process."
		},
		{
			"Year":"2013",
			"Question":"5d. Countries most affected in case of shut-down of Nuclear power."
		},
		{
			"Year":"2013",
			"Question":"5e. Relevance of Heartland theory in Contemporary world."
		},
		{
			"Year":"2013",
			"Question":"6a. What is Geriatrics? What are the problems associated with Geriatric population? 20"
		},
		{
			"Year":"2013",
			"Question":"6b. Discuss the changing pattern of production and export of Coffee in the world. 10"
		},
		{
			"Year":"2013",
			"Question":"7a. What are the basic postulates in the Central Place Model of Christaller? 20"
		},
		{
			"Year":"2013",
			"Question":"7b. “Urban Solid Waste Management poses the greatest challenge in Metropolitan planning.’ Elaborate."
		},
		{
			"Year":"2013",
			"Question":"7c. Analyse the reasons for a comparatively poorer development of fishing grounds in tropical areas."
		},
		{
			"Year":"2013",
			"Question":"8a. Explain the parameters for assessment and the spatial pattern of Human Development Index in the world."
		},
		{
			"Year":"2013",
			"Question":"8b. “Urban Geography is nothing but city “in” area and city “as” area.” Elaborate."
		},
		{
			"Year":"2013",
			"Question":"8c. Analyse the causes for changes in the pattern of world trade. "
		},
		{
			"Year":"2013",
			"Question":"1a. Explain the topographical and structural characteristics of the Siwalik Range. (10 marks| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"1b. Discuss the mechanism of Indian Monsoon. (10 marks| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"1c. Identify the main industrial clusters of India and account for their development. (10 marks| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"1d. Explain the method of delineating crop-association regions with reference to India. (10 marks| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"2a. Discuss the potentiality and present status of horticulture in the Western and Central Himalaya. (20m|250 words)"
		},
		{
			"Year":"2013",
			"Question":"2b. Delineate the coalfields of India and mention their distinctive features. (15|150 words)"
		},
		{
			"Year":"2013",
			"Question":"2c. Explain the role of multinationals in globalization of industries India. (15m|150 words)"
		},
		{
			"Year":"2013",
			"Question":"3a. Distributional pattern of industries in India does not provide requisite basis for division of the country into distinct Industrial regions. Elaborate. (25m| 250 words)"
		},
		{
			"Year":"2013",
			"Question":"3b. Discuss the role of institutional factors in shaping the pattern of Indian agriculture. (15m| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"3c. What do you understand by ‘Young India? How can the present state of population composition be converted into an asset for the country? (15m| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"4a. Comment on the feasibility of interlinking of rivers of India and its possible contribution to resolution of water crisis. (20m| 250 words)"
		},
		{
			"Year":"2013",
			"Question":"4b. Define agricultural productivity. Mention the methods of its measurement and bring out the disparities in its regional distribution. (15m| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"4c. Discuss the problems in realization of benefits of globalization and liberalization in industrial sector of India. (15m| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"5a. City-regions as territorial unit for regional planning and development"
		},
		{
			"Year":"2013",
			"Question":"5b. Snags in the Food Security Policy of India"
		},
		{
			"Year":"2013",
			"Question":"5c. Demographic dividend and its implications on environment"
		},
		{
			"Year":"2013",
			"Question":"5d. Planning and development of ‘Tribal Regions’ in India"
		},
		{
			"Year":"2013",
			"Question":"6a. Write a note on geopolitics of the Indian Ocean realm. (20m| 250 words)"
		},
		{
			"Year":"2013",
			"Question":"6b. Comment on the basis of creation of new States in India in 2000. (15m| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"6c. Enumerate the basic indicators of development and explain their application in identification of the spatial diversity in development in India. (15m| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"7a. Write a note on the emergence of National Settlement System in colonial India and discuss the factors contributing to urbanization in post-independence period. (20m| 250 words)"
		},
		{
			"Year":"2013",
			"Question":"7b. Define slums and explain their problems. (15m | 150 words)"
		},
		{
			"Year":"2013",
			"Question":"7c. Discuss the objectives of Vision 2020' in creation of viable village complex in India for Inclusive Rural Development’ programme. (15m| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"8a. Identify the earthquake-prone zones and suggest strategy for their management. (20m| 250 words)"
		},
		{
			"Year":"2013",
			"Question":"8b. Describe the impact of linguistic diversity on the development of various regions of India. (15m| 150 words)"
		},
		{
			"Year":"2013",
			"Question":"8c. Describe how urbanization creates air and water pollution in India. (15m | 150 words)"
		},
		{
			"Year":"2014",
			"Question":"1a.Define the term ‘meander’ and describe the basic characteristics of entrenched meander and ingrown meander."
		},
		{
			"Year":"2014",
			"Question":"1b.Discuss the salient features of ‘sirocco’ and ‘mistral’."
		},
		{
			"Year":"2014",
			"Question":"1c.Discuss an account of the nature of biosphere as an ecosystem."
		},
		{
			"Year":"2014",
			"Question":"1d.State the uniqueness of the Eurasian Steppe Biome."
		},
		{
			"Year":"2014",
			"Question":"2a.Illustrate the origin and nature of Sargasso Sea and Lagoon"
		},
		{
			"Year":"2014",
			"Question":"2b.State the concept of plate tectonics. How does it help in explaining the formation of Himalayas and Appalachain Mountains."
		},
		{
			"Year":"2014",
			"Question":"2c.Describe the origin and development of thunderstorms with examples."
		},
		{
			"Year":"2014",
			"Question":"3a.Enumerate the major causes of increasing degradation of environment in hills and hillslopes, and state its down-valley impact."
		},
		{
			"Year":"2014",
			"Question":"3b.Discuss the nature and origin of Indian monsoon and recent techniques of its prediction."
		},
		{
			"Year":"2014",
			"Question":"3c.State the concept of erosion surfaces and highlight the factors responsible for their development."
		},
		{
			"Year":"2014",
			"Question":"4a.Give a critical account of reasons and consequences of marine pollution."
		},
		{
			"Year":"2014",
			"Question":"4b.Explain weathering and mass wasting, and describe their geomorphic significance."
		},
		{
			"Year":"2014",
			"Question":"4c.Define zoogeographic region.Also describe he basic faunal makeup of the Neo-Arctic zoogeographic region."
		},
		{
			"Year":"2014",
			"Question":"5a.Give an account of recent observation on coral bleaching with reference to Clive Wilkinson’s Report."
		},
		{
			"Year":"2014",
			"Question":"5b.Elaborate the concept of mental map."
		},
		{
			"Year":"2014",
			"Question":"5c.Give an account of food security issues in developing countries."
		},
		{
			"Year":"2014",
			"Question":"5d.Discuss the factors responsible for counter-urbanisation."
		},
		{
			"Year":"2014",
			"Question":"6a.Explain the relevance of bottom-up and top-down approaches in the development of agrarian economy."
		},
		{
			"Year":"2014",
			"Question":"6b.Critically analyse application of models in geography."
		},
		{
			"Year":"2014",
			"Question":"6c.Explain the necessary conditions of takeoff and subsequent stages of development of a nation as propounded by Rostow."
		},
		{
			"Year":"2014",
			"Question":"7a.Discuss environmental and economic problems associated with coal production."
		},
		{
			"Year":"2014",
			"Question":"7b.Discuss the contribution of geographers in the development of radical geography."
		},
		{
			"Year":"2014",
			"Question":"7c.Giving suitable examples, describe the importance of system analysis in geographical studies."
		},
		{
			"Year":"2014",
			"Question":"8a.“Rural sustainability is necessary for urban sustainability.” Discuss the statement in the backdrop of integrated development approach."
		},
		{
			"Year":"2014",
			"Question":"8b.“Indo-Gangetic hearth is considered to be one of the world’s richest cultural realms.” Examine."
		},
		{
			"Year":"2014",
			"Question":"8c.Explain the qualitative and quantitative methods of delineation of sphere of urban influence."
		},
		{
			"Year":"2014",
			"Question":"1a.“World is passing through a global resource dilemma.” Comment"
		},
		{
			"Year":"2014",
			"Question":"1b“Food productivity with purity of the ecosystem is the need of the hour.” Elaborate."
		},
		{
			"Year":"2014",
			"Question":"2.On the outline map of India provided to you, mark the location of all of the following. Write in your QCA Booklet the significance of the locations, whether physical/commercial/economic/ecological/environmental/cultural in not more than 30 words for each entry: (2 x 5 =10 marks)  a.Guru Shikhar b. Bhor Ghat c.Shravanabelagola d.Kalibangan e.Ganga Sagar"
		},
		{
			"Year":"2014",
			"Question":"2a.Explain how eco-tourism, activities could be important livelihood options in the Himalayan and North-Eastern regions of the country."
		},
		{
			"Year":"2014",
			"Question":"2b.How is drainage pattern determined by the water divide?"
		},
		{
			"Year":"2014",
			"Question":"2c.Location of thermal power plants and coal fields in India are mot mutually conducive. Analyse."
		},
		{
			"Year":"2014",
			"Question":"3a.Why has agro and social forestry has failed to achieve its objectives?"
		},
		{
			"Year":"2014",
			"Question":"3b.Bring out the distribution of Laterite soils in India and their specific use for agriculture."
		},
		{
			"Year":"2014",
			"Question":"3c.Suggest the measures of wild-life conservation with reference to extinction of rare species."
		},
		{
			"Year":"2014",
			"Question":"4a.Describe the problems of agro-based industries in India in general and cotton textiles in particular."
		},
		{
			"Year":"2014",
			"Question":"4b.Highlight the socio-economic and ecological roles of River Cauvery in its riverine tract."
		},
		{
			"Year":"2014",
			"Question":"4c.Discuss the problems and prospects of National Waterway No. 1."
		},
		{
			"Year":"2014",
			"Question":"4d.Explain the concept of ‘Make in India’ and indicate the essential inputs for its success."
		},
		{
			"Year":"2014",
			"Question":"5a.Describe the salient climatological characteristics of Rayalseema region."
		},
		{
			"Year":"2014",
			"Question":"5b.‘In spite of various negative impacts of Green Revolution, there is a demand for New Green Revolution.’ Elaborate."
		},
		{
			"Year":"2014",
			"Question":"5c.What are the desired possible changes in our trade policy to promote the development of cottage industry?"
		},
		{
			"Year":"2014",
			"Question":"6a.On the outline map of India provided to you, mark the location of all of the following. Write in your QCA Booklet the significance of these locations, whether physical/commercial/economic/ecological/environmental/cultural in not more than 30 words for each entry: (2 x 5 = 10 marks)"
		},
		{
			"Year":"2014",
			"Question":"6b.Highlight the implications of declining child sex ratio in India."
		},
		{
			"Year":"2014",
			"Question":"6c.Analyse the feasibility of “Smart Towns’ Development in India."
		},
		{
			"Year":"2014",
			"Question":"7a.Comment on the criteria of identifying Drought Prone Areas in India."
		},
		{
			"Year":"2014",
			"Question":"7b.Bring out the role of terrain in determining India’s political influence over neighbouring countries."
		},
		{
			"Year":"2014",
			"Question":"7c.Discuss the trends in emigration focusing on its major thrust."
		},
		{
			"Year":"2014",
			"Question":"7d.Account for the multiple problems of urban agglomerations."
		},
		{
			"Year":"2014",
			"Question":"8a.Evaluate the Backward Regions Grant Fund Programme."
		},
		{
			"Year":"2014",
			"Question":"8b.How can a meaningful skill development programme contribute to the economic growth of hill areas?"
		},
		{
			"Year":"2014",
			"Question":"8c.Differentiate between ‘intensity’ and ‘magnitude’ of an earthquake and explain its varying impact in different parts of India."
		},
		{
			"Year":"2014",
			"Question":"8d.Discuss the implications of India’s strategic location with reference to the Indian Ocean."
		},
		{
			"Year":"2014",
			"Question":"9a.India is involved in a number of border disputes. Explain the reasons and remedies."
		},
		{
			"Year":"2014",
			"Question":"9b.Discuss the concept of Command Area Development and evaluate its success with reference to Indira Gandhi Canal."
		},
		{
			"Year":"2014",
			"Question":"9c.How has an inappropriate urban land use policy accounted for undesirable development in and around metropolitan cities."
		},

		
		{
			"Year":"2015",
			"Question":"1a.Attempt a classification of geomorphic process from zonal point of view."
		},
		{
			"Year":"2015",
			"Question":"1b.Discuss as to how frontogenesis contribute to weather instability."
		},
		{
			"Year":"2015",
			"Question":"1c.Describe the characteristics of different types of pelagic deposits."
		},
		{
			"Year":"2015",
			"Question":"1d. Explain the characteristics of ecological succession"
		},
		{
			"Year":"2015",
			"Question":"1e.comment on the impact of environmental education on quality of life it"
		},
		{
			"Year":"2015",
			"Question":"2a.Discuss the continuations of the American School of Denudation in geomorphology."
		},
		{
			"Year":"2015",
			"Question":"2b What is Potential Evapotranspiration? Explain how it is used in assessing the water balance in an area"
		},
		{
			"Year":"2015",
			"Question":"2c.Discuss the method of conserving biodiversity for sustainable development"
		},
		{
			"Year":"2015",
			"Question":"3a.Discuss the basis of Knppen’a climatic classification. Bring out the silent characteristics of “Cs” type of climate"
		},
		{
			"Year":"2015",
			"Question":"3b.Explain with example, as to how channel dynamic has been responsible for the development of alluvial fans and cones."
		},
		{
			"Year":"2015",
			"Question":"3c.Classify soils based on their zonal distribution and describe the characteristics of pedocals."
		},
		{
			"Year":"2015",
			"Question":"4a.Explain the different stages of ecological adaptation of man and bring out the changing balance between man and development."
		},
		{
			"Year":"2015",
			"Question":"4b.Present -day landforms bear more complexity than simplicity. Elucidate."
		},
		{
			"Year":"2015",
			"Question":"4c.Explain the meridional circulation of the atmosphere and its importance in world climate."
		},
		{
			"Year":"2015",
			"Question":"5a.“The welfare face of geography makes it an inter-disciplinary subject. Elaborate."
		},
		{
			"Year":"2015",
			"Question":"5b.“Energy mix is a step towards sustainability.” Discuss."
		},
		{
			"Year":"2015",
			"Question":"5c.Discuss Nelson’s method of functional classification of towns."
		},
		{
			"Year":"2015",
			"Question":"5d.“Marx’s view on population is more humanistic.’ Comment."
		},
		{
			"Year":"2015",
			"Question":"6a.Development planning has a component of environmental cost. Discuss."
		},
		{
			"Year":"2015",
			"Question":"6b.“Regional synthesis is the crux of geographical studies.” Elaborate."
		},
		{
			"Year":"2015",
			"Question":"6c.Man-induced famines are becoming more common than nature-induced ones.” Comment."
		},
		{
			"Year":"2015",
			"Question":"7a.Critically examine the theories on population migration."
		},
		{
			"Year":"2015",
			"Question":"7b.Discuss the relevance of Von Thunen’s model on agricultural on location in the contemporary context. Covered in Mrunal’s location factor article series"
		},
		{
			"Year":"2015",
			"Question":"7c.“Cultural regions are the most suited units to study the diversity of area ” Comment."
		},
		{
			"Year":"2015",
			"Question":"8a.Discuss the approaches to the study of behavioural geography."
		},
		{
			"Year":"2015",
			"Question":"8b.“There is a rejuvenation of environmentalism as a paradigm in geographical studies Comment."
		},
		{
			"Year":"2015",
			"Question":"8c.“Geographical traits lead to regional imbalances” Examine."
		},
		{
			"Year":"2015",
			"Question":"1a.Vital statistics are necessary ingredients for development planning Elaborate."
		},
		{
			"Year":"2015",
			"Question":"1b.On the outline map of India provided to you, mark the locations of all the following. Write in your QCA Booklet the significance of these locations, whether physical/ commercial/ economic/ ecological/ environmental/ cultural, in not more than 30 words for each entry : 2×5=10"
		},
		{
			"Year":"2015",
			"Question":"2a.Why does the pharmaceutical industry concentrate largely in the western region of the country? (In about 150 words)"
		},
		{
			"Year":"2015",
			"Question":"2b.Explain the pattern of winter rainfall in India. (In about 150 words)"
		},
		{
			"Year":"2015",
			"Question":"2c.Discuss the relationship of watershed approach to village level planning (In about 150 words). Covered in Rajtanil’s lecture G7/P8"
		},
		{
			"Year":"2015",
			"Question":"2d.How docs natural vegetation affect the formation of in situ soils? (In about 150 words)"
		},
		{
			"Year":"2015",
			"Question":"2e.Account for the geographical distribution of groundwater resources of India. How serious is its depletion in recent decades? Covered in Rajtnail’s lecture G7/P7"
		},
		{
			"Year":"2015",
			"Question":"3a.Why is the traditional crafts industry in India on the decline?"
		},
		{
			"Year":"2015",
			"Question":"3b.Explain how modernization of Indian agriculture is affected by unfavourable institutional factors with suitable examples. Covered in Mrunal’s economic survey lecture L5/P2"
		},
		{
			"Year":"2015",
			"Question":"3c.Distinguish between ‘agricultural productivity’ and ‘agricultural efficiency, and bring out the disparity in regional distribution of agricultural efficiency."
		},
		{
			"Year":"2015",
			"Question":"4a.With the help of a map, indicate the principal areas of dryland farming in the country and account for farmers’ suicides mainly in those areas."
		},
		{
			"Year":"2015",
			"Question":"4b.Evaluate the contribution of Communication and Information Technology to the development of economy and society, and examine the relevance of the recently launched ‘Digital India programme. Covered in Mrunal’s Mains Revision Series Lecture ML4/P2"
		},
		{
			"Year":"2015",
			"Question":"4c.Account for the growing frequency and intensity of floods in India, and suggest short- and long-term remedial measures indicating the chronically flood prone areas. Covered in Rajtanil’s lecture G7/P8"
		},
		{
			"Year":"2015",
			"Question":"5a.How does climate change affect the- process of desertification of India?"
		},
		{
			"Year":"2015",
			"Question":"5b.Discuss the scope of replication of White Revolution’ in lndia."
		},
		{
			"Year":"2016",
			"Question":"1(a) Describe the “Basket of eggs topography\". 10 marks"
		},
		{
			"Year":"2016",
			"Question":"1(b) Differentiate between insolation and temperature and explain anomalous temperature. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"1(c) Discuss Maritime Zones. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"1(d) Bring out the ecological significance of Tropical Rainforest Biome. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"1(e) Explain the hydro-meteorological hazards in the Himalayas. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"2.(a) \"In explaining the concept of 'Pediplanation', King combined the ideas of Davis, Penck and Wood with his own.\" Elaborate. 20 marks"
		},
		{
			"Year":"2016",
			"Question":"2(b) Compare the origin and weather conditions associated with the tropical and temperate cyclones.15 marks"
		},
		{
			"Year":"2016",
			"Question":"2(c) Give a reasoned account on how the impact of Global Warming differs from one part of the Earth to the other. 15 marks"
		},
		{
			"Year":"2016",
			"Question":"3.(a) Discuss the significance of World Climate Research Programme (WCRP) and its core projects in the understanding of climatic change. 20 marks"
		},
		{
			"Year":"2016",
			"Question":"3(b) \"The relationship between the winds and the currents is best seen in the Indian Ocean.\" Justify. 15 marks"
		},
		{
			"Year":"2016",
			"Question":"3(c) Write a critical note on the tendency of use and throw\" in the context of economic status and environment. 15 marks"
		},
		{
			"Year":"2016",
			"Question":"4.(a) Bring out the various ecological problems associated with the exploitation and use of oceans and their resources. 20 marks"
		},
		{
			"Year":"2016",
			"Question":"4(b) \"Geological structure has a dominant control on landforms and is reflected on them.\" Discuss. 15 marks"
		},
		{
			"Year":"2016",
			"Question":"4(c) Describe Newbigin's scheme of Floristic regions of the world and explain the Mediterranean Floristic region. 15 marks"
		},
		{
			"Year":"2016",
			"Question":"5(a) \"Areal differentiation forms the core theme in Geography.\" Explain. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"5(b) Explain 'Isodapane'. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"5(c) Discuss the major characteristics of CBD'. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"5(d) Elaborate the idea of \"Compage'. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"5(e) Discuss the application of Gravity model in Geographical studies, 10 marks"
		},
		{
			"Year":"2016",
			"Question":"6.(a) Trace the origin and progress of Quantitative Revolution in Geography and bring out its merits and demerits. 20 marks"
		},
		{
			"Year":"2016",
			"Question":"6(b) Discuss the role of site in determining the types and patterns of rural settlements.15 marks"
		},
		{
			"Year":"2016",
			"Question":"6(c) What is a \"region' ? Describe \"Thiessen' polygon method of regional delimitation. 15 marks"
		},
		{
			"Year":"2016",
			"Question":"7.(a) Describe the regional pattern of Life Expectancy in the world and bring out the challenges faced by developing countries due to increasing life expectancy. 20 marks"
		},
		{
			"Year":"2016",
			"Question":"7(b) Discuss the relevance of 'Stop and Go Determinism' in the present day context. 15 marks"
		},
		{
			"Year":"2016",
			"Question":"7(c) Define and differentiate between boundaries and frontiers. Describe the geometrical boundaries with suitable examples. 15 marks"
		},
		{
			"Year":"2016",
			"Question":"8.(a) Give a critical account of Losch's theory of central places. 20 marks"
		},
		{
			"Year":"2016",
			"Question":"8(b) \"Linkages between resource-endowed regions and resource-utilizing regions determine the pattern of international trade.\" Elaborate with suitable examples. 15 marks"
		},
		{
			"Year":"2016",
			"Question":"8(c) In what ways can geographers contribute towards optimal land use planning in a region ? 15 marks"
		},
		{
			"Year":"2016",
			"Question":"1(b) Explain the shifting of river courses and river capturing in the Himalayas. (In about 150 words) 10 marks"
		},
		{
			"Year":"2016",
			"Question":"1(c) Mention the space relationship of India with neighbouring countries. (In about 150 words) 10 marks"
		},
		{
			"Year":"2016",
			"Question":"1(d) Define agricultural intensity and bring out its regional distribution in India. (In about 750 words) 10 marks"
		},
		{
			"Year":"2016",
			"Question":"2.(a) Discuss the role of spatial pattern of rainfall and temperature in the delimitation of climatic regions of India especially with reference to Stamp's climatic regionalization. (In about 250 words) 20 marks"
		},
		{
			"Year":"2016",
			"Question":"2(b) Describe the flood-prone areas and their management problems in the Ganga Plains. (In about 200 words) 15 marks"
		},
		{
			"Year":"2016",
			"Question":"2(c) Explain the New Industrial Policies in India. (In about 200 words) 15 marks"
		},
		{
			"Year":"2016",
			"Question":"3.(a) Identify the important biotic resource regions of India and highlight their problems. (In about 250 words) 20 marks"
		},
		{
			"Year":"2016",
			"Question":"3(b) Point out the ethnic disparities in the N-E India. (In about 200 words) 15 marks"
		},
		{
			"Year":"2016",
			"Question":"3(c) Give an account of the development of renewable resources of India. (In about 200 words) 15 marks"
		},
		{
			"Year":"2016",
			"Question":"4.(a) Bring out the development of river water transport in India and its role in regional development. (In about 250 words) 20 marks"
		},
		{
			"Year":"2016",
			"Question":"4(b) Explain the impact of economic development on environmental degradation in India. (In about 200 words) 15 marks"
		},
		{
			"Year":"2016",
			"Question":"4(c) Describe the distribution of black soils in India and their specific use for agriculture. (In about 200 words) 15 marks"
		},
		{
			"Year":"2016",
			"Question":"5. For Question Nos. 5(a) to 5(e), write on each in about 150 words: 5x10=50 marks"
		},
		{
			"Year":"2016",
			"Question":"5(a) Discuss the factors influencing the distribution of sex ratio in India. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"5(b) \"The Bokaro Iron and Steel Plant is an example of Industrial Complex.\" Explain. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"5(c) How do slums develop? Give concrete suggestions for their improvement. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"5(d) Explain the role of India in the geo-politics of South Asia. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"5(e) Analyze the pattern of India's trade with the S-E Asian countries. 10 marks"
		},
		{
			"Year":"2016",
			"Question":"6.(a) Present a comparative analysis of geographical factors responsible for distribution of human settlements in Rajasthan desert and North-Eastern regions of India. (In about 250 words) 20 marks"
		},
		{
			"Year":"2016",
			"Question":"6(b) Explain with suitable examples the role of road transport in agricultural development in India. (In about 200 words) 15 marks"
		},
		{
			"Year":"2016",
			"Question":"6(c) Evaluate the impact of technology on resource utilization in India. (In about 200 words) 15 marks"
		},
		{
			"Year":"2016",
			"Question":"7.(a) Analyze the location, distributional pattern and problems of cotton textile industries in India. (In about 250 words) 20 marks"
		},
		{
			"Year":"2016",
			"Question":"7(b) Describe the major tribal regions of India and their problems. (In about 200 words) 15 marks"
		},
		{
			"Year":"2016",
			"Question":"7(c) Examine the causes of regional disparities in economic development in India. (In about 200 words) 15 marks"
		},
		{
			"Year":"2016",
			"Question":"8.(a) Describe the causes and effects of urbanization in India and explain its impact on rural landscape and urban ecology. (In about 250 words) 20 marks"
		},
		{
			"Year":"2016",
			"Question":"8(b) \"India has paid heavily for achievement of Green Revolution in the form of economic, social and ecological cost.\" Discuss. (In about 200 words) 15 marks"
		},
		{
			"Year":"2016",
			"Question":"8(c) Explain the origin, dimension and implications of Sino-Indian border dispute. (In about 200 words) 15 marks"
		},
		{
			"Year":"2017",
			"Question":"1(a) Write a note on pseudo-volcanic features. 10"
		},
		{
			"Year":"2017",
			"Question":"1(b) Distinguish between low energy coasts and coral coasts. 10"
		},
		{
			"Year":"2017",
			"Question":"1(c) Discuss the impacts of ocean currents on air mass behaviour. 10"
		},
		{
			"Year":"2017",
			"Question":"1(d) Describe the characteristics of biological deserts. 10"
		},
		{
			"Year":"2017",
			"Question":"1(e) Explain the concept of micro carbon sink and its relevance. 10"
		},
		{
			"Year":"2017",
			"Question":"2(a) Discuss the faces which govern the air movement on the Earth's surface. 20 "
		},
		{
			"Year":"2017",
			"Question":"2(b) \"The knowledge of slope analysis has limited field application in the slope management.\" Explain. 15 "
		},
		{
			"Year":"2017",
			"Question":"2(c) Describe the configuration of the Pacific Ocean floor. 15"
		},
		{
			"Year":"2017",
			"Question":"3(a) \"Climate change is a reality.\" Explain with suitable examples. 20"
		},
		{
			"Year":"2017",
			"Question":"3(b) Distinguish between the characteristics of Chernozem and Sierozem soils. 15"
		},
		{
			"Year":"2017",
			"Question":"3(c) Give a classification of plants based on the amount of water requirement. 15"
		},
		{
			"Year":"2017",
			"Question":"4(a) Discuss the concept of Poriglacial cycle as propounded by Peltier. 20"
		},
		{
			"Year":"2017",
			"Question":"4(b) \"climate, slope gradient and rock structure influence the avulsion of channels.\" Explain. 15"
		},
		{
			"Year":"2017",
			"Question":"4(c) Discuss the Perception, Attitude, Value and Emotion (PAVE) Theory of environmental management. 15"
		},
		{
			"Year":"2017",
			"Question":"5(a) Explain the concept of Time-Geography.  10"
		},
		{
			"Year":"2017",
			"Question":"5(b) \"Whittlesey's agricultural regions are relevant even today.\" Discuss. 10"
		},
		{
			"Year":"2017",
			"Question":"5(c) Write an explanatory note on geographical systems.    10"
		},
		{
			"Year":"2017",
			"Question":"5(d) “The traditional cultural identities are at loss with the of growth global connectivity.\" Explain. 10"
		},
		{
			"Year":"2017",
			"Question":"5(e) Give an account on sustainable development and its components. 10"
		},
		{
			"Year":"2017",
			"Question":"6(a) Discuss the contemporary paradigms of Geography. 20"
		},
		{
			"Year":"2017",
			"Question":"6(b) \"The intensity of energy crisis varies regionally.\" Explain. 15"
		},
		{
			"Year":"2017",
			"Question":"6(c) Examine the causes and consequences of forced migration of 15 population in the present context."
		},
		{
			"Year":"2017",
			"Question":"7(a) Discuss the applicability of Christaller's Central Place Theory. 20"
		},
		{
			"Year":"2017",
			"Question":"7(b) \"There are considerable demographic similarities between West European nations and Japan.\" Explain. 15"
		},
		{
			"Year":"2017",
			"Question":"7(c) Define the quality of life and explain its parameters with adequate examples. 15"
		},
		{
			"Year":"2017",
			"Question":"8(a) \"The Heartland Theory is gaining importance once again.\" Comment. 20"
		},
		{
			"Year":"2017",
			"Question":"8(b) Examine the role of small towns in the regional development process. 15"
		},
		{
			"Year":"2017",
			"Question":"8(c) Explain the concept of social capital in relation to India. 15"
		},
		{
			"Year":"2017",
			"Question":"1(a) Discuss the freshwater crisis  in India and prepare a blueprint for its sustainable management. 20"
		},
		{
			"Year":"2017",
			"Question":"1(b) Identify the Naxal-affected areas in India and discuss their socio-economic problems. 15"
		},
		{
			"Year":"2017",
			"Question":"1(c) Critically examine the feasibility of development of a comprehensive network of airways in India. 15"
		},
		{
			"Year":"2017",
			"Question":"2(a) \"An effective three-tier Panchayat Raj System will strengthen the bottom-up approach to multilevel planning in India.\" Explain. 20"
		},
		{
			"Year":"2017",
			"Question":"2(b) 'Linguistic diversity is an asset as well as a  challenge in India.\" Explain the statement focussing on the distribution of languages and the major steps taken to address the related issues. 15"
		},
		{
			"Year":"2017",
			"Question":"2(c) How may tourism in hilly areas of India be developed as an important source of economy? 15"
		},
		{
			"Year":"2017",
			"Question":"3(a) Mention various methods  of functional classification of towns in India and explain the method applied by Asok Mitra. 20"
		},
		{
			"Year":"2017",
			"Question":"3(b) Farmers' suicide is one of the major agrarian problems in India. Bring out its causes and suggest the remedial measures with special reference to Maharashtra, Andhra Pradesh and Punjab. 15"
		},
		{
			"Year":"2017",
			"Question":"3(c) Land reform is a key to modern agriculture in India. Describe various measures taken in this direction after Independence. 15"
		},
		{
			"Year":"2017",
			"Question":"4(a) Explain the role of 'Hill Transport Subsidy Scheme' in reducing regional imbalances in areas identified by the Government of India."
		},
		{
			"Year":"2017",
			"Question":"4(b) Bring out the geopolitical implications of Doklam dispute in the context of Indo-China relations."
		},
		{
			"Year":"2017",
			"Question":"4(c) Bring out the significance of Indian Regional Navigation Satellite System (IRNSS)."
		},
		{
			"Year":"2017",
			"Question":"4(d) Mini steel plants can act as an instrument of decentralization of iron and steel industry in India. Explain."
		},
		{
			"Year":"2017",
			"Question":"4(e) Goods and Services Tax (GST) has differential impact on developed and backward States of the country. How and why?"
		},
		{
			"Year":"2017",
			"Question":"5(a) Interlinking of rivers may sent as a major source of assured irrigation and all-weather inland navigation in India. Comment on its feasibility taking into account physical, economic and ecological implication. 20"
		},
		{
			"Year":"2017",
			"Question":"5(b) Religious minorities are largely concentrated in border States of India. Discuss its causes and consequences. 15"
		},
		{
			"Year":"2017",
			"Question":"5(c) What do you understand by soil pollution? Delineate the areas vulnerable to it in India and suggest remedial measures. 15"
		},
		{
			"Year":"2017",
			"Question":"6(a) Integrated development of road and rail networks in a complementary framework is a prerequisite for regional development. Explain with reference to North-Eastern Region of India. 20"
		},
		{
			"Year":"2017",
			"Question":"6(b) Describe the salient features of Sagar Mala Project and highlight its role in port-led development of coastal regions in India. 15"
		},
		{
			"Year":"2017",
			"Question":"6(c) Justify the inclusion of Meghalaya in Peninsular India and discuss its vegetation and soil types. 15"
		},
		{
			"Year":"2017",
			"Question":"7(a) Name the major industrial regions of India indicating the bases of their identification. Highlight their basic problems. 20"
		},
		{
			"Year":"2017",
			"Question":"7(b) Drainage pattern in Peninsular India is a result of its geological structure and topography. Elaborate."
		},
		{
			"Year":"2017",
			"Question":"7(c) Why has solar energy in India not been developed to desired level in spite of its high potential?  15"
		},
		{
			"Year":"2018",
			"Question":"1(a) “Landscape is a function of structure, process and stage.” Critique the statement. "
		},
		{
			"Year":"2018",
			"Question":"1(b) Explain the role of evaporation in the hydrologic cycle. "
		},
		{
			"Year":"2018",
			"Question":"1(c) Describe the causes and consequences of sea level changes."
		},
		{
			"Year":"2018",
			"Question":"1(d) Distinguish between intrazonal and azonal soils. Describe in brief the characteristics and importance of azonal soils. "
		},
		{
			"Year":"2018",
			"Question":"1(e) Explain the natural and anthropogenic causes and mitigation measures of frequent flooding in Mumbai."
		},
		{
			"Year":"2018",
			"Question":"2 (a) Evaluate how far Kober's geosynclinals theory explains the mountain building process. "
		},
		{
			"Year":"2018",
			"Question":"2(b) Critically examine the basis and scheme of climatic classification proposed by G.T.Trewartha. "
		},
		{
			"Year":"2018",
			"Question":"2(c) Discuss the objectives and principles of environmental education. Describe the basic concerns of formal and non-formal environmental education in India."
		},
		{
			"Year":"2018",
			"Question":"3 (a) Explain the origin, progress and retreat of the Indian monsoon and discuss its impact on the Indian economy. "
		},
		{
			"Year":"2018",
			"Question":"3(b) “Geomorphological changes are largely responsible for environmental hazards in the Himalayan region.” Comment with relevant examples. "
		},
		{
			"Year":"2018",
			"Question":"3(c) “Controlling population growth is the sustainable solution to environmental problems.” Express your views with suitable arguments."
		},
		{
			"Year":"2018",
			"Question":"4 (a) Describe the potential marine energy resources with reference to their benefits, harvestibility and environmental impacts. "
		},
		{
			"Year":"2018",
			"Question":"4(b) Explain the ecosystem approach to environmental management and highlight its advantages and disadvantages. "
		},
		{
			"Year":"2018",
			"Question":"4(c) Discuss the causes of degradation of tropical rainforests and suggest remedial measures for their prevention, conservation and development."
		},
		{
			"Year":"2018",
			"Question":"5(a) “Geography is a contested and multiparadigmic discipline with a strong eurocentricity that has only recently been challenged.” Comment. "
		},
		{
			"Year":"2018",
			"Question":"5(b) Discuss the degree of importance of transportation costs as a factor of industrial location with respect to “footloose industries”. "
		},
		{
			"Year":"2018",
			"Question":"5(c) Explain the concepts of “megalopolis” and “exopolis” with regard to the growth of cities indicating whether the two can and do overlap. "
		},
		{
			"Year":"2018",
			"Question":"5(d) Write a note on “forward and backward linkages” in Perroux's thesis of economic growth and regional development. "
		},
		{
			"Year":"2018",
			"Question":"5(e) Outline briefly the “age of mass consumption” as described by Rostow in his „multi-stage theory of growth."
		},
		{
			"Year":"2018",
			"Question":"6 (a) “Areal differentiation has provided the theoretical justification for studying „regions and regional geography. Comment. "
		},
		{
			"Year":"2018",
			"Question":"6(b) Citing examples from Asia and Europe, comment upon the contexts within which pronatalist population policies are advanced what could be the implications of these policies on women's workforce participation. "
		},
		{
			"Year":"2018",
			"Question":"6(c) Comment upon the contributions of D.M Smith in outlining „welfare as a key focus in the geographies of social well-being."
		},
		{
			"Year":"2018",
			"Question":"7 (a) “Famine is a social phenomena rooted in institutional and political economic arrangements, which determine access to food by different classes and strata.” Comment. "
		},
		{
			"Year":"2018",
			"Question":"7(b) Provide a brief outline of ideas related to “sense of place” as propounded by Yi-Fu Tuan and Relph in humanistic geography that emerged in the 1970's. "
		},
		{
			"Year":"2018",
			"Question":"7(c) Elaborate upon the influence of Marxist philosophy on geographical research outlining key theme addressed by Marxist geographers since the 1970's."
		},
		{
			"Year":"2018",
			"Question":"8 (a) “Welfare geography emphasizes spatial inequality and territorial justice.” Comment with reference to the main ideas and scope of the subfield. "
		},
		{
			"Year":"2018",
			"Question":"8(b) Discuss critically the manner in which quantitative revolution provided the methodological foundation for models and modeling in geography. "
		},
		{
			"Year":"2018",
			"Question":"8(c) Discuss in brief the main thesis in “Limits to Growth” (1972) and also provide a critique of the same."
		},
		{
			"Year":"2018",
			"Question":"1b) Explain the unusual intensity of dust storms and thunderstorms across India in the pre-monsoon period of year 2018."
		},
		{
			"Year":"2018",
			"Question":"1c) Why setting up of Water Management Boards is a controversial issue in India."
		},
		{
			"Year":"2018",
			"Question":"1d) Keeping the recent developments in view, how can the energy crisis of India be circumvented by harnessing non conconventional energy resources?"
		},
		{
			"Year":"2018",
			"Question":"2 a) Distinguish the geographical aspects of North-Western lava plateau and Chotanagpur Plateau of Peninsular India."
		},
		{
			"Year":"2018",
			"Question":"2b) Explain the contemporary agricultural scenario in the context of rapid urbanizations in India."
		},
		{
			"Year":"2018",
			"Question":"2c) Assess the suitability of Special Economic Zones (SEZs) for the sustainable economic development in India."
		},
		{
			"Year":"2018",
			"Question":"3 a) Examine the ongoing process of agricultural diversification and its implications for food security in India."
		},
		{
			"Year":"2018",
			"Question":"3b) Account for the persisting negative trade balance of India."
		},
		{
			"Year":"2018",
			"Question":"3c) Critically assess the vanishing ethnic linguistic plurality of India."
		},
		{
			"Year":"2018",
			"Question":"4 a) Examine the driving forces of changing urban morphology of millionplus cities of India with suitable examples."
		},
		{
			"Year":"2018",
			"Question":"4b) Discuss the emerging geo-political scenario of Indian Ocean realm."
		},
		{
			"Year":"2018",
			"Question":"4c) Give a critical account of region specific constraints of sustainable tourisms in India."
		},
		{
			"Year":"2018",
			"Question":"5a) Discuss the socio-economic problems associates with the left behind families of international migrants from India."
		},
		{
			"Year":"2018",
			"Question":"5b) Explain the changing river courses and their impacts on the riparian population in India with suitable examples."
		},
		{
			"Year":"2018",
			"Question":"5c) Make a critical appraisal of the factors affecting river water quality in India."
		},
		{
			"Year":"2018",
			"Question":"5d) Examine the role of people’s participation in successful decentralized planning in India."
		},
		{
			"Year":"2018",
			"Question":"5e) Describe the socio-spatial consequences of the recent Nipah viral encephalitis in India."
		},
		{
			"Year":"2018",
			"Question":"6 a) Illustrate with suitable examples the endeavours undertaken in augmenting conservation of water and vegetation in India."
		},
		{
			"Year":"2018",
			"Question":"6b) Discuss the strategies of integrated development of island territories in India."
		},
		{
			"Year":"2018",
			"Question":"6c) Cross border terrorism has implications on border area development in India. Examine it with suitable examples."
		},
		{
			"Year":"2018",
			"Question":"7 a) Explain the pipeline network across India and its impact on regional development."
		},
		{
			"Year":"2018",
			"Question":"7b) Discuss the changing composition of international trade through major seaports of India."
		},
		{
			"Year":"2018",
			"Question":"7c) Peri-urbanization has created enormous environmental problems. Discuss their causes and consequences with reference to the National Capital Region (N.C.R) of India."
		},
		{
			"Year":"2018",
			"Question":"8 a) Describe the changing regional morphology of rural settlements in India."
		},
		{
			"Year":"2018",
			"Question":"8b) Startups may play important role in giving fillip to economic growth in India. Illustrate with examples."
		},
		{
			"Year":"2018",
			"Question":"8c) Is the land boundary of India with its neighbouring countries a cultural divide or divided culture? Explain with suitable examples."
		}



	]
