
	[
		
		{
			"Year":"1979",
			"Question":"1.a. \"Both the community of property and the community of families.-tend to make them truly guardians.\" (PLATO)"
		},
		{
			"Year":"1979",
			"Question":"1.b. \"Since then some men are slaves is advantageous to any one, then it is just to mike him a slave.\" (ARISTOTLE)"
		},
		{
			"Year":"1979",
			"Question":"1.c. \"...and in the actions of men and especially of princes, from which there is co appeal the end justifies the means.” (MACHIAVELLI)"
		},
		{
			"Year":"1979",
			"Question":"1.d. \"Whoever refuses to obey the General Will... will be forced to be free.” (ROUSSEAU)"
		},
		{
			"Year":"1979",
			"Question":"1.e. \"We must therefore worship the State as the manifestation of the Divine on earth.\" (HEGEL)"
		},
		{
			"Year":"1979",
			"Question":"1.f. \"The only freedom that deserves the name is that of pursuing our own good, in our own way.\" (J. S. MILL)"
		},
		{
			"Year":"1979",
			"Question":"1.g. \"Will, not force, is the basis of the State.\" (T. H. GRBSN)"
		},
		{
			"Year":"1979",
			"Question":"1.h. \"The history of all hitherto existing societies is the history of class-struggles.\" (MARX)"
		},
		{
			"Year":"1979",
			"Question":"2. (a) \"Behaviouralism is a subtle defence of the status quo.”"
		},
		{
			"Year":"1979",
			"Question":"2 (b) \"Behaviouralism has revolutionised Political Science.\" Comment"
		},
		{
			"Year":"1979",
			"Question":"3. The world would be a much better place if the concept of national sovereignty is given up. Do you agree? Give reasons for your answer."
		},
		{
			"Year":"1979",
			"Question":"4. Attempt a critique of the right to resist the State and bring out the place of revolution in a democratic State. Or \"Liberty and Equality are the two contradictory concepts equally dear to the human mind. Comment."
		},
		{
			"Year":"1979",
			"Question":"5. \"There is no theory of Democracy; it is at best a workable compromise between competing and conflicting interests.\" Elucidate."
		},
		{
			"Year":"1979",
			"Question":"6. What is Fabian Socialism? How does it differ from Scientific Socialism?"
		},
		{
			"Year":"1979",
			"Question":"7. Make a critical and comparative assessment of the structural-functional approach and the Marxian approach."
		},
		{
			"Year":"1979",
			"Question":"8. \"Political socialization is the process of induction into Political Culture.\" Elucidate and bring out the role played by the modern State in the process."
		},
		{
			"Year":"1979",
			"Question":"9. Account for the two trends - secular and religious - in the evolution of Indian nationalism. Or Explain the influence of British constitutionalism on the Indian Constitution."
		},
		{
			"Year":"1979",
			"Question":"10. \"The Indian federation is a heavily-centered one; but the States are not mere provinces.\" Comment."
		},
		{
			"Year":"1979",
			"Question":"11. \"The Indian bureaucracy still exhibits British orientations in its thought, action and behaviour.\" Justify the statement."
		},
		{
			"Year":"1979",
			"Question":"12. \"India has parties but no party-system.\" Discuss. Or \"Secularization of Indian politics is a myth; caste is the determinant of Indian politics.\" Comment."
		},
		{
			"Year":"1979",
			"Question":"13.a. \"Over the decades, the primary objective of India's foreign policy has been the creation of a stable inner balance on the subcontinent in which India, as the Principal Power, would play an integrative role.\" Examine the statement."
		},
		{
			"Year":"1979",
			"Question":"13.b. \"After the Chinese aggression (1962) some of the most significant changes in Indian foreign policy took place. However, they were changes within the overall framework of continuity.\" Elucidate."
		},
		{
			"Year":"1979",
			"Question":"14. Discuss the chief characteristics of the systems approach with special reference to Kaplan and explain its impact on the development of International Relations."
		},
		{
			"Year":"1979",
			"Question":"15. \"National interest is the key concept in foreign policy. In essence, it amounts to the sum total of all national value\" (Frankel) Explain."
		},
		{
			"Year":"1979",
			"Question":"16. The balance of power and policies aiming at its preservation are not only inevitable but are an essential stabilizing factor in a society of sovereign nations.” (Morgenthau). Comment"
		},
		{
			"Year":"1979",
			"Question":"17. \"International law undoubtedly functions as a regulatory and limiting mechanism in international politics but only in an intermittent and partially effective fashion- it large measure this incomplete effect is due to certain key characteristics of international law as a legal system.\" Examine this statement."
		},
		{
			"Year":"1979",
			"Question":"18. \"The non-aligned movement has made fundamental contributions to the theory and practice of international relations, and considerably modified the character of both.\" Discuss."
		},
		{
			"Year":"1979",
			"Question":"19. Write an essay on the compulsions of a new international Economic Order."
		},
		{
			"Year":"1979",
			"Question":"20. \"The Cold War arose because the leaders of American public opinion could not accept the chief consequences of World War II.\" (D. F. Fleming). Do you agree with this view? Give reasons for your answer."
		},
		{
			"Year":"1979",
			"Question":"21. Write a brief essay on the achievements of the United Nations in the social and economic fields."
		},
		{
			"Year":"1979",
			"Question":"22. \"The theory of 'power vacuum' is at the root of much of the foreign activity in the Indian Ocean and its littoral.\" Explain this statement."
		},
		{
			"Year":"1979",
			"Question":"23. Examine the main issues in the West Asian crisis. What efforts have been recently made by America to resolve them and with what success?"
		},
		{
			"Year":"1979",
			"Question":"24. \"The modest progress thus far made toward arms control arises only partly because the possession of arms threatens international stability. In fact, the two principal competitors take the opposite view, namely, that mutual deterrence is the guardian of international peace and security... The goal is not peace through disarmament; it is peace through controlled, but precarious, mutual deterrence.\" In the light of this statement examine the progress made since 1963 in nuclear arms control."
		},
		{
			"Year":"1979",
			"Question":"25. Which are the effective types of foreign aid? Examine the role of foreign aid as instruments of foreign policy. Give illustrations."
		},
		{
			"Year":"1980",
			"Question":"1(a) The State is the individual writ large (Plato)."
		},
		{
			"Year":"1980",
			"Question":"1(b) The State is prior to the individual (Aristotle)."
		},
		{
			"Year":"1980",
			"Question":"1(c) Where there is no common power, there is no law, where there is no law, no injustice (HOBBES)."
		},
		{
			"Year":"1980",
			"Question":"2. What makes the will general is less the number of voters than the common interest uniting them (Rousseau)."
		},
		{
			"Year":"1980",
			"Question":"3. Nature has placed mankind under the governance of two sovereign masters, pain and pleasure (Bentham)."
		},
		{
			"Year":"1980",
			"Question":"4. Over himself, over his own body and mind, the individual is sovereign (J S Mill)."
		},
		{
			"Year":"1980",
			"Question":"5. Nothing but external acts can be matters of obligation (T H Green)."
		},
		{
			"Year":"1980",
			"Question":"6. While the State exists, there is no freedom, when there will be freedom, there will be no State (Lenin)"
		},
		{
			"Year":"1980",
			"Question":"7. What is a political system? How does the Systems approach to politics add to our understanding?"
		},
		{
			"Year":"1980",
			"Question":"8. The individual has but one right, the right of equal freedom with everybody else; and the State has but one duty, the duty of protecting that right against fraud and violence. Discuss."
		},
		{
			"Year":"1980",
			"Question":"9. Law is not a mystic mandate of reason or nature, but simply the fiat of that authority to which the members of the polity render habitual obedience. Examine the statement."
		},
		{
			"Year":"1980",
			"Question":"10. Carefully explain the Marxian Theory of Social Development and determine the extent to which it has been outdated and out-moded by recent developments."
		},
		{
			"Year":"1980",
			"Question":"11. Freedom, justice and good government need not necessarily be identified with the rule of the majority. Critically assess the statement."
		},
		{
			"Year":"1980",
			"Question":"12. While majorities have an inherent right to rule, the minorities have an equally solemn right to be heard. Comment and estimate the extent to which the principal forms of minority representation fulfil their purposes."
		},
		{
			"Year":"1980",
			"Question":"13. What is the constitutional significance of Judical Review? What measures would you suggest to secure the independence of the judiciary? Give their rationale."
		},
		{
			"Year":"1980",
			"Question":"14. The Indian Constitution is a hotch-potch of indiscriminate borrowings from abroad; there is nothing Indian in it. Discuss."
		},
		{
			"Year":"1980",
			"Question":"15. Is there a case for substituting the Presidential for he Parliamentary form of government in India?"
		},
		{
			"Year":"1980",
			"Question":"16. Discuss the nature and causes of regionalism in India and its implications for national harmony and unity."
		},
		{
			"Year":"1980",
			"Question":"17. The Indian desire to emerge as the pre-eminent power in the sub-continent … And to preserve the South Asian status quo has led Indian policy-makers to evolve a strategy of minimising external great power involvement in the region. Examine this statement with special reference to Indias foreign policy since 1971. Or In the case of developing countries like India, rapid economic development being the central objective, …Economic considerations naturally become significant determinants of… Foreign policy.In the light of this statement discuss the economic bases of Indias foreign policy.1. We have insisted that foreign policy-making is most fruitfully analysed as decisionmaking in an organizational context (Snyder et al). Examine."
		},
		{
			"Year":"1980",
			"Question":"18. Consciously taking refuge in an ideological Utopia, states have given the conduct of international political relations a measure of tension, danger and potential explosiveness that has no parallel in history. The secular rationalism of contemporary ideologies has moved superstition from the realm of religion to the arena of politics. Discuss."
		},
		{
			"Year":"1980",
			"Question":"19. The evolving international system and the communications aspect of it, is well exemplified by the twentieth century changes in diplomacy. Elucidate."
		},
		{
			"Year":"1980",
			"Question":"20. State the main recommendations of the Willy Brandt Commission Report. What are its shortcomings from the point of view of the developing countries?"
		},
		{
			"Year":"1980",
			"Question":"21. It would be wrong to say that modern imperialism would have been possible without colonies. And yet the end of colonialism by no means signifies the end of imperialism. Explain and comment."
		},
		{
			"Year":"1980",
			"Question":"22. In what important respects has the emergence of nuclear power fundamentally altered the nature of International relations?"
		},
		{
			"Year":"1980",
			"Question":"23. Explain the term detente. Discuss the factors determining its progress in the context of the Soviet-American relations since 1963."
		},
		{
			"Year":"1980",
			"Question":"24. State the impact of the new nations of Asia and Africa on contemporary international relations."
		},
		{
			"Year":"1980",
			"Question":"25. A basic postulate of Pakistans foreign policy since the beginning has been to defend itself against the perceived threat to its security from India. Amplify this statement."
		},
		{
			"Year":"1980",
			"Question":"26. Chinas international position was totally transformed between 1969 and 1972. Discuss the causes and consequences of this transformation."
		},
		{
			"Year":"1981",
			"Question":"1(a). Until philosophers are kings, or the kings and princes of the world have the spirit and power of philosophy, critics will never have rest from their evils, no, nor the human race (Plato)."
		},
		{
			"Year":"1981",
			"Question":"1(b). Some men are by nature free, and others slave (Aristotle)."
		},
		{
			"Year":"1981",
			"Question":"1(c). Nature has placed mankind under the governance of two sovereign masters, pain and pleasure (Bentham)."
		},
		{
			"Year":"1981",
			"Question":"1(d). Leninism is Marxism of the era of imperialist wars and protelarian revolution (Stalin)."
		},
		{
			"Year":"1981",
			"Question":"2. How far and in what respects is behaviouralism an improvement upon the traditional approach to the study of politics? Account for the post behavioural revolution."
		},
		{
			"Year":"1981",
			"Question":"3. Account for the reaction against the Austinian concept of sovereignty. Should it be expunged from the vocabulary of political science? Give reasons."
		},
		{
			"Year":"1981",
			"Question":"4. Social justice is not reconcilable with the right to property. Comment"
		},
		{
			"Year":"1981",
			"Question":"5(a). India has political parties but no party system"
		},
		{
			"Year":"1981",
			"Question":"5(b). The Slates are, under the constitution, no better or different from glorified municipalities."
		},
		{
			"Year":"1981",
			"Question":"5(c). Secularism is only a half-realized ideal in India."
		},
		{
			"Year":"1981",
			"Question":"5(d). Gokhale was a moderate but Tilak was an extremist."
		},
		{
			"Year":"1981",
			"Question":"6. How far and in what ways have Casteism and Regionalism adversely affected the process of political socialization and development in India?"
		},
		{
			"Year":"1981",
			"Question":"7. The emphasis in the Indian Constitution is on the authority of the State rather on the liberty of the individual. Discuss with reference to the nature and scope of the rights guaranteed to the Indian citizens."
		},
		{
			"Year":"1981",
			"Question":"8. The powers and influence of the Cabinet have increased, are increasing and ought to be diminished. Discuss."
		},
		{
			"Year":"1981",
			"Question":"9. Discuss the role of geography as a basic determinant of Indias foreign policy. Or Examine the important changes that have taken place in Indias strategic environment in recent years and discuss their implications for its foreign policy."
		},
		{
			"Year":"1981",
			"Question":"10(a). The individuals-as-actors approach to inter national politics."
		},
		{
			"Year":"1981",
			"Question":"10(b). Open diplomacy."
		},
		{
			"Year":"1981",
			"Question":"10(c). The Brezhnev Doctrine (1968)."
		},
		{
			"Year":"1981",
			"Question":"10(d). Iran-Iraq war"
		},
		{
			"Year":"1981",
			"Question":"11. [The] theoretical concern with human nature as it actually is, and with the historic processes as they actually take place, has earned for the theory… The name of realism (Hans J. Morgenthan) In the light of this statement examine Morgenthans realist theory of international politics."
		},
		{
			"Year":"1981",
			"Question":"12. International law functions… As an institutional device for communicating to the policy makers of various states a consensus on the nature of the international system. Elucidate."
		},
		{
			"Year":"1981",
			"Question":"13. One of the main objectives of the non-alignment movement in the economic sphere in recent years has been to work for the achievement of a New International Economic Order. Discuss."
		},
		{
			"Year":"1981",
			"Question":"14. Discuss the significance of the recent developments in Afghanistan from a global perspective, regional considerations and the point of view of Indias foreign policy."
		},
		{
			"Year":"1981",
			"Question":"15. Examine the impact of the economics and politics of oil on international relations with special reference to the developing countries"
		},
		{
			"Year":"1981",
			"Question":"16. Examine briefly the various stages in the evolution of the policy of the United States of America towards South East Asia after 1954"
		},
		{
			"Year":"1982",
			"Question":"1(a). Only the man who has a taste for every sort of knowledge and throws himself into acquiring it with all insatiable curiosity will deserve to be called a philosopher (Plato)."
		},
		{
			"Year":"1982",
			"Question":"1(b). The prince must be a fox, therefore to recognise the traps and a lion to frighten the wolves (Machiavelli)."
		},
		{
			"Year":"1982",
			"Question":"1(c). As much as any one can make use of any advantage of life before it spoils, so much he may by his labour fix a property in; wherever is beyond this, more than"
		},
		{
			"Year":"1982",
			"Question":"1(d). A people of savages should be taught obedience but not in such a manner as to convert them into a people of salves (J S Mill)."
		},
		{
			"Year":"1982",
			"Question":"2. What is political analysis? Explain the systems theory and Marxist approach to political analysis?"
		},
		{
			"Year":"1982",
			"Question":"3. Critically examine the general and characteristic properties of State with particular reference to the recent debate on the notions of state and concept of power."
		},
		{
			"Year":"1982",
			"Question":"4. The theory of class war is the heart and soul of Communist ideology Comment"
		},
		{
			"Year":"1982",
			"Question":"5(a). India is not a federation but a Union."
		},
		{
			"Year":"1982",
			"Question":"5(b). The chapter on Fundamental Rights is part of the basic structure of the Constitution, more, it is the very soul of the document."
		},
		{
			"Year":"1982",
			"Question":"5(c). The pressure groups of India are only in part the spontaneous and independent results of felt needs among occupational caste groups."
		},
		{
			"Year":"1982",
			"Question":"5(d). An independent Judiciary, having the power of Judicial Review is a prominent feature of the Indian Constitution"
		},
		{
			"Year":"1982",
			"Question":"6. Discuss the merits and demerits of Presidential system of government and argue for and against its introduction in India."
		},
		{
			"Year":"1982",
			"Question":"7. Examine the extent to which the politics of regionalism in India could be viewed as the consequence of the process of political modernisation."
		},
		{
			"Year":"1982",
			"Question":"8. A little socialism is written into our (Indian) Constitution and some more has gone into it by way of amendments. Comment"
		},
		{
			"Year":"1982",
			"Question":"9. Nehru’s concept of non-alignment bad an implicit security rationale The purpose of the policy was not merely one steering clear of military blocs for moral reasons, but also one of maneuvering among the great powers for security reasons. Discuss. Or The political tradition, particularly the recent one, of any country is an important determinant of its foreign policy, and more so in the case of a country like India which has become newly independent, through a powerful nationalist movement, after a long period of colonial rule. Examine those special aspects of the Indian national awekening which had a direct bearing on the formulation of Indias foreign policy "
		},
		{
			"Year":"1982",
			"Question":"10(a). International Relations and International politics."
		},
		{
			"Year":"1982",
			"Question":"10(b). Uniting for Peace Resolution."
		},
		{
			"Year":"1982",
			"Question":"10(c). Old Diplomacy."
		},
		{
			"Year":"1982",
			"Question":"10(d). Indo-Soviet Treaty, 1971"
		},
		{
			"Year":"1982",
			"Question":"11. Discuss the basic assumptions underlying the theory of balance of power and examine its relevance in the nuclear age."
		},
		{
			"Year":"1982",
			"Question":"12. in order to make clear the distinction between international law and international relations, it must suffice to underline that international law is law, and no more than law; and that it is a law applying between states viewed not in their entirely but simply in the formal external aspects custom has led them to wear. Elucidate."
		},
		{
			"Year":"1982",
			"Question":"13. The concept of the national interest presupposes neither a naturally harmonious, peaceful world nor the inevitability of war as a consequence of the persuit by all nations of their national interest. Quite to the contrary, it assumes continuous conflict and threat of war, to be minimized through the continuous adjustment of conflicting interests by diplomatic action. Examine this statement."
		},
		{
			"Year":"1982",
			"Question":"14. the concept of peace zone is inherent in the concept of non-alignment (U. N. General Assembly Resolution, 1971). In the light of this statement discuss the peace-Zone aspect of the politics of the Indian Ocean area."
		},
		{
			"Year":"1982",
			"Question":"15. The character of Chinese foreign policy is determined by elements of nationalism, ideology, and traditional Chinese thought, Discuss."
		},
		{
			"Year":"1982",
			"Question":"16. a policy of foreign and is no different from diplomatic or military policy or propaganda. They are all weapons in the political armoury of the nation. Explain."
		},
		{
			"Year":"1983",
			"Question":"1(a). Indeed it is generally true that it is a difficult business for men to live together and to be partners in any form of human activity, but it is specially difficult to do so when property is involved (Aristotle)."
		},
		{
			"Year":"1983",
			"Question":"1(b). A wise prince then seeks advice continually but when it suits him and not when it suits somebody else (Machiavelli)."
		},
		{
			"Year":"1983",
			"Question":"1(c). A strong and healthy constitution is the first thing to look for; and it is better to count on the vigour which comes of good government than on the resources a great territory furnishes (Rousseau)."
		},
		{
			"Year":"1983",
			"Question":"1(d). During the lifetime of great revolutionaries the oppressing classes have visited relentless persecution on them and received their teaching with the most savage hostility, the most furious hatred, the most ruthless campaign of lies and slanders (Lenin)."
		},
		{
			"Year":"1983",
			"Question":"2. Give a critical account of Kautilyas political ideas and examine their relevance to the contemporary ideas of government and politics."
		},
		{
			"Year":"1983",
			"Question":"3. The newer currents in political science are more accurately perceived as the recovery of a great tradition than as a radical deviation from it. Comment"
		},
		{
			"Year":"1983",
			"Question":"4. Democracy is a theory of society as well as a theory of government. Discuss."
		},
		{
			"Year":"1983",
			"Question":"5(a). The linchpin of the Indian political system is the Prime Minister"
		},
		{
			"Year":"1983",
			"Question":"(5b). The goal envisaged by the Indian Constitution is that of a Welfare State and the establishment of a Socialist State."
		},
		{
			"Year":"1983",
			"Question":"5(c). Community and caste still threaten social harmony and political peace (in India)."
		},
		{
			"Year":"1983",
			"Question":"5(d). The States are allotted a subordinate position in the Indian Union by the Constitution."
		},
		{
			"Year":"1983",
			"Question":"6. Discuss in the light of electoral politics in the Indian States the factors which prevent a healthy growth of a two-party system."
		},
		{
			"Year":"1983",
			"Question":"7. Explain the basic assumptions of Gandhian planning and discuss whether it would help India to achieve economic prosperity."
		},
		{
			"Year":"1983",
			"Question":"8. Describe the organisation and progress of Panchayati Raj institutions in India and examine the extent to which they serve as instruments of rural reconstruction and rural development."
		},
		{
			"Year":"1983",
			"Question":"9(a). NPT (Non-Proliferation Treaty) is not discriminatory."
		},
		{
			"Year":"1983",
			"Question":"9(b). The attitude of any two South Asian countries to the Indian Ocean being made a zone of peace."
		},
		{
			"Year":"1983",
			"Question":"9(c). The Lebanon crisis."
		},
		{
			"Year":"1983",
			"Question":"9(d). The significance of South Asian Foreign Ministers meeting."
		},
		{
			"Year":"1983",
			"Question":"10. The concept of power is so clusive and yet so central to the study of international relations. Never before in human history has power been so imposing and yet to important as it has been since the development of nuclear weapons. In the light of these statements, evaluate the utility of the concept of power for the understanding of international relations."
		},
		{
			"Year":"1983",
			"Question":"11. The systems theory as developed by Morton Kaplan for the study of international relations lacks some of the essential characteristics of the systems perspective. Discuss whether and, if so, how far this statement is correct."
		},
		{
			"Year":"1983",
			"Question":"12. However grand its declared objectives, the United Nations by its very structure is illequipped to bring about an international order based on peace and justice. Examine whether and, if so, how far this statement is correct."
		},
		{
			"Year":"1983",
			"Question":"13(a). The achievements and failures of the Seventh Non-Aligned Summit."
		},
		{
			"Year":"1983",
			"Question":"13(b). The role of EEC in international relations."
		},
		{
			"Year":"1983",
			"Question":"13(c). Certain resources being the common heritage of mankind."
		},
		{
			"Year":"1983",
			"Question":"13(d). The International Court of Justice."
		},
		{
			"Year":"1983",
			"Question":"14. The foreign policy of a country is merely the extension of its domestic politics. Discuss this statement and examine whether and, if so, how far the shifts in Indian foreign policy during 1970S and 1980S can be understood in terms of changes in Indias domestic environment."
		},
		{
			"Year":"1983",
			"Question":"15. Discuss the part played by cultural imperialism and economic aid as instruments of external intervention."
		},
		{
			"Year":"1983",
			"Question":"16. Clearly indicate the meaning of the term Third World and distinguish it from the First, the Second and the Non-Aligned Worlds. In this context, discuss the goals of Third World diplomacy and the extent to which it has succeeded in achieving these goals"
		},
		{
			"Year":"1984",
			"Question":"1(a). If a State is constituted on natural principles, the wisdom it possesses as a whole will be due to the knowledge residing in the smallest part, the one which takes the lead and governs the rest (Plato)."
		},
		{
			"Year":"1984",
			"Question":"1(b). Life in a communityenables man… … To achieve a plentitude of life: Nor merely to exist, but to live fully, with all that is necessary to well-being (St. Thomas Aquinas)."
		},
		{
			"Year":"1984",
			"Question":"1(c). Though nothing can be immortal which mortals make, yet, if men had use of reason they pretend to, their commonwealth might be secured at least from perishing by internal disease (Thomas Hobbes)."
		},
		{
			"Year":"1984",
			"Question":"1(d). To define freedom of the press as freedom to say and write whatever we please is parallel to the assertion that freedom as such means freedom to do as we please (Hegel)."
		},
		{
			"Year":"1984",
			"Question":"2. Discuss the problems of contemporary liberalism as they are manifested in its theory of democracy."
		},
		{
			"Year":"1984",
			"Question":"3. Briefly discuss the nature and scope of Political Science and examine the extent to which it can be regarded as a science or only as a technique for the successful acquisition and exercise of power."
		},
		{
			"Year":"1984",
			"Question":"4. Give a critical account of Marxist and Maoist conceptions of revolution and bring out the nature of their relationship to the earlier theories of revolution."
		},
		{
			"Year":"1984",
			"Question":"5(a). The Indian Parliament is not a sovereign legislature. It has vast but not unlimited powers."
		},
		{
			"Year":"1984",
			"Question":"5(b). The right to property had proved to be the most controversial of the fundamental rights."
		},
		{
			"Year":"1984",
			"Question":"5(c). Satyagraba is the most important and original contribution of Mahatma Gandhi to mankind."
		},
		{
			"Year":"1984",
			"Question":"5(d). The jurisdiction and powers of the Supreme Court of India are in their nature and extent wider than those exercised by the highest Court of any other country."
		},
		{
			"Year":"1984",
			"Question":"6. Comment on the view that the study of comparative politics and government has become parochial and descriptive rather than systematic and universal."
		},
		{
			"Year":"1984",
			"Question":"7. Examine the main trends of the Indian party system since 1969 and discuss the phenomenon of defections and its implications for the working of the Indian political system."
		},
		{
			"Year":"1984",
			"Question":"8. Discuss in general and with suitable examples the part played towards modernization of Afro-Asian societies by the leadership of those societies during the second half of the twentieth century"
		},
		{
			"Year":"1984",
			"Question":"9(a). Ideology hardly plays any role in foreign policy."
		},
		{
			"Year":"1984",
			"Question":"9(b). The impact of Summit diplomacy."
		},
		{
			"Year":"1984",
			"Question":"9(c). The meaning and significance of neocolonialism."
		},
		{
			"Year":"1984",
			"Question":"9(d). Distinction between arms control and disarmament."
		},
		{
			"Year":"1984",
			"Question":"10. The nature of the sovereign Nation-State system underwent fundamental changes with the advent of the nuclear weapons system. Despite the emergence of nuclear weapons and the over-kill capacity of the superpowers, the sovereign Nation-State system continues to retain its essential characteristics In either of the above statements a correct assessment of the international system and if so, to what extent?"
		},
		{
			"Year":"1984",
			"Question":"11. The decision-making approach to the study of international relations as developed by Snyder, Bruck and Spain (SBS) cannot be considered as a serious tool of analysis. Examine this view and discuss the important refinements which have been made in the decisionmaking approach since the SBS model was first developed."
		},
		{
			"Year":"1984",
			"Question":"12. Both because of its structure and its strategy, the Non-Aligned Movement is unlikely to be able to achieve a new international economic order Critically examine this statement and indicate the extent of the success of the Non-Aligned Movement in modifying the international economic system."
		},
		{
			"Year":"1984",
			"Question":"13(a). Distinction between First, Second and Third Worlds."
		},
		{
			"Year":"1984",
			"Question":"13(b). South Asian Regional Co-operation is essentially a mirage."
		},
		{
			"Year":"1984",
			"Question":"13(c). The tension around the issue of Diego Garcia."
		},
		{
			"Year":"1984",
			"Question":"13(d). PNE."
		},
		{
			"Year":"1984",
			"Question":"14. The foreign policy of a country is determined more by the external environment than by domestic factors. Discuss in depth the validity of this statement in the context of the foreign policy of the United States during the nineteen seventies and early eighties."
		},
		{
			"Year":"1984",
			"Question":"15. It is paradoxical that while India claims to be a peace-loving country, it has managed to develop conflict and tensions with almost all its neighbours. Evaluate this statement and critically explain this paradox."
		},
		{
			"Year":"1984",
			"Question":"16. Examine Chinese foreign policy after the death of Mao with due reference to the shifts, if any, that have occurred since then. "
		},
		{
			"Year":"1985",
			"Question":"1(a). There will be no end to the troubles of states, or indeed of humanity itself, till political power and philosophy come into the same hands, while the many nations now content to follow either to the exclusion of the other are forcibly debarred from doing so (Plato)."
		},
		{
			"Year":"1985",
			"Question":"1(b). I have resolved to open a new route, which has not yet been followed by anyone (Machiavelli)."
		},
		{
			"Year":"1985",
			"Question":"1(c). The great and chief end of Mens uniting into Commonwealths and putting themselves under Government, is the Preservation of their Property (Locke)"
		},
		{
			"Year":"1985",
			"Question":"1(d). A1l the philosophers have attempted to reach back to the state of nature but none of them has ever got there (Rousseau)."
		},
		{
			"Year":"1985",
			"Question":"2. Discuss the Marxist approach to the study of politics with particular reference to the development of Political Science as a discipline in recent years."
		},
		{
			"Year":"1985",
			"Question":"3. Critically analyse the current State of the theory of Liberalism with specific reference to its concepts of Liberty, Democracy and Justice."
		},
		{
			"Year":"1985",
			"Question":"4. Describe the nature of the modern State and discuss the problems it has to face from centrifugal forces to its authority and legitimacy."
		},
		{
			"Year":"1985",
			"Question":"5(a). In a party, it is far from obvious that the interests of the masses which have combined to form the party will coincide with the interests of the bureaucracy in which the party becomes personified (Michels)."
		},
		{
			"Year":"1985",
			"Question":"5(b). Ramarajya of my dream ensures the rights alke of prince and pauper (Gandhi),"
		},
		{
			"Year":"1985",
			"Question":"5(c). We have to admit that, under present circumstances, and so long as our policies are dominated by middle class elements, we cannot do away with communalism altogether (Nehru 1936)."
		},
		{
			"Year":"1985",
			"Question":"5(d). In no sphere of public activity in our country since Independence the hiatus between precept and practice, between policy pronouncements and actual execution, has been so great as in the domain of land reforms (Task Force on Agrarian Relations 1973)."
		},
		{
			"Year":"1985",
			"Question":"6. Write a critical note on the more important theories and approaches in the field of comparative politics in terms of their contribution to the understanding of the nonwestern political process."
		},
		{
			"Year":"1985",
			"Question":"7. Discuss the problem of Centre-State relations in India and its possible future development, clearly indicating bow in your opinion it can be constructively handled."
		},
		{
			"Year":"1985",
			"Question":"8. Democracy has not enabled the majority of poor people of grasp, and organized themselves utilizing, political power to advance their own interests (Gunnar Myrdal). Examine this statement and give your own analysis and assessment of the nature and outcome of the Indian experiment in democracy."
		},
		{
			"Year":"1985",
			"Question":"9(a). Colonialism as a phenomenon died after the 1960S."
		},
		{
			"Year":"1985",
			"Question":"9(b). National interest is what the political elite of the country think it to be."
		},
		{
			"Year":"1985",
			"Question":"9(c). The role of the ASEAN in international system."
		},
		{
			"Year":"1985",
			"Question":"9(d). Balance of terror."
		},
		{
			"Year":"1985",
			"Question":"10. Examine the major characteristics of the present day international economic order. Which of its structural aspects have led to the demand for a new international economic order? "
		},
		{
			"Year":"1985",
			"Question":"11. Discuss in depth the causes of the development of the new cold war. In what way does it resemble or differ from the cold war of the immediate post-Second World War Period?"
		},
		{
			"Year":"1985",
			"Question":"12. The realist theory is the only useful tool of analysis for the understanding of the phenomena of international relations. The so called realist theory does not seem to be realistic. Which of these two views seems to you to be closer to truth?"
		},
		{
			"Year":"1985",
			"Question":"13(a). The meaning and significance of star war in the US foreign policy strategy."
		},
		{
			"Year":"1985",
			"Question":"13(b). The importance of Diego Garcia in American strategy."
		},
		{
			"Year":"1985",
			"Question":"13(c). The Iran-Iraq War has not ended because no one is interested in ending it."
		},
		{
			"Year":"1985",
			"Question":"13(d). The significance of Rajiv Gandhis visit to the United States in June, 985, for promoting long-term Indo-American friendship."
		},
		{
			"Year":"1985",
			"Question":"14. What, in your view, are the major objectives of Soviet foreign policy? Does the Soviet politicoeconomic system, help or hinder the achievement of these objectives?"
		},
		{
			"Year":"1985",
			"Question":"15. What are the major changes which have taken place in Indian foreign policy since the death of Nehru? Do you see any major continuities in Indian foreign policy? Account for both the changes and continuities."
		},
		{
			"Year":"1985",
			"Question":"16. Examine the difference in the usage of the concept of peaceful coexistence in Chinese, Soviet Indian foreign policy behaviour. Would you say that the Chinese usage of the term is guided more by ideological considerations?"
		},
		{
			"Year":"1986",
			"Question":"1(a). From the hour of their birth some are marked out for subjection, others for rule (Aristotle)."
		},
		{
			"Year":"1986",
			"Question":"1(b). I doubt not, but if it had been a thing contrary to any mans right of dominion, or to the interest of men that have dominion, that the three angles of a triangled should be equal to two angles of a square; that doctrine should have if not disputed, yet by the burning of all books of geometry, suppressed, as far as he whom it concerned was able (Hobbes)."
		},
		{
			"Year":"1986",
			"Question":"1(c). It was iron and corn which first civilized men, and ruined humanity (Rousseau)."
		},
		{
			"Year":"1986",
			"Question":"1(d). Nature has placed mankind under the governance of two sovereign masters, pain  and pleasure. It is for them alone to point out what we ought to do, as well as to determine what we shall do (Bentham)."
		},
		{
			"Year":"1986",
			"Question":"2. Critically examine the Behavioural and the Marxist approaches to the study of Politics."
		},
		{
			"Year":"1986",
			"Question":"3. Write a critical note on the more important developments in the theory of Democracy in recent years."
		},
		{
			"Year":"1986",
			"Question":"4. Elucidate the concepts of Liberty and Equality and examine the view that the two cannot be reconciled in the modern state."
		},
		{
			"Year":"1986",
			"Question":"5(a). The Hindu nation was born with Sanatana Dharma; with it, it moves, and with it, it grows. When, Sanatana Dharma declines then the nation declines, if Sanatana Dharma were capable of perishing with the nation, it would perish. Sanatana Dharma, that is nationalism (Aurvbindo Ghosh)."
		},
		{
			"Year":"1986",
			"Question":"5(b). Little do town dwellers know how the semi-starved masses of India are slowly sinking to lifelessness. Little do they know that their miserable comfort represents the brokerage they get for the work they do for the foreign exploiterthat the government established by law in British India is carried on for this exploitation of the masses (Gandhi, 1922)."
		},
		{
			"Year":"1986",
			"Question":"5(c). I am convinced that the only key to the solution of the worlds problems and of Indias problems lies in socialism, and when I use this word I do so not is a vague, humanitarian way, but in a scientific, economic sense (Nehru, 1936)."
		},
		{
			"Year":"1986",
			"Question":"5(d). On 26th January 1950, we are going to eater into a life of contradiction. In politics we will have equality and in social and economic rights we wilt have inequality We must remove this contradiction at the earliest possible moment or else those who suffer from inequality will blow up the structure of political democracy which this Assembly has so laboriously built up (Ambedkar)."
		},
		{
			"Year":"1986",
			"Question":"6. Critically examine the contribution of contemporary political science to the understanding of the political process in the countries of what is described as the third world."
		},
		{
			"Year":"1986",
			"Question":"7. Discuss the emerging problems of casterism, linguism, communalism and regionalism in the Indian polity, clearly indicating how, in your opinion, these problems should be understood and resolved."
		},
		{
			"Year":"1986",
			"Question":"8. a political alliance of the intermediate classes with the upper classes, resorting to socialist ideology only to win mass support but using all levers of power to facilitate a type of capitalist development in the-interest of a narrow section of Indian society (K. K R. V. Rao 1973). Examine this assessment of the working of Indian political system."
		},
		{
			"Year":"1986",
			"Question":"9(a). Open covenants openly arrived at:"
		},
		{
			"Year":"1986",
			"Question":"9(b). International law can hardly be characterised as a branch of true law."
		},
		{
			"Year":"1986",
			"Question":"9(c). Balance of power is still a basic element in international relations."
		},
		{
			"Year":"1986",
			"Question":"9(d). The basic fact of international life is the sovereign equality of all States"
		},
		{
			"Year":"1986",
			"Question":"10. Examine in detail the nature and extent of the impact of decolonization on the international system."
		},
		{
			"Year":"1986",
			"Question":"11. Examine the basic difference between arms control and disarmament. Which of these is likely to succeed? In this context briefly examine the various efforts at arms control since 1960S."
		},
		{
			"Year":"1986",
			"Question":"12. Detente was a mere myth. The cold war never ended. The new cold war is basically the reversal of a slow process of detente built so painfully by the two super Powers under pressure of so many forces. Which of the above two statements would be a correct description of international reality?"
		},
		{
			"Year":"1986",
			"Question":"13(a). American interest in South East Asia is merely to contain Soviet influence."
		},
		{
			"Year":"1986",
			"Question":"13(b). India has been making a mistake in not accepting Chinese proposals for a border settlement"
		},
		{
			"Year":"1986",
			"Question":"13(c). The West Asian conflict has defined solution despite the sincere efforts of the super powers."
		},
		{
			"Year":"1986",
			"Question":"13(d). The non aligned States and the Third World States are merely two expressions of the same phenomenon."
		},
		{
			"Year":"1986",
			"Question":"14. The foreign policy of a country is neither determined by domestic factors, nor by international environment; it is basically determined by the views of the top decisionmakers. Would you agree with this view of the foreign policy process in the United Slates?"
		},
		{
			"Year":"1986",
			"Question":"15. Examine the attitude of the nuclear weapons states to the acquisition and development of nuclear technology by Third World countries. To what extent is this attitude justified?"
		},
		{
			"Year":"1986",
			"Question":"16. India claims to be a non-aligned country but ever since 1950S it has been lilting towards the Soviet Union and against the United States. Would this be an accurate estimate of Indias policy towards the two Super Powers? "
		},
		{
			"Year":"1987",
			"Question":"1(a). … No law or ordinance is mightier than knowledge (Plato)."
		},
		{
			"Year":"1987",
			"Question":"1(b). A prince… Who desires to maintain himself must learn to be not always good, but to be so or not as necessity may require (machiavelli)."
		},
		{
			"Year":"1987",
			"Question":"1(c). It is better to be Socrates dissatisfied than a food satisfied (J S. Mill)."
		},
		{
			"Year":"1987",
			"Question":"1(d). The Communist Party is part of the working class its most progressive, most class conscious and therefore, most revolutionary part (Lenin)."
		},
		{
			"Year":"1987",
			"Question":"2. Behavioural studies are highly desirable to supplement other studies, but like all identifiable methodological approaches they are part of the whole study of Government and Politics (Charles-Worth). -Comment"
		},
		{
			"Year":"1987",
			"Question":"3. Machiavellis work to the first example of the way in which science and secularism have developed together in the western world. Discuss."
		},
		{
			"Year":"1987",
			"Question":"4. Critically examine the nature and contribution of Behavioural and post-behavioural revolutions. Is it correct to describe them as revolutions?"
		},
		{
			"Year":"1987",
			"Question":"5(a). Structural-Functional Approach"
		},
		{
			"Year":"1987",
			"Question":"5(b). Webers views on Bureaucracy"
		},
		{
			"Year":"1987",
			"Question":"5(c). Contribution of M N Roy"
		},
		{
			"Year":"1987",
			"Question":"5(d). Anti-defection Law."
		},
		{
			"Year":"1987",
			"Question":"6. Discuss the nature of one-party dominant system under Jawaharlal Nehru and Shrimati Indira Gandhi. Do y a agree with the view that it has done more harm than good to India?"
		},
		{
			"Year":"1987",
			"Question":"7. Critically examine the relationship of Preamble, Fundamental Rights and Directive Principles of State Policy as determined by the judiciary in India"
		},
		{
			"Year":"1987",
			"Question":"8. Community and caste still threaten social harmony and political peace In the light of this statement, discuss the role of caste in Indian politics today."
		},
		{
			"Year":"1987",
			"Question":"9(a). Power as coercive and non coercive elements potential."
		},
		{
			"Year":"1987",
			"Question":"9(b). Prospects for isolationism in the contemporary world."
		},
		{
			"Year":"1987",
			"Question":"9(c). Neo-colonialism."
		},
		{
			"Year":"1987",
			"Question":"9(d). OAU as an important international actor"
		},
		{
			"Year":"1987",
			"Question":"10. The term Cold War is now often used to denote the very process of east west conflict itself. Identify in this context, the salient characteristics of the Cold War of the immediate post-Second World War period."
		},
		{
			"Year":"1987",
			"Question":"11. Review the major arguments of the Third World Countries in favour of restructuring of the International Economic Order."
		},
		{
			"Year":"1987",
			"Question":"12. Diplomacy today operates in a world in which the rival blocs are rent by ideological rifts and have only limited common interest."
		},
		{
			"Year":"1987",
			"Question":"13(a). The Nuclear Non-Proliferation Treaty as a grossly discriminatory treaty."
		},
		{
			"Year":"1987",
			"Question":"13(b). The Third Worlds special place in a block divided world."
		},
		{
			"Year":"1987",
			"Question":"13(c). The North-South Dialogue."
		},
		{
			"Year":"1987",
			"Question":"13(d). Indo Soviet Relations during the Janata rule."
		},
		{
			"Year":"1987",
			"Question":"14. Explain the idea of the Indian Ocean as a Zone of Pc-ace In what ways did the Seventh Summit of the Non-Alignment Movement pursue this idea?"
		},
		{
			"Year":"1987",
			"Question":"15. The Soviet Union has long planned for this military invansion of Afghanistan. (New China News Agency.). Bring out the logic of this Chinese perception of Soviet intervention in Afghanistan."
		},
		{
			"Year":"1987",
			"Question":"16. We do not believe in the deterrent theory and (that) India would not make nuclear weapons even if Pakistan did so (Smt. Indira Gandhi). Examine Indias nuclear policy in the light of the above statement."
		},
		{
			"Year":"1988",
			"Question":"1(a). The law is reason unaffected by desire (Aristotle)."
		},
		{
			"Year":"1988",
			"Question":"1(b). It is not the priest that forgives the sin and remits the penalty to the sinner. God alone judges in these matters and the function of the priest is merely to certify the divine act. The priest is indeed the bearer of the keys of the kingdom of heaven, but he bears them in the capacity merely of turnkey-no wielder of jurisdiction but a humble serviter (Marsiglio of Padua)."
		},
		{
			"Year":"1988",
			"Question":"1(c). Wherever, therefore, any number of men so unite into one society as to quit everyone his executive power of the law of Nature and to resign it to the public, there and there only is a political or civil society (John Locke)."
		},
		{
			"Year":"1988",
			"Question":"1(d). We must go among all classes of the population as theoreticians, as propagandists, as agitators and as organisers (Lenin)."
		},
		{
			"Year":"1988",
			"Question":"2. Compare some of the leading political notions of Kautilya and Machiavelli and explain how they helped the development of the social and behavioural sciences."
		},
		{
			"Year":"1988",
			"Question":"3. Describe the nature and scope of Political Science and distinguish between the earlier and recent methodological approaches in its study."
		},
		{
			"Year":"1988",
			"Question":"4. What are the different varieties of democratic systems? How and to what extent accountably of governments and legislatures to the electorate may be regarded as the essence of democratic government?"
		},
		{
			"Year":"1988",
			"Question":"5(a). Swadeshi is that spirit in us which restricts us to the use and service of our immediate surroundings to the exclusion of the more remote (M. K. Ganddhi 1916)."
		},
		{
			"Year":"1988",
			"Question":"5(b). Terrorism is an outworn and profitless method for gaining political objectives and that it usually represents the infancy of a revolutionary urge in a country (Pandit Jawaharlal Nehru, 1935)."
		},
		{
			"Year":"1988",
			"Question":"5(c). . [In India] new tensions are bound to arise as a result of the process of socioeconomic development and modernisation and also of the compulsions of electoral polities."
		},
		{
			"Year":"1988",
			"Question":"5(d). Any member of a political majority is relatively free to make his own contribution to its political action whereas the course of politics among a communal majority is influenced only by those born into it (Dr. B. B. Ambedkar, 1955)."
		},
		{
			"Year":"1988",
			"Question":"6. Indicate the issues of tensions and conflicts in the relationship between the Centre and the States in India. How best could they be reconciled?"
		},
		{
			"Year":"1988",
			"Question":"7. Account for the emergence of regional political parties in India, Do the activities of these parties affect communal harmony and national unity?"
		},
		{
			"Year":"1988",
			"Question":"8. How does the Supreme Court of India function as the custodian of the Constitution and Protector of the rights of the citizens?"
		},
		{
			"Year":"1988",
			"Question":"9(a). Technology as an element of National Power."
		},
		{
			"Year":"1988",
			"Question":"9(b). Non-State Actors in international relations."
		},
		{
			"Year":"1988",
			"Question":"9(c). The concept of Cultural Diplomacy."
		},
		{
			"Year":"1988",
			"Question":"9(d). Role of the International Court of Justice."
		},
		{
			"Year":"1988",
			"Question":"10. What is meant, by Realism in international politics? Examine critically the principal assumptions of the Realist Theory as developed by Hans J. Morgenthau."
		},
		{
			"Year":"1988",
			"Question":"11. Define Intervention and discuss the major avenues of intervention used by powerful States in the affairs of weaker States."
		},
		{
			"Year":"1988",
			"Question":"12. Distinguish between bilateral and multilateral foreign aid in terms of their consequences for the recipient nation. In what ways can foreign aid be used as an instrument of foreign policy?"
		},
		{
			"Year":"1988",
			"Question":"13(a). Indias concern on developments in Afghanistan."
		},
		{
			"Year":"1988",
			"Question":"13(b). India and the ethnic troubles in Sri Lanka."
		},
		{
			"Year":"1988",
			"Question":"13(c). The problem of the Palestinians."
		},
		{
			"Year":"1988",
			"Question":"13(d). Prospects of a Sino-Indian Rapprochement."
		},
		{
			"Year":"1988",
			"Question":"14. Explain the factors which led to the formation of the SAARC. Is it capable of playing an effective role for regional integration? Justify your answer with reference to the initiative so far taken by the SAARC."
		},
		{
			"Year":"1988",
			"Question":"15. We are a friend not only in fair weather but also in rough weather. Comment on this statement of a distinguished Soviet leader in the light of the special relations that have developed between India and the Soviet Union."
		},
		{
			"Year":"1988",
			"Question":"16. Do you notice any major changes in the foreign policy of the Peoples Republic of China in the postMao period? Discuss in this connection the position taken by the PRC vis-a-vis the SuperPowers and the developing nations."
		},
		{
			"Year":"1989",
			"Question":"1(a). The truth is that the state in which the rulers are most reluctant to govern, is always the best and most quietly governed and the state in which they are most eager, the worst (Plato)."
		},
		{
			"Year":"1989",
			"Question":"1(b). I conclude again by saving that prince must esteem his nobles but not make himself hated by the populace (Machiavelli)."
		},
		{
			"Year":"1989",
			"Question":"1(c). Every man being born free and his own master. No one, under any pretext whatsoever, can make any man subject without his consent. To decide that the son of a slave is born a slave is to decide that he is not born a man (Rousseau)."
		},
		{
			"Year":"1989",
			"Question":"1(d). Women hold up half the heavens (Mao Zedong)."
		},
		{
			"Year":"1989",
			"Question":"2. How far it would be correct to say that the Ancient Indian political thought was concerned primarily with the art of government rather than with the problems of political philosophy?"
		},
		{
			"Year":"1989",
			"Question":"3. It would be of lasting benefit to political science if the whole concept of state sovereignty were surrendered (Laski)."
		},
		{
			"Year":"1989",
			"Question":"4. Examine the contemporary relevance of the basic tenets of Marxism-Socialism."
		},
		{
			"Year":"1989",
			"Question":"5(a). Raja Ram Mohan Ray and Social reforms"
		},
		{
			"Year":"1989",
			"Question":"5(b). Drain theory of Dadabhai Naoroji"
		},
		{
			"Year":"1989",
			"Question":"5(c). B G Tilak and Swaraj"
		},
		{
			"Year":"1989",
			"Question":"5(d). Ambedkars theory of social justice."
		},
		{
			"Year":"1989",
			"Question":"6. What are the political philosophies enshrined in the Indian Constitution. How far are they mutually reconcilable? Give reasons for your answers?"
		},
		{
			"Year":"1989",
			"Question":"7. Point out the defects in the electoral system in India and suggest suitable improvements in it, in the light of the Tarkunde Committee report."
		},
		{
			"Year":"1989",
			"Question":"8. A more rewarding approach in the problems of classification (of political institutions) would be to classify types of political systems rather than to concentrate on types of government. Examine the statement."
		},
		{
			"Year":"1989",
			"Question":"9(a). International politics is of necessity power politics."
		},
		{
			"Year":"1989",
			"Question":"9(b). Crisis in energy resources and its impact on international relations."
		},
		{
			"Year":"1989",
			"Question":"9(c). A diplomat is sent abroad to lie for his country."
		},
		{
			"Year":"1989",
			"Question":"9(d). National interest is what the rulling elite decides it is:"
		},
		{
			"Year":"1989",
			"Question":"10. Cold war is just one of the many justifications which keep the NAM going. Discuss in the light of this statement the emerging political and non-political dimensions non-alignment."
		},
		{
			"Year":"1989",
			"Question":"11. Explain the analytical design of the Decision-making theory. Does it adequately account for the external behaviour of States? Give reasons."
		},
		{
			"Year":"1989",
			"Question":"12. Discuss with illustration, role of the UN Secretary-General in the maintenance of international peace, security and cooperation."
		},
		{
			"Year":"1989",
			"Question":"13(a). The problem of Cambodia"
		},
		{
			"Year":"1989",
			"Question":"13(b). Debt problem of the Third World countries"
		},
		{
			"Year":"1989",
			"Question":"13(c). Iran-Iraq War and West Asia policy of the Super power"
		},
		{
			"Year":"1989",
			"Question":"13(d). Crisis in the relations between India and Nepal"
		},
		{
			"Year":"1989",
			"Question":"14. What principal factors are responsible for the Sino-Soviet dispute? Do you notice any prospect for better relations between the two socialist powers?"
		},
		{
			"Year":"1989",
			"Question":"15. Analyse the major developments in India-Pakistan relations since 1981. What positice indications are there now for normalisation of relations?"
		},
		{
			"Year":"1989",
			"Question":"16. Review the progress of the confidence-building measures taken by the present Soviet leadership viza-viz the western democracies and third world."
		},
		{
			"Year":"1990",
			"Question":"1(a). A social instinct is implanted mall men by nature, yet he who first founded the state was greatest of benefactors (Aristotle)"
		},
		{
			"Year":"1990",
			"Question":"1(b). In the happiness of his subjects lies the kings happiness, in their welfare his welfare (Kautilya)."
		},
		{
			"Year":"1990",
			"Question":"1(c). If there are now natural slaves, it is because formerly there were slaves against nature (Rousseau)."
		},
		{
			"Year":"1990",
			"Question":"1(d). Our epoch, the epoch of the bourgeoisie has simplified the class antagonism (The communist Manifesto)."
		},
		{
			"Year":"1990",
			"Question":"2. Political behaviour stands for both an intellectual tendency and a concrete academic movement (David Easton). Discuss."
		},
		{
			"Year":"1990",
			"Question":"4(a). Decision-Making Approach"
		},
		{
			"Year":"1990",
			"Question":"4(b). Gandhi as an Anarchist"
		},
		{
			"Year":"1990",
			"Question":"4(c). Proportional Representation"
		},
		{
			"Year":"1990",
			"Question":"4(d). Decentralised Decision-Making and Political Participation"
		},
		{
			"Year":"1990",
			"Question":"5. Examine the extend of the role of modernisation in shaping the politics of Afro-Asian States. Does it afford a common framework for competitive political studies?"
		},
		{
			"Year":"1990",
			"Question":"6. The record of the Indian judisciary in constitutional interpretation has been erratic.Comment"
		},
		{
			"Year":"1990",
			"Question":"7. Legitimisation of subnationalism is pernicious to the National Harmony Theory of Indian Nationalism. Comment."
		},
		{
			"Year":"1990",
			"Question":"8(a). Role of NAM in international relations"
		},
		{
			"Year":"1990",
			"Question":"8(b). Ideology as a determinant of foreign policy"
		},
		{
			"Year":"1990",
			"Question":"8(c). International politics is a struggle for power among nations."
		},
		{
			"Year":"1990",
			"Question":"8(d). The UN Secretary-General is more a diplomat than an administrator."
		},
		{
			"Year":"1990",
			"Question":"9. The theory of balance of power has lost it validity in the nuclear age. How for do you agree with this statement? Give reasons."
		},
		{
			"Year":"1990",
			"Question":"10. Discuss the main functions of diplomacy and examine the recent trends in the practice of diplomacy."
		},
		{
			"Year":"1990",
			"Question":"11. Attempt a critical note on the New International Economic Order and indicate its future prospects."
		},
		{
			"Year":"1990",
			"Question":"12(a). Indias nuclear policy"
		},
		{
			"Year":"1990",
			"Question":"12(b). The problem of German unification"
		},
		{
			"Year":"1990",
			"Question":"12(c). Indian Ocean as a zone of peace"
		},
		{
			"Year":"1990",
			"Question":"12(d). The Third World in international relation."
		},
		{
			"Year":"1990",
			"Question":"13. Indo-Pakistan relations have been complicated by Big Power Politics and Arms race in subcontinent. Would you agree with this view?"
		},
		{
			"Year":"1990",
			"Question":"14. Examine the impact of nuclear weapons on international relations with special reference to the relations between the superpowers."
		},
		{
			"Year":"1990",
			"Question":"15. What is glasnost? Has it contributed to any major change in the foreign policy of the Soviet Union? Justify your answer with reference to the Soviet Unions relations with East European countries. "
		},
		{
			"Year":"1991",
			"Question":"1(a). The aims persued by revolutionaries, like the origins of revolution, are the same in tyrannies and kingships as they are under regularConstitutions (Aristotle)."
		},
		{
			"Year":"1991",
			"Question":"1(b). The relation of the state and its parts to tranquility will be seen to be similar to the relation of the animal and its parts to health (Marsinglia of Padua)."
		},
		{
			"Year":"1991",
			"Question":"1(c). The condition of human life, which required labour and materials to work on, necessarily introduces private possessions (John Locke)."
		},
		{
			"Year":"1991",
			"Question":"1(d). The mode of production in material life determines the general character of the social, political and spiritual problems of life (Karl Marx)."
		},
		{
			"Year":"1991",
			"Question":"2. Political Science is a master-science, architectonic in its character, from which all other practical sciences take their cue (Ernest Barker). Discuss."
		},
		{
			"Year":"1991",
			"Question":"3. Discuss the Normative and Behavioural Approaches to the study of political science and examine the limitations of Behavioural Approach."
		},
		{
			"Year":"1991",
			"Question":"4. the existence of Liberty depends upon our willingness to build the foundations of society upon the basis of rational justice and to adjust them to changing conditions in terms of reasoned discussion and not violence (Harold J. Laski). Discuss"
		},
		{
			"Year":"1991",
			"Question":"5(a). Lenins theory of Democratic Centralism."
		},
		{
			"Year":"1991",
			"Question":"5(b). Spiritual nationalism of Aurobindo Ghosh."
		},
		{
			"Year":"1991",
			"Question":"5(c). Jawaharlal Nehru on Socialism and Secularism"
		},
		{
			"Year":"1991",
			"Question":"5(d). Agents of political socialisation."
		},
		{
			"Year":"1991",
			"Question":"6. Community and Caste still threaten social harmony and political peace in India. Discuss"
		},
		{
			"Year":"1991",
			"Question":"7. The role of the Indian Judiciary in recent years has been one of dynamic judicial activism. Elucidate."
		},
		{
			"Year":"1991",
			"Question":"8. Planning has superseded the federation and our country is functioning almost like a unitary system in many respects. In the light of the statement, examine the recent trends in Indian Federalism."
		},
		{
			"Year":"1991",
			"Question":"9(a). G-77"
		},
		{
			"Year":"1991",
			"Question":"9(b). International Court of Justice"
		},
		{
			"Year":"1991",
			"Question":"9(c). Pax Americana"
		},
		{
			"Year":"1991",
			"Question":"9(d). Neo-colonialism"
		},
		{
			"Year":"1991",
			"Question":"10. How far has interdependence among states undermined sovereignty?"
		},
		{
			"Year":"1991",
			"Question":"11. Examine the main assumptions of the Realist theory."
		},
		{
			"Year":"1991",
			"Question":"12. The UN has done well but not well enough. Comment"
		},
		{
			"Year":"1991",
			"Question":"13(a). Impact on Nuclear Weapons on international relations."
		},
		{
			"Year":"1991",
			"Question":"13(b). Indus water Treaty"
		},
		{
			"Year":"1991",
			"Question":"13(c). Perestroika"
		},
		{
			"Year":"1991",
			"Question":"13(d). Racialism in South Africa."
		},
		{
			"Year":"1991",
			"Question":"14. Discuss with reference to the USA, how domestic factors influence the foreign policy of the country."
		},
		{
			"Year":"1991",
			"Question":"15. Present a critique of Indias foreign policy "
		},
		{
			"Year":"1991",
			"Question":"16. Examine the problems and prospects of South-South economic cooperation."
		},
		{
			"Year":"1992",
			"Question":"1(a). Reality is a sheadow if ideas (Plato)."
		},
		{
			"Year":"1992",
			"Question":"1(b). Reason teaches all mankind who will but consult it, that being all equal and independent, no one ought to harm another in his life, health, liberty and possessions (Locke)"
		},
		{
			"Year":"1992",
			"Question":"1(c). Since liberty is a fruit that does not grow in all climates. It cannot be enjoyed by all people alike (Rousseau)."
		},
		{
			"Year":"1992",
			"Question":"1(d). The anatomy of civil society is to be sought in its political economy. Marx"
		},
		{
			"Year":"1992",
			"Question":"2. Examine the limitations of Behaviouralism as an approach to the study of politics."
		},
		{
			"Year":"1992",
			"Question":"3. Marx treats individual primarily as a member of a class. Critically examine his views on the economic man."
		},
		{
			"Year":"1992",
			"Question":"4. Do you agree with the view liberal democracy has own the historic battle of ideoligies."
		},
		{
			"Year":"1992",
			"Question":"5(a). Theory of capitalis enrichment"
		},
		{
			"Year":"1992",
			"Question":"5(b). The 42nd amendment to the Constitution of India"
		},
		{
			"Year":"1992",
			"Question":"5(c). Theory of circulation of elites"
		},
		{
			"Year":"1992",
			"Question":"5(d). Personality factor and party system in India."
		},
		{
			"Year":"1992",
			"Question":"6. Can modern democratic institutions be insulated from inter oriented politics? Discuss"
		},
		{
			"Year":"1992",
			"Question":"7. Tradition is not always incompatiable with Modernity. Comment on the statement with reference to the modernization trends in Indian policy."
		},
		{
			"Year":"1992",
			"Question":"8. Majority in legislatures does not necessarily contribute to the stability of the state Government in India. Discuss"
		},
		{
			"Year":"1992",
			"Question":"9(a). Military Industrial Complex"
		},
		{
			"Year":"1992",
			"Question":"9(b). Open versus Secret Diplomacy"
		},
		{
			"Year":"1992",
			"Question":"9(c). Compulsory Jurisdiction of the International Court of Justice"
		},
		{
			"Year":"1992",
			"Question":"9(d). Chinas Middle Kingdom Complex."
		},
		{
			"Year":"1992",
			"Question":"10. Despite a number of trends to the contrary, the State has been and remains the primary actors in the global system. Elucidate the statement by analysing the factors which helped create State and the reasons for the primary of States as across in International Relations. 11. The United Nations is not political system acting in a vacuum: Nor does it operate above international system. Comment"
		},
		{
			"Year":"1992",
			"Question":"12. Define Alliance. What is the role of Alliances in power politics? Discuss the relevance of Alliance in a nuclear age."
		},
		{
			"Year":"1992",
			"Question":"13(a). Human Rights in the US foreign policy"
		},
		{
			"Year":"1992",
			"Question":"13(b). Disintegration of the Soviet Union and the threat of nuclear proliferation"
		},
		{
			"Year":"1992",
			"Question":"13(c). India and the IMF"
		},
		{
			"Year":"1992",
			"Question":"13(d). Iraq after the Gulf War."
		},
		{
			"Year":"1992",
			"Question":"14. Discuss the prospects of a peace in West Asia in view of the changes in the US and Israeli policy and attitudes in this regard."
		},
		{
			"Year":"1992",
			"Question":"15. Analyse the developments in the Indo-US relations since the end of the Gulf War. Give the reasons for changes, if any, in the South Asia policy of USA."
		},
		{
			"Year":"1992",
			"Question":"16. The central focus of global politics is no longer the conflict between Socialism and Capitalism, but North versus South. Explain. "
		},
		{
			"Year":"1993",
			"Question":"1(a). For, no law or ordiance is mightier than knowledge (Plato)."
		},
		{
			"Year":"1993",
			"Question":"1(b). Material well-being alone is supreme. For, spiritual good and sensual pleasures depends upon material well-being (Kautilya)."
		},
		{
			"Year":"1993",
			"Question":"1(c). Obedience to mere impulse of appetite is slavery (Rousseau)."
		},
		{
			"Year":"1993",
			"Question":"1(d). The end of obedience is protection (Thomas Hobbes)."
		},
		{
			"Year":"1993",
			"Question":"2. Estimate the utility of the systems theory in social sciences."
		},
		{
			"Year":"1993",
			"Question":"3. Examine critically the pluralist arguments against the theory of sovereignty."
		},
		{
			"Year":"1993",
			"Question":"4. Examine the main issue involved in the Church-State controversy. What were is consequences?"
		},
		{
			"Year":"1993",
			"Question":"5(a). Political Modernization in India"
		},
		{
			"Year":"1993",
			"Question":"5(b). Anarchism in Gandhis philosophy"
		},
		{
			"Year":"1993",
			"Question":"5(c). Economic liberalisation in India"
		},
		{
			"Year":"1993",
			"Question":"5(d). Judicial behaviour."
		},
		{
			"Year":"1993",
			"Question":"6. What is political communication? Does communication theory offer satisfactory explanation of the political process in India?"
		},
		{
			"Year":"1993",
			"Question":"7. How do caste and class interact with each other in India politics?"
		},
		{
			"Year":"1993",
			"Question":"8. Examine the case for formation of small states in India."
		},
		{
			"Year":"1993",
			"Question":"9(a). NAM in the post Cold War era"
		},
		{
			"Year":"1993",
			"Question":"9(b). Cultural Imperialism"
		},
		{
			"Year":"1993",
			"Question":"9(c). Case for a permanent UN peace keeping force"
		},
		{
			"Year":"1993",
			"Question":"9(d). National Interest and Capability"
		},
		{
			"Year":"1993",
			"Question":"10. Explain the essential rules of the balance of power system and evaluate the role which balance of power plays in the stability of the global order in a multi-polar system."
		},
		{
			"Year":"1993",
			"Question":"11. Nation-State is currently exposed to disintegrative tendencies from within and integrative tendencies from without. Elucidate the statement in the context of developments in Europe."
		},
		{
			"Year":"1993",
			"Question":"12. One cannot understand the international politics of arms control without taking into account the domestic political forces which have a stake in maintaining large defence expenditure. Analyse these force which help in promoting international arms races."
		},
		{
			"Year":"1993",
			"Question":"13(a). Russias policy towards Japan"
		},
		{
			"Year":"1993",
			"Question":"13(b). NPT safeguards and Non-Nuclear Weapon States"
		},
		{
			"Year":"1993",
			"Question":"13(c). Palestinian Homeland issue and the West Asia crisis"
		},
		{
			"Year":"1993",
			"Question":"13(d). Ideological basis of Chinese foreign policy in the post Mao period."
		},
		{
			"Year":"1993",
			"Question":"14. Discuss the Third World perspective on the causes and cures of under development."
		},
		{
			"Year":"1993",
			"Question":"15. Keeping in view the global developments during the last few years what are the prospects of cooperative and friendly relations between India and Pakistan. "
		},
		{
			"Year":"1993",
			"Question":"16. The new world order as conceived by USA is an effort to reestablished the American century in military terms as the American economic and industrial dominance of the last 50 years is lost. Comment"
		},
		{
			"Year":"1994",
			"Question":"1(a) “The authority of the master and that of the statements are different from one another”. (Aristotle)"
		},
		{
			"Year":"1994",
			"Question":"1(b) “As soon as a nation appoints representatives, it is no longer free, it no longer exists.” (Rousseau)"
		},
		{
			"Year":"1994",
			"Question":"1(c) “Rulership can be successfully carried out (only) with the help of associates: one wheel alone does not turn.” (Kautilya)"
		},
		{
			"Year":"1994",
			"Question":"1(d) “The end of law is not a abolish or restrain but to preserve and enlarge freedom.” (Locke_"
		},
		{
			"Year":"1994",
			"Question":"2. What is the concept of justice in modern political theory? How is it related to Liberty and Equality?"
		},
		{
			"Year":"1994",
			"Question":"3. What is the nature of the crisis in political theory? Suggest remedies to overcome it."
		},
		{
			"Year":"1994",
			"Question":"4. Critically examine the Marxian theory of social stratification."
		},
		{
			"Year":"1994",
			"Question":"5(a) Cultural secularization"
		},
		{
			"Year":"1994",
			"Question":"5(b) Reserve discrimination"
		},
		{
			"Year":"1994",
			"Question":"5(c) Public interests litigation"
		},
		{
			"Year":"1994",
			"Question":"5(d) Tribalism in Africa"
		},
		{
			"Year":"1994",
			"Question":"6. Trace and analyze the co-operation trends in Indian federalism."
		},
		{
			"Year":"1994",
			"Question":"7. “Political reforms must precede and not follow social reforms”. (Tilak). Discuss."
		},
		{
			"Year":"1994",
			"Question":"8. How far do regional groupings pose a threat to the stability of Indian political system?"
		},
		{
			"Year":"1994",
			"Question":"9(a) UN’s peacekeeping role in domestic conflicts"
		},
		{
			"Year":"1994",
			"Question":"9(b) GATT treaty and developing countries"
		},
		{
			"Year":"1994",
			"Question":"9(c) Sovereign National State and International concern for Human Rights"
		},
		{
			"Year":"1994",
			"Question":"(9d) An oligopolistic global system."
		},
		{
			"Year":"1994",
			"Question":"10. “One of the truisms in world politics is that nothing is distributed equally on the face of the globe not people or their talent, not resources, not even climate, geographic features, technology or air quality.” Elucidate."
		},
		{
			"Year":"1994",
			"Question":"11. Diplomacy is not only a technique of foreign policy implementation, but also an instrument by which other techniques-military and economic can be successfully deployed. Discuss the significance of diplomacy in the conduct of foreign relations."
		},
		{
			"Year":"1994",
			"Question":"12. Discuss, the illustrations, the way decision making is influenced by the external and internal environment as perceived by the decision maker."
		},
		{
			"Year":"1994",
			"Question":"13(a) US trade relations with Japan"
		},
		{
			"Year":"1994",
			"Question":"13(b) China “one China” policy"
		},
		{
			"Year":"1994",
			"Question":"13(c) Peace in West Asia"
		},
		{
			"Year":"1994",
			"Question":"13(d) Political and legal status of C.I.S"
		},
		{
			"Year":"1994",
			"Question":"14. Non-proliferation has now acquired the status of a vested interest with the nuclear weapon state which, in the name of political stability, are trying to perpetuate a global order which will preserve their hegemonic position. Discuss."
		},
		{
			"Year":"1994",
			"Question":"15. Despite some problems which USA is facing in Asia, it is unlikely that pressure on India over the nuclear issue, Kashmir and missile programme will be released. Discuss."
		},
		{
			"Year":"1994",
			"Question":"16. \"Regional cooperation makes sense only in the event of there being, at least as the bottom line, a degree of ideological cohesion and/or economic dependence. the SAARC members have neither.”Comment."
		},
		{
			"Year":"1995",
			"Question":"1(a). Rule of law is better than rule of men (Aristotle)."
		},
		{
			"Year":"1995",
			"Question":"1(b). The end of every man is continued success in obtaining those things which he, from time to time, desires (Hobbes)."
		},
		{
			"Year":"1995",
			"Question":"1(c). Punishment should be preventive and corrective rather than retaliatory (Bentham)."
		},
		{
			"Year":"1995",
			"Question":"1(d). The worth of a state, in the long run, is the worth of the individuals composing it (J S Mill)."
		},
		{
			"Year":"1995",
			"Question":"2. Examine the fact-value dichotomy in political science. To what extent has postbehaviouralism resolved the conflict in the dichotomy?"
		},
		{
			"Year":"1995",
			"Question":"3. Analyse the post-Marxian developments in socialist thought."
		},
		{
			"Year":"1995",
			"Question":"4. Examine the pace of obligation in political theory."
		},
		{
			"Year":"1995",
			"Question":"5(a). Representative bureaucracies"
		},
		{
			"Year":"1995",
			"Question":"5(b). Ethnic separatism"
		},
		{
			"Year":"1995",
			"Question":"5(c). Creamy Layer and social justice"
		},
		{
			"Year":"1995",
			"Question":"5(d). Politics of terrorism"
		},
		{
			"Year":"1995",
			"Question":"6. The function of a legislature is not merely making of laws. What other functions are expected of a modern legislature?"
		},
		{
			"Year":"1995",
			"Question":"7. Bring out the linkages between political culture and civic culture with special reference to India."
		},
		{
			"Year":"1995",
			"Question":"8. Illustrate from contemporary Indian experience the theory of circulation of elites."
		},
		{
			"Year":"1995",
			"Question":"9(a). Agenda before NAM"
		},
		{
			"Year":"1995",
			"Question":"9(b). Role of Ideology in International Relations"
		},
		{
			"Year":"1995",
			"Question":"9(c). OAU and conflicts in Africa"
		},
		{
			"Year":"1995",
			"Question":"(9d). Role of International Law in international cooperation."
		},
		{
			"Year":"1995",
			"Question":"10. The traditional principle of sovereignty which plays a central role in the foreign policies of all states, is now increasingly counteracted by the growing facts of interdependence Discuss."
		},
		{
			"Year":"1995",
			"Question":"11. Form the start, the United Nations become a microcosm of world policies, with developments within the institution tending to mirror the atmosphere and happenings outside its walls. Comment."
		},
		{
			"Year":"1995",
			"Question":"12. Analyse the unjust and hegemonic aspects of the existing international economic order and the factors which perpetuate such an order."
		},
		{
			"Year":"1995",
			"Question":"13(a). India and the WTO"
		},
		{
			"Year":"1995",
			"Question":"13(b). Council for Security Cooperation in Asia pacific"
		},
		{
			"Year":"1995",
			"Question":"13(c). Russia and NATO"
		},
		{
			"Year":"1995",
			"Question":"13(d). Economic determinants of Chinese foreign policy."
		},
		{
			"Year":"1995",
			"Question":"14. Examine the issues raised in the context of renewal of NPT both by its advocates and its critics."
		},
		{
			"Year":"1995",
			"Question":"15. It is said that India bashing by its neighboring countries is directly or indirectly linked to their internal social conflicts. Explain with the help of development of Indo-Pak and Indo-Srilankan relations."
		},
		{
			"Year":"1995",
			"Question":"16. What, in your option, is the objective of the US policy in South Asia-status quo or peaceful change?Examine the strategies adopted by Washington in this regard."
		},
		{
			"Year":"1996",
			"Question":"1(a). Slavery is natural and beneficial both for the master and the slave (Aristotle)."
		},
		{
			"Year":"1996",
			"Question":"1(b). No man can be deprived of his property without his consent (Locke)."
		},
		{
			"Year":"1996",
			"Question":"1(c). The worth of a State, in the long run, is the worth of the individuals composing it (J. S. Mill)."
		},
		{
			"Year":"1996",
			"Question":"1(d). Contradiction is the very moving principle of the world (Hegel)."
		},
		{
			"Year":"1996",
			"Question":"2. Discuss the basic assumptions of behaviorism. In what way post-behaviorualism differs from behavioural theory?"
		},
		{
			"Year":"1996",
			"Question":"3. It is hard indeed to turn the Lockean doctrine into any kind of unqualified democratic theory (Mcpherson). Discuss."
		},
		{
			"Year":"1996",
			"Question":"4. Distinguish power from authority. How does reliance on authority affect the nature of power?"
		},
		{
			"Year":"1996",
			"Question":"5(a). Proportional representation"
		},
		{
			"Year":"1996",
			"Question":"5(b). Swadeshi movement"
		},
		{
			"Year":"1996",
			"Question":"5(c). Kesavananda Bharathi Case"
		},
		{
			"Year":"1996",
			"Question":"5(d). Co-operative federalism"
		},
		{
			"Year":"1996",
			"Question":"6. The roots of Indias growing problems of govern ability are more political than socioeconomic, that is, they are located in Indias political structure. Discuss."
		},
		{
			"Year":"1996",
			"Question":"7. Examine in the light of Indias experience the Weberian concept of Charismatic leadership."
		},
		{
			"Year":"1996",
			"Question":"8. Analyse the problems of nation building in India."
		},
		{
			"Year":"1996",
			"Question":"9(a). Role of idiosyncratic factors in foreign policy"
		},
		{
			"Year":"1996",
			"Question":"9(b). Technology and state sovereignty over water resources"
		},
		{
			"Year":"1996",
			"Question":"9(c). Intellectual Property Rights and free world trade"
		},
		{
			"Year":"1996",
			"Question":"9(d). US role in the OAS"
		},
		{
			"Year":"1996",
			"Question":"10. Realism as an approach to international relations helps to explain why states fight are threaten each other, but it is less effective in explaining much of the cooperative behaviour we see Comment."
		},
		{
			"Year":"1996",
			"Question":"11. Judged from the past UN does not held much promise to free the Third World from the clutches of neo-imperialism. Elucidate."
		},
		{
			"Year":"1996",
			"Question":"12. Although transnationalism is an important force in contemporary world politics, it is premature to speak of the demise of the nation-state, given the continued attachment to nationalism felt throughout the world. In the light of this statement discuss the role of nation state as an actor in international relations."
		},
		{
			"Year":"1996",
			"Question":"13(a). Indias claim to a permanent seat in the Security Council"
		},
		{
			"Year":"1996",
			"Question":"13(b). Hammas and peace in West Asia"
		},
		{
			"Year":"1996",
			"Question":"(13c). Prospects of a free trade area in South Asia"
		},
		{
			"Year":"1996",
			"Question":"13(d). Islamic factor in Indo-Pak relations."
		},
		{
			"Year":"1996",
			"Question":"14. Examine the changes in Chinas India policy in 1990S. Do you attribute these changes to the altered global environment or to the domestic factors?"
		},
		{
			"Year":"1996",
			"Question":"15. Russian foreign policy is described as the tyranny of the weak. Explain how judiciously Russia has made use of her weakness vis-a-vis the West and USA."
		},
		{
			"Year":"1996",
			"Question":"16. Explain the differences between India and USA on the question of CTBT. Why has India decided to link CTBT with the elimination of nuclear weapon?"
		},
		{
			"Year":"1997",
			"Question":"1(a). Sin, therefore is the mother of servitue, and first case of mens subjection to men (St. Augustine)."
		},
		{
			"Year":"1997",
			"Question":"1(b). Whoever therefore out of a State of Nature united into a Commonwealth must be understood to give up all the Power necessary to the Ends for which they united into Society, to the majority of the Community (Locke)."
		},
		{
			"Year":"1997",
			"Question":"1(c). Laws are any necessary relations arising from the nature of a thing (Montesquieu)."
		},
		{
			"Year":"1997",
			"Question":"1(d). It is not the consciousness of men that determine their being, but, on the contrary, their social being determines their consciousness (Marx)."
		},
		{
			"Year":"1997",
			"Question":"2. Discuss the importance of the Systems Theory in modern political analysis."
		},
		{
			"Year":"1997",
			"Question":"3. Examine the nature and limits of the rights of Resistance and Revolution recognized in modern political theory."
		},
		{
			"Year":"1997",
			"Question":"4. Discuss the philosophical basis of doctrine of popular sovereignty, and its significance for mankind."
		},
		{
			"Year":"1997",
			"Question":"5(a). Process of Political socialisation in Afro-Asian societies"
		},
		{
			"Year":"1997",
			"Question":"5(b). Jinnahs two-nation theory"
		},
		{
			"Year":"1997",
			"Question":"(5c). Political Dimensions of Development Administration"
		},
		{
			"Year":"1997",
			"Question":"5(d). Minority Government in India."
		},
		{
			"Year":"1997",
			"Question":"6. Discuss the patterns of legislative-executive relationship prevalent in the world today. What factors and forces have enabled the executive to overpower the legislature, in most countries."
		},
		{
			"Year":"1997",
			"Question":"7. The origins of the Indian political system are rooted in the history of British India. Comment."
		},
		{
			"Year":"1997",
			"Question":"8. Discuss the role and limits of the Indian Parliament in check-mating political corruption, with special reference to the Bofors payoff and the Securities scams."
		},
		{
			"Year":"1997",
			"Question":"9(a). Effective government as a source of national power"
		},
		{
			"Year":"1997",
			"Question":"9(b). SAPTA and SAFTA"
		},
		{
			"Year":"1997",
			"Question":"9(c). Maastricht Treaty"
		},
		{
			"Year":"1997",
			"Question":"9(d). Cultural Imperialism"
		},
		{
			"Year":"1997",
			"Question":"10. Bring out the contradiction between Internationalism and Globalization."
		},
		{
			"Year":"1997",
			"Question":"11. The relations of the Balance of Power to Collective Security have been at the same time complementary and antagonistic. Elucidate."
		},
		{
			"Year":"1997",
			"Question":"12. The change in the position of the people of Asia and Africa and their relations with Europe was the surest sign of the advent of a new era. Discuss."
		},
		{
			"Year":"1997",
			"Question":"13(a). Diego Garcia"
		},
		{
			"Year":"1997",
			"Question":"13(b). China and Nuclear Weapons"
		},
		{
			"Year":"1997",
			"Question":"13(c). West Asia Peace Conference at Madrid, 1991"
		},
		{
			"Year":"1997",
			"Question":"13(d). North-South conflict at Rio"
		},
		{
			"Year":"1997",
			"Question":"14. Explain the role of the Third World countries in the promotion of NIEO."
		},
		{
			"Year":"1997",
			"Question":"15. It is not ideological differences but national interests and considerations of leadership in world affairs that are responsible for Sino-Russian schism. Discuss this statements and show its impact on India."
		},
		{
			"Year":"1997",
			"Question":"16. Give us analysis of Indias Africa policy."
		},
		{
			"Year":"1998",
			"Question":"1(a). Polity is the best practicable form of government (Aristotle)."
		},
		{
			"Year":"1998",
			"Question":"1(b). The prince must be fox and the lion at the same time (Machiavelli)."
		},
		{
			"Year":"1998",
			"Question":"1(c). Hobbes relieved sovereignty completely from the disabilities which Bodin had inconsistently left standing (Sabine)."
		},
		{
			"Year":"1998",
			"Question":"1(d). Leninism is Marxism in the epoch of imperialisms and proletarian revolution (Stalin)."
		},
		{
			"Year":"1998",
			"Question":"2. What is meant by behavoural approach to politics? Is it a fool-proof approach? How far is it correct to say that the behavioural approach to political analysis appeared in order to counteracts the Marxist approach?"
		},
		{
			"Year":"1998",
			"Question":"3. Rousseaus theory of Social Contract is Hobbess Leviathan with its head chopped off. Discuss."
		},
		{
			"Year":"1998",
			"Question":"4. Discuss how early radical liberation was modified by John Stuart mill."
		},
		{
			"Year":"1998",
			"Question":"5(a). The concept of empowerment"
		},
		{
			"Year":"1998",
			"Question":"5(b). Raja Ram Mohan Roy as a social reformer"
		},
		{
			"Year":"1998",
			"Question":"5(c). Politics of terrorism in India"
		},
		{
			"Year":"1998",
			"Question":"5(d). Cooperation federalism in India-its problems and prospects"
		},
		{
			"Year":"1998",
			"Question":"6. Discuss the structural-functional analysis of politics."
		},
		{
			"Year":"1998",
			"Question":"7. The recent spate of judicial activities has created problem for the operation of parliamentary democracy in India. Discuss."
		},
		{
			"Year":"1998",
			"Question":"8. Discuss how far the politics of regionalism and communalism have affected nationbuilding in India."
		},
		{
			"Year":"1998",
			"Question":"9(a). Power"
		},
		{
			"Year":"1998",
			"Question":"9(b). Alliances"
		},
		{
			"Year":"1998",
			"Question":"9(c). Neo-Colonialism"
		},
		{
			"Year":"1998",
			"Question":"9(d). Conventional Arm Trade"
		},
		{
			"Year":"1998",
			"Question":"10. Examine the explanatory potential of Kaplans system theory in explaining the phenomenon of international politics in the present context."
		},
		{
			"Year":"1998",
			"Question":"11. People are concerned about the degradation of the environment and the problems that go with it. Discuss the international response."
		},
		{
			"Year":"1998",
			"Question":"12. Analyse the challenges and prospects of the UNO in becoming a world state."
		},
		{
			"Year":"1998",
			"Question":"13(a). Use of nuclear energy"
		},
		{
			"Year":"1998",
			"Question":"13(b). Palestine-Israel conflict in the present context"
		},
		{
			"Year":"1998",
			"Question":"13(c). SAARC"
		},
		{
			"Year":"1998",
			"Question":"13(d). Contending issue between India and Bangladesh"
		},
		{
			"Year":"1998",
			"Question":"14. Analyse the barriers to arm control."
		},
		{
			"Year":"1998",
			"Question":"15. Assess the role of the rim countries of the Indian Ocean in making it a peace zone in the post Cold War era."
		},
		{
			"Year":"1998",
			"Question":"16. Evaluate the foreign policy of India with special reference Pakistan and China in the present context."
		},
		{
			"Year":"1999",
			"Question":"1(a). Policy or constitutional government may be described generally as a fusion of oligarchy and democracy (Aristotle)."
		},
		{
			"Year":"1999",
			"Question":"1(b). The great and chief end, therefore, of men uniting into commonwealths, and putting themselves under government, is the preservation of property, to which in the state of nature there are many things waiting (John Locke)."
		},
		{
			"Year":"1999",
			"Question":"1(c). all human history is a process whereby ideas objectify themselves in material reality (Hegel)."
		},
		{
			"Year":"1999",
			"Question":"1(d). Marxs work could be seen as a compound of three elements-Green philosophy,English political economy and French socialism (Lenin)."
		},
		{
			"Year":"1999",
			"Question":"2. A scientific politics can develop only if the materials of politics are treated in terms of systems of actions. In the light of this statement of Kaplan with regard to application of systems theory to political science, critically examine the drawbacks of its application."
		},
		{
			"Year":"1999",
			"Question":"3. Critically evaluate and bring out the weakest aspects of behavioral and post-behavoural approaches to analysis of political system. What measurable and quantifiable criteria are available in political science to evaluate political behaviour?"
		},
		{
			"Year":"1999",
			"Question":"4(a). Liberty or freedom, signifies property the absence of opposition in external impediments of motion (Hobbes)."
		},
		{
			"Year":"1999",
			"Question":"4(b). In the first place, it is mostly considered unjust to deprive anyone of his personal liberty, his property or any other thing which belongs to him by law (John Stuart Mill)"
		},
		{
			"Year":"1999",
			"Question":"4(c). We believe that as a matter of principle each number of society has an inviolability founded on justice (Ralws)."
		},
		{
			"Year":"1999",
			"Question":"5. Comment on any THREE of the following in about 200 words each:"
		},
		{
			"Year":"1999",
			"Question":"5(a). Right to Constitutional Remedies under Article 32 of the Indian Constitution and application of the principle of Res Judicata."
		},
		{
			"Year":"1999",
			"Question":"5(b). Ideas of Gokhale and Tilak and their impact on the Indian struggle for freedom."
		},
		{
			"Year":"1999",
			"Question":"5(c). Influence of Gandhi, Nehru and Ambedkar in the framing of the Indian Constitution."
		},
		{
			"Year":"1999",
			"Question":"5(d). Views of Lenin, Michels and Duverger on political parties."
		},
		{
			"Year":"1999",
			"Question":"6. The electoral behaviour of Indian votes is more or less caste-ridden, including the selection process of party candidates. In the light of the above statements, critically examine the positive or the negative role of caste in the Indian political system."
		},
		{
			"Year":"1999",
			"Question":"7. Differentiate a political party from a pressure group. Explain the role of R. S S and Bajarang Dalunits of Sangh Parivar as pressure-group in the Indian political system."
		},
		{
			"Year":"1999",
			"Question":"8. Write on any two of the following in not more than 300 words each"
		},
		{
			"Year":"1999",
			"Question":"8(a). Divisionism in Indian political parties with special reference to Janta Dal, Congress, CPI and Alaki Dal."
		},
		{
			"Year":"1999",
			"Question":"8(b). Impact of modernisation and new communication technologies on political processes of Afro-Asian countries."
		},
		{
			"Year":"1999",
			"Question":"8(c). Public Interest Litigation and Judicial Activism."
		},
		{
			"Year":"1999",
			"Question":"9(a). National Interest and Ideology"
		},
		{
			"Year":"1999",
			"Question":"9(b). Agenda 21 and after"
		},
		{
			"Year":"1999",
			"Question":"9(c). The European Union"
		},
		{
			"Year":"1999",
			"Question":"9(d). Relevance of Diplomacy in the Nuclear Age."
		},
		{
			"Year":"1999",
			"Question":"10. The decision-making is only a partial theory of international politics. Critically examine the above statement."
		},
		{
			"Year":"1999",
			"Question":"11. In a uni-polar world, non-alignment has lost its relevance. Do you agree with this view? Give arguments in support of your answer."
		},
		{
			"Year":"1999",
			"Question":"12. Critically examine the various controversial issue in the functioning of the World Trade Organization from the point of view of developing countries, particularly India."
		},
		{
			"Year":"1999",
			"Question":"13(a). Nuclear Non-Proliferation Treaty"
		},
		{
			"Year":"1999",
			"Question":"13(b). Indo-Russian Summit 1997"
		},
		{
			"Year":"1999",
			"Question":"13(c). Chinas foreign policy towards Pakistan in the present context."
		},
		{
			"Year":"1999",
			"Question":"13(d). The Gulf Crisis 1991 - 92."
		},
		{
			"Year":"1999",
			"Question":"14. Write a critical essay on the role of the Third World in international relations, especially in the United Nations."
		},
		{
			"Year":"1999",
			"Question":"15. Examine the changing perspective of the US foreign policy towards South Asia in recent times and its implications for prospects of peace in the region."
		},
		{
			"Year":"1999",
			"Question":"16. Discuss some of the major issues of conflict and cooperation between India, Nepal and Bhutan."
		},
		{
			"Year":"2000",
			"Question":"1(a). Until philosophers are kings. Or kings and princes of this world have the spirit and power of philosophy, cities will neever have rest from evil (Plato)."
		},
		{
			"Year":"2000",
			"Question":"1(b). Power is an end in itself and he (Machievelli) inquires into the means that are best suited to acquire, retain and expand power, thus separates power from morality, ethics, religion and metaphysics (Ebenstein on Machievelli)."
		},
		{
			"Year":"2000",
			"Question":"1(c). I gives the name to every state that is governed by laws, no matter what the form of its administration (Rousseau)."
		},
		{
			"Year":"2000",
			"Question":"1(d). State is a march of God on the Earth (Hegel)."
		},
		{
			"Year":"2000",
			"Question":"2. The modern pluralist democracies have posed a great threat to the fabric of nation state.Discuss (60)."
		},
		{
			"Year":"2000",
			"Question":"3. Post-behaviouralism is not a negation of the behavioural revolution but only its corrective. How does it seeks to raise the status of the discipline of political Science (60)?"
		},
		{
			"Year":"2000",
			"Question":"4. To what extent does the Rawlsian goal of achieving social justice depend on anoverarching consensus among cultural, religious and ideological groups (60)?"
		},
		{
			"Year":"2000",
			"Question":"5(a). Shared rule to be as important as self rule in explaining the possibility of federalpower sharing."
		},
		{
			"Year":"2000",
			"Question":"5(b). Women empowerment in India and its impact on democracy."
		},
		{
			"Year":"2000",
			"Question":"5(c). Corruption in Administration in India and its impact on socio-economicreconstruction."
		},
		{
			"Year":"2000",
			"Question":"5(d). Caste and religion as operative factors with Indian policy."
		},
		{
			"Year":"2000",
			"Question":"6. What are the salient features of Sarkaria Commission Report as regard to federal restructuring in India with special reference to autonomy demand by states (60)?"
		},
		{
			"Year":"2000",
			"Question":"7. Critically evaluate Webers ideas on Bureaucracy and highlight the significance of the Weberian model from Indias point of view (60)."
		},
		{
			"Year":"2000",
			"Question":"8. The role of Indian Prime Ministers in the federal system was always controversial. Do you agree with this statement? Give reasons for your answer with apt examples (60)"
		},
		{
			"Year":"2000",
			"Question":"9(a). Rethinking on sovereign state"
		},
		{
			"Year":"2000",
			"Question":"9(b). Information Technology as element of national power"
		},
		{
			"Year":"2000",
			"Question":"9(c). Pan-Americanism"
		},
		{
			"Year":"2000",
			"Question":"9(d). The U. N General Assembly Millenium Summit (Sept. 2000)."
		},
		{
			"Year":"2000",
			"Question":"10. International politics, like all politics is a struggle for power. Comment (60)."
		},
		{
			"Year":"2000",
			"Question":"11. Do you agree with the stand that the Non-Alignment Movement needs to be reinvented (60)?"
		},
		{
			"Year":"2000",
			"Question":"12. Liberalization and Globalization are feared by the developing countries, as the Trojan Horses of the developed countries. Elucidate (60)."
		},
		{
			"Year":"2000",
			"Question":"13(a). The New International Economic Order"
		},
		{
			"Year":"2000",
			"Question":"13(b). Peaceful Nuclear Explosions (PNE)"
		},
		{
			"Year":"2000",
			"Question":"13(c). Potentials of Non-conventional energy sources"
		},
		{
			"Year":"2000",
			"Question":"13(d). Summit Diplomacy"
		},
		{
			"Year":"2000",
			"Question":"14. Examine the Israel-Arab conflict as a conflict of interest between the USA and the Soviet Union (60)."
		},
		{
			"Year":"2000",
			"Question":"15. Is the reforms of the UN. Indias claim on the permanent seat in the Security Council is national and equally justifiable. Elucidate (60)."
		},
		{
			"Year":"2000",
			"Question":"16. Indo-Pak relationship veers around the peaceful settlement of the Kashmir issue. Critically evaluate various alternatives for its solution (60)"
		},
		{
			"Year":"2001",
			"Question":"1(a). Relevance of contextualist approach to the study of political theory."
		},
		{
			"Year":"2001",
			"Question":"1(b). Polyarchy."
		},
		{
			"Year":"2001",
			"Question":"1(c). Validity of the statement that most prominent among Gandhian principles are non-violence, adherence to truth and dignity of labour."
		},
		{
			"Year":"2001",
			"Question":"1(d). Constitution as a power map"
		},
		{
			"Year":"2001",
			"Question":"2. Defence ideology. Critically examine the End of Ideology Debate (60)."
		},
		{
			"Year":"2001",
			"Question":"3. What are the major components of Modern Indian Political Though? Examine then with reference to Gandhi and M N Roy (60)."
		},
		{
			"Year":"2001",
			"Question":"4. Critically examine Marxist theory of the state with reference to the dictatorship of the proletariat (60)."
		},
		{
			"Year":"2001",
			"Question":"5(a). The debate over judicial activism in India."
		},
		{
			"Year":"2001",
			"Question":"5(b). Impact of disinvestment and privatization on planning in India."
		},
		{
			"Year":"2001",
			"Question":"5(c). Concept of committed bureaucracy."
		},
		{
			"Year":"2001",
			"Question":"5(d). Factors for the growth of regionalism in India."
		},
		{
			"Year":"2001",
			"Question":"6. Critically examine the impact of the national movement on the making of the constitution of India (60)."
		},
		{
			"Year":"2001",
			"Question":"7. Indian democracy began with the unique advantages of an efficient civil service and a well organized political party yet its record is dismal. What are the causes for such poor performance (60)?"
		},
		{
			"Year":"2001",
			"Question":"8. The women activists did not support Quota till 1974. What led to the subsequent change in their stand (60)?"
		},
		{
			"Year":"2001",
			"Question":"9(a). National interest and national peculiarities: A guide to foreign policy"
		},
		{
			"Year":"2001",
			"Question":"9(b). Nature of political process in the Third World."
		},
		{
			"Year":"2001",
			"Question":"9(c). Cuban Missile as a factor in U. S relationship with the USS. R."
		},
		{
			"Year":"2001",
			"Question":"9(c). The compulsory jurisdiction clause under the statute of the International Court of Justice."
		},
		{
			"Year":"2001",
			"Question":"10. Identify some of the major issues challenging the North-South countries (60)."
		},
		{
			"Year":"2001",
			"Question":"11. The Arab-Israeli conflict is basically a conflict between two resurgent nationalism (60)."
		},
		{
			"Year":"2001",
			"Question":"12. Moral claims of today becomes the human rights of tomorrow. Trace the efforts in the international protection of human rights in the twentieth century (60)"
		},
		{
			"Year":"2001",
			"Question":"13(a). India and Handung Conference: Hope and Reality."
		},
		{
			"Year":"2001",
			"Question":"13(b). India and the U. N Peace-keeping Force."
		},
		{
			"Year":"2001",
			"Question":"13(c). Indias opposition to the Non Proliferation Treaty: A realist paradigm."
		},
		{
			"Year":"2001",
			"Question":"13(d). SAARC: Problems and Prospects."
		},
		{
			"Year":"2001",
			"Question":"14. Has the Non-Alignment Movement lost its relevance in the present day situation and how as India has evolved its foreign policy goals to the changing international scenario (60)?"
		},
		{
			"Year":"2001",
			"Question":"15. Examine Pakistan as a factor in Indo-American relations during the Cold War (60). "
		},
		{
			"Year":"2001",
			"Question":"16. Explain Indias role in global disarmament (60)"
		},
		{
			"Year":"2002",
			"Question":"1(a). The polis exists by nature and that it is prior to the individual (Aristotle)."
		},
		{
			"Year":"2002",
			"Question":"1(b). The true source of light is duty. If we all discharge our duties, rights will not be far to see (M K Gandhi)."
		},
		{
			"Year":"2002",
			"Question":"1(c). In so far as national events are decided, the power elite are those who decide them (C Wright Mills)."
		},
		{
			"Year":"2002",
			"Question":"1(d). Will, not force, is the basis of the state (T H Green)."
		},
		{
			"Year":"2002",
			"Question":"2. Examine the arguments in the Normative vs. Empirical debate in the study of political theory (60)."
		},
		{
			"Year":"2002",
			"Question":"3. Discuss the evaluation of the theories of human rights from natural rights to collective and environmental rights (60)."
		},
		{
			"Year":"2002",
			"Question":"4. Analyse M. N Roys ideational journey from Marxism to Radical Humanism (60)."
		},
		{
			"Year":"2002",
			"Question":"5(a). Dyarchy under Montague-Chelmsord Reforms"
		},
		{
			"Year":"2002",
			"Question":"5(b). Comptroller and Auditor General of India"
		},
		{
			"Year":"2002",
			"Question":"5(c). Tribal people movement in the North-East"
		},
		{
			"Year":"2002",
			"Question":"5(d). New Economic Policy (1991)."
		},
		{
			"Year":"2002",
			"Question":"6. Examine the salient features of the Indian Independence Act (1947) relating to the transfer of power. What specific provisions did this Act make for the lapse of paramountcy (60)?"
		},
		{
			"Year":"2002",
			"Question":"7. It is generally believed that federalism suffers in the system of centralized planning. Do you agree with this point of view? Would you advocate decentralized governance for India in the context of liberalization since 1991 (60)?"
		},
		{
			"Year":"2002",
			"Question":"8. Bring out the common and unique features of the 73rd and the 74th amendments to the Constitution of India. Do you think that these amendments would contribute to the achievement of gender and social justice at the grass root level (60)"
		},
		{
			"Year":"2002",
			"Question":"9(a). Marxist approach to international politics."
		},
		{
			"Year":"2002",
			"Question":"9(b). Changing nature and dynamics of national security."
		},
		{
			"Year":"2002",
			"Question":"9(c). Human rights and humanitarian intervention."
		},
		{
			"Year":"2002",
			"Question":"9(d). ASEAN as third would model of regional cooperation."
		},
		{
			"Year":"2002",
			"Question":"10. Critically examine the roots of Afghan Civil War. What role the Soviet Union and the United States played in it (60)?"
		},
		{
			"Year":"2002",
			"Question":"11. Discuss various elements and limitations of national power (60)."
		},
		{
			"Year":"2002",
			"Question":"12. How far the existing international economic order is unjust and hegemonic towards developing countries (60)?"
		},
		{
			"Year":"2002",
			"Question":"13(a). Look Eat policy of India."
		},
		{
			"Year":"2002",
			"Question":"13(b). Role and consequences of IPKF in Sri Lanka."
		},
		{
			"Year":"2002",
			"Question":"13(c). India and European Union."
		},
		{
			"Year":"2002",
			"Question":"13(d). Indias claim for permanents seat in the UN Security Council."
		},
		{
			"Year":"2002",
			"Question":"14. Critical examine Indias objectives to CTBT and NPT (60)."
		},
		{
			"Year":"2002",
			"Question":"15. Examine the recent developments in Sino-Indian relations (60)."
		},
		{
			"Year":"2002",
			"Question":"16. Discuss Indias contribution to the growth and development of the Non-Aligned Movement (60)."
		},
		{
			"Year":"2003",
			"Question":"1(a). The main political ideas contained in the Manusmriti"
		},
		{
			"Year":"2003",
			"Question":"1(b). Mandal theory"
		},
		{
			"Year":"2003",
			"Question":"1(c). The reason why men enter into civil society is the preservation of their property (Locke)."
		},
		{
			"Year":"2003",
			"Question":"1(d). Machavellis political philosophy was narrowly local and narrowly dated (Sabine)."
		},
		{
			"Year":"2003",
			"Question":"2. Explain Platos communism and compare it with modern communism (60)."
		},
		{
			"Year":"2003",
			"Question":"3. The history of all hitherto existing society is the history of class struggle (Karl Marx). Comment (60)."
		},
		{
			"Year":"2003",
			"Question":"4. Discuss the political philosophy of Hannah Arendt (60)."
		},
		{
			"Year":"2003",
			"Question":"5(a). Simon Commission"
		},
		{
			"Year":"2003",
			"Question":"5(b). Right against exploitation under the Indian Constitution"
		},
		{
			"Year":"2003",
			"Question":"5(c). Union Public Service Commission"
		},
		{
			"Year":"2003",
			"Question":"(5d). Gandhis concept of Truth and Non-violence. Why was he opposed to modern civilisation?"
		},
		{
			"Year":"2003",
			"Question":"6. Pandit Jawaharlal Nahru comes before us as a great nationalist, Internationalist and Humanist. Discuss (60)."
		},
		{
			"Year":"2003",
			"Question":"7. The Directive Principles of State Policy are not mere pious declarations but clear directions for the guidance of State Policy. Comment and show how for they have been applied in practice (60)."
		},
		{
			"Year":"2003",
			"Question":"8. Identify the major pressure-group in Indian politics and examine their role in it (60)."
		},
		{
			"Year":"2003",
			"Question":"9(a). Traditional approach and its significance"
		},
		{
			"Year":"2003",
			"Question":"9(b). Balance of power and its impact on world politics"
		},
		{
			"Year":"2003",
			"Question":"9(c). Main features of WTO"
		},
		{
			"Year":"2003",
			"Question":"9(d). Obstacles in the way of SAARCs smooth functioning"
		},
		{
			"Year":"2003",
			"Question":"10. Clearly explain Realist theory to the study of International Politics (60)."
		},
		{
			"Year":"2003",
			"Question":"11. Do you think Cold War still exists after the disintegration of the Soviet Union (60)?"
		},
		{
			"Year":"2003",
			"Question":"12. Critically examine the protection and enforcement of Human Rights under the U. N. Syste (60)."
		},
		{
			"Year":"2003",
			"Question":"13(a). Impact of Sino-Indian conflict of 1962 on International Politics"
		},
		{
			"Year":"2003",
			"Question":"13(b). Indias role in the independence of Bangladesh"
		},
		{
			"Year":"2003",
			"Question":"13(c). Areas of cooperation between India and Russia"
		},
		{
			"Year":"2003",
			"Question":"13(d). IMF and Indias development"
		},
		{
			"Year":"2003",
			"Question":"14. Assess the merits of Indias case against signing the Comprehensive Test Ban Treaty (60)."
		},
		{
			"Year":"2003",
			"Question":"15. Examine the areas of cooperation and conflict in the Indo-American relations (60)."
		},
		{
			"Year":"2003",
			"Question":"16. Critically examine the view that in the Post-Cold War era India policy of non-alignment has become irrelevant (60)."
		},
		{
			"Year":"2004",
			"Question":"1(a). The authority of the master and that of the statements are different from one another (Aristotle)."
		},
		{
			"Year":"2004",
			"Question":"1(b). As soon as a nation appoints representatives, it is no longer free, it no longer exists (Rousseau)."
		},
		{
			"Year":"2004",
			"Question":"1(c). Rulership can be successfully carried out (only) with the help of associates: One wheel alone does not turn (Kautilya)."
		},
		{
			"Year":"2004",
			"Question":"1(d). The end of law is not a abolish or restrain but to preserve and enlarge freedom (Locke)."
		},
		{
			"Year":"2004",
			"Question":"2. What is the concept of justice in modern political theory? How is it related to Liberty and Equality?"
		},
		{
			"Year":"2004",
			"Question":"3. What is the nature of the crisis in political theory? Suggest remedies to overcome it."
		},
		{
			"Year":"2004",
			"Question":"4. Critically examine the Marxian theory of social stratification."
		},
		{
			"Year":"2004",
			"Question":"5(a). Cultural secularisation"
		},
		{
			"Year":"2004",
			"Question":"5(b). Reserve discrimination"
		},
		{
			"Year":"2004",
			"Question":"5(c). Public interests litigation"
		},
		{
			"Year":"2004",
			"Question":"5(d). Tribalism in Africa"
		},
		{
			"Year":"2004",
			"Question":"6. Trace and analyse the co-operation trends in Indian federalism."
		},
		{
			"Year":"2004",
			"Question":"7. Political reforms must precede and not follow social reforms (Tilak). Discuss."
		},
		{
			"Year":"2004",
			"Question":"8. How far do regional groupings pose a threat to the stability of Indian political system?"
		},
		{
			"Year":"2004",
			"Question":"9(a). UNs peacekeeping role in domestic conflicts"
		},
		{
			"Year":"2004",
			"Question":"9(b). GATT treaty and developing countries"
		},
		{
			"Year":"2004",
			"Question":"9(c). Sovereign National State and International concern for Human Rights"
		},
		{
			"Year":"2004",
			"Question":"9(d). An oligopolistic global system."
		},
		{
			"Year":"2004",
			"Question":"10. One of the truisms in world politics is that nothing is distributed equally on the face of the globenot people or their talent, not resources, not even climate, geographic features, technology or air quality. Elucidate."
		},
		{
			"Year":"2004",
			"Question":"11. Diplomacy is not only a technique of foreign policy implementation, but also an instrument by which other techniques-military and economic can be successfully deployed. Discuss the significance of diplomacy in the conduct of foreign relations."
		},
		{
			"Year":"2004",
			"Question":"12. Discuss, the illustrations, the way decision making is influenced by the external and internal environment as perceived by the decision maker."
		},
		{
			"Year":"2004",
			"Question":"13(a). US trade relations with Japan"
		},
		{
			"Year":"2004",
			"Question":"(13b). China one China policy"
		},
		{
			"Year":"2004",
			"Question":"13(c). Peace in West Asia"
		},
		{
			"Year":"2004",
			"Question":"13(d). Political and legal status of C. I. S"
		},
		{
			"Year":"2004",
			"Question":"14. Non-proliferation has now acquired the status of a vested interest with the nuclear  weapon state which, in the name of political stability, are trying to perpetuate a global order which will preseve their hegemonic position. Discuss. "
		},
		{
			"Year":"2004",
			"Question":"15. Despite some problems which USA is facing in Asia, it is unlikely that pressure on India over the nuclear issue, Kashmir and missile programme will be released. Discuss."
		},
		{
			"Year":"2004",
			"Question":"16. Regional cooperation makes sense only in the event of there being, at least as the bottom line, a degree of ideological cohesion and/or economic dependence. The SAARC members have neither. Comment. "
		},
		{
			"Year":"2005",
			"Question":"1(a). The State is Individual Writ Large (Plato)."
		},
		{
			"Year":"2005",
			"Question":"1(b). Of those (officers) the ways of embezzlement are forty (Kautilya)."
		},
		{
			"Year":"2005",
			"Question":"1(c). The discovery of Sovereign in a federal state is an impossible adventure (Laski)."
		},
		{
			"Year":"2005",
			"Question":"1(d). The sole end for which mankind are warranted, individually or collectively, in interfering with the liberty of action of any of their number is self protection (J S Mill)."
		},
		{
			"Year":"2005",
			"Question":"2. Do you agree with the view that liberal theories are based on atomism, whereas communitarians have a social thesis? Present your line of argument. 60"
		},
		{
			"Year":"2005",
			"Question":"3. Democratic theory presupposes self-determination, human rights and social justice. Discuss this with particular reference to M K Gandhi. 60"
		},
		{
			"Year":"2005",
			"Question":"4. The root of politics, according to Marx, does not lie in the state; it lies in the social conditions underlying this institution, that is, in the material conditions of life as reflected through the mode of production. Comment. 60"
		},
		{
			"Year":"2005",
			"Question":"5(a). Views of Jaya Prakash Narayan on Total Revolution"
		},
		{
			"Year":"2005",
			"Question":"5(b). Fundamental Duties under Article 51a of the Constitution of India."
		},
		{
			"Year":"2005",
			"Question":"5(c). Coalition Governments in India at the Centre since 1998"
		},
		{
			"Year":"2005",
			"Question":"5(c). Role of Gram Sabha under the Constitution (Seventy third-Amendment) Act, 1992"
		},
		{
			"Year":"2005",
			"Question":"6. Explain the federal scheme under the Government of India Act, 1935. Why could this scheme not be implemented? 60"
		},
		{
			"Year":"2005",
			"Question":"7. Do you agree with the view that Fundamental Rights and Directive Principles of State Policy Constitute the Core and Conscience of the Indian Constitution? Comment on the emerging trends in their interrelationship. 60"
		},
		{
			"Year":"2005",
			"Question":"8. Make an assessment of the composition, functioning and the role of the Election Commission of India in the conduct of free and fair elections. 60"
		},
		{
			"Year":"2005",
			"Question":"9(a). Game Theory for the study of International Politics and its limitations"
		},
		{
			"Year":"2005",
			"Question":"9(b). Sustainable Development"
		},
		{
			"Year":"2005",
			"Question":"9(c). Basic issues in movements for Gender Justice"
		},
		{
			"Year":"2005",
			"Question":"(9d). Relevance of Non-Alignment in Post-Cold war era"
		},
		{
			"Year":"2005",
			"Question":"10. Analyse the basic goals of Third World movement for global justice. What is the importance of South-South co-operation to achieve these? 60"
		},
		{
			"Year":"2005",
			"Question":"11. Critically evaluate the nature of capitalist model of development and its usefulness and limitations for developing countries. 60"
		},
		{
			"Year":"2005",
			"Question":"12. Describe and assess the role and importance of Geopolitical and Geo-economic factors in the determination of foreign policy of a country 60"
		},
		{
			"Year":"2005",
			"Question":"13(a). Indias interest in ASEAN"
		},
		{
			"Year":"2005",
			"Question":"13(b). Indias claim for acceptance as a nuclear power"
		},
		{
			"Year":"2005",
			"Question":"13(c). India as leader of Non-Aligned movement"
		},
		{
			"Year":"2005",
			"Question":"13(d). Emerging areas of co-operation between India and Japan"
		},
		{
			"Year":"2005",
			"Question":"14. Explain the importance and limitations of recent Confidence Building Measures in IndoPak relations. 60"
		},
		{
			"Year":"2005",
			"Question":"15. Evaluate the role India has played in U. N. Peace-keeping activities and the cause of global disarmament. 60"
		},
		{
			"Year":"2005",
			"Question":"16. How far institutions like WTO and IMF have influenced Indias political and economic sovereignty? What has been Indias response to these? 60 "
		},
		{
			"Year":"2006",
			"Question":"1(a). State is individual write large (Plato)"
		},
		{
			"Year":"2006",
			"Question":"1(b). THE GENERAL WILL is not so much the will of the State as the will for the State, … (MacIver)."
		},
		{
			"Year":"2006",
			"Question":"1(c). Impact of Globalisation on State Sovereignty."
		},
		{
			"Year":"2006",
			"Question":"1(c). that the anatomy of this civil society, however, has to be sought in political economy (Marx)."
		},
		{
			"Year":"2006",
			"Question":"2. Attempt a critique a Aristotles ideas on slavery (60)."
		},
		{
			"Year":"2006",
			"Question":"3. Do you agree with the view that Political culture of a society is highly significant aspect of the Political System? Give reasons in support of your answer (60)."
		},
		{
			"Year":"2006",
			"Question":"4. Explain Gandhis ideas regarding State and highlight their relationship with modern democracy and principles of anarchism (60)."
		},
		{
			"Year":"2006",
			"Question":"5(a). Ambedkars Concept of Social Justice"
		},
		{
			"Year":"2006",
			"Question":"5(b). The Concept of Women Empowerment"
		},
		{
			"Year":"2006",
			"Question":"(5c). Judicial Activism"
		},
		{
			"Year":"2006",
			"Question":"(5d). Decentralized Planning"
		},
		{
			"Year":"2006",
			"Question":"6. Discuss whether coalitional politics has led to a different patterns of federalism in India (60)."
		},
		{
			"Year":"2006",
			"Question":"7. Highlight the impact of 73rd Constitutional Amendment on the working of the Panchyati Raj institutions in India (60)"
		},
		{
			"Year":"2006",
			"Question":"8. Critically examine the role and contribution of Indias bureaucracy in nation building (60)."
		},
		{
			"Year":"2006",
			"Question":"9(a). International politics, like all politics, is a struggle for power. Comment."
		},
		{
			"Year":"2006",
			"Question":"9(b). Input-output functions of political system."
		},
		{
			"Year":"2006",
			"Question":"9(c). A well-established system of collective security is a guarantee of world peace. Explain."
		},
		{
			"Year":"2006",
			"Question":"9(d). International Court of Justice."
		},
		{
			"Year":"2006",
			"Question":"10. Analyse and evaluate the role of decision-making theory as a tool of foreign policy analysis (60)."
		},
		{
			"Year":"2006",
			"Question":"11. Few agencies of International co-operation have been more successful in tending to the welfare of humanity than the I. L. O Discuss the organization of activities of the International Labour Organization in the light of the above statement (60)."
		},
		{
			"Year":"2006",
			"Question":"12. The establishment of South Asian Association for Regional Co-operation (SAARC) has opened the gargets of mutual co-operation among the State of South Asia. In the light of this statement examine Indias role in the South Asian region (60)."
		},
		{
			"Year":"2006",
			"Question":"13(a). Give a critical estimate of Indias role in the Non-Aligned Movement"
		},
		{
			"Year":"2006",
			"Question":"13(b). India and the emerging International Economic Order."
		},
		{
			"Year":"2006",
			"Question":"13(c). Oil crisis: Its impact on Indias development strategy."
		},
		{
			"Year":"2006",
			"Question":"13(d). Indias Foreign Policy could have matched with the fast-changing international system. Discuss it."
		},
		{
			"Year":"2006",
			"Question":"14. Give a arguments in defence of Indias approach to Comprehensive Test Ban Treaty (CTBT) (60)."
		},
		{
			"Year":"2006",
			"Question":"15. Discuss the present state of Indo-Russian relations (60)."
		},
		{
			"Year":"2006",
			"Question":"16. Give a critical account of Indias rule in the affairs of the Third World countries (60)."
		},
		{
			"Year":"2007",
			"Question":"1(a). Platos communism is a supplementary machinery to give effect to and reinforce that spirt which education is create (Nettleship)."
		},
		{
			"Year":"2007",
			"Question":"1(b). In the happiness of his subjects lies the kings happiness in their welfare of his welfare (Kautilya)."
		},
		{
			"Year":"2007",
			"Question":"1(c). state is the result of the irreconcilability of class antagonism (Lenin)"
		},
		{
			"Year":"2007",
			"Question":"1(d). Because the society is federal, the authority must also be federal (Laski)."
		},
		{
			"Year":"2007",
			"Question":"2. Political process in a country is merely the manifestation of political culture. Elucidate 60"
		},
		{
			"Year":"2007",
			"Question":"3. Critically examine the Sapta Prakriti of state as envisage by Kautilya. 60"
		},
		{
			"Year":"2007",
			"Question":"4. Discuss the importance of Machiavelli in the history of political thought. Is it correct to say that Machiavelis theory is narrowly local and narrowly dated? 60"
		},
		{
			"Year":"2007",
			"Question":"5(a). Nehrus View on socialism"
		},
		{
			"Year":"2007",
			"Question":"5(b). The Directive principle of state policy are not mere pious declaration but clear direction for the guideline of state policy."
		},
		{
			"Year":"2007",
			"Question":"5(c). the instability of national policies is due to rising influence of religious politics."
		},
		{
			"Year":"2007",
			"Question":"5(d). The panchayati Raj institutions and district administration should develop a new relationship for achieving the goal of good governance."
		},
		{
			"Year":"2007",
			"Question":"6. Political reforms must precede not follow social reform Tilak. Elucidate. 60 "
		},
		{
			"Year":"2007",
			"Question":"7. Explain the concept of judicial activism and examine its impact on the relationship between executive and judiciary in India. 60"
		},
		{
			"Year":"2007",
			"Question":"8. Discuss how far the grass root democratic institutions have remained successful in accelerating the process of rural development after 73rd constitutional amendment. 60"
		},
		{
			"Year":"2007",
			"Question":"9(a). Examine the relevance of the political economy approach to the study of comparative politics."
		},
		{
			"Year":"2007",
			"Question":"9(b). Define geopolitical and account for its prevalence even in the modern nuclear age."
		},
		{
			"Year":"2007",
			"Question":"9(c). The Afghanistan Civil War gave the US a long awaited upper hand in south Asia."
		},
		{
			"Year":"2007",
			"Question":"9(d). In What sense has gender justice become an urgent global concern today."
		},
		{
			"Year":"2007",
			"Question":"10. Development in contemporary discourse has dimension larger than just economic. Bring out the significance of the statement. 60"
		},
		{
			"Year":"2007",
			"Question":"11. How would you differentiate the post cold war global order from its predecessor? 60"
		},
		{
			"Year":"2007",
			"Question":"12. Analyze critically the major changes in the role of United Nations (UN) since the onset of new millennium. 60"
		},
		{
			"Year":"2007",
			"Question":"13(a). was there any domestic socio-political basis for India to pursue the policy of nonalignment."
		},
		{
			"Year":"2007",
			"Question":"13(b). what are the motivations for Indias Look East Policy."
		},
		{
			"Year":"2007",
			"Question":"13(c). Identify the persistent points of frictions between India and Bangladesh at present."
		},
		{
			"Year":"2007",
			"Question":"13(d). Examine the trends in Indias relations with the European Union."
		},
		{
			"Year":"2007",
			"Question":"14. Critically review the progress of India-Pakistan peace process since Kargil War. 60"
		},
		{
			"Year":"2007",
			"Question":"15. Domestic turmoil in neighbouring South Asian countries often constitutes a strain on Indian Foreign policy. Discuss with illustration. 60"
		},
		{
			"Year":"2007",
			"Question":"16. Comprehensively examine the major developoement/trends in Indo-US relations since the early 1990S. Do you visualized the strengthening of ties between the two nations? Substantiate. 60"
		},
		{
			"Year":"2008",
			"Question":"1(a). Politics as a power concept"
		},
		{
			"Year":"2008",
			"Question":"1(b). \"Fascism is the destruction of liberal ideas and institutions in the interest of those who own the instruments of economic power.\" (Laski)"
		},
		{
			"Year":"2008",
			"Question":"1(c). \"The great and chief aim of men's uniting into a Commonwealth and putting themselves under Government is the preservation of property.\" (Locke)"
		},
		{
			"Year":"2008",
			"Question":"(1d). \"Real rights are a result of performance of duty.\" (Mahatma Gandhi)"
		},
		{
			"Year":"2008",
			"Question":"2. Explain the changing analytical perspectives in the development of political theory.60 marks"
		},
		{
			"Year":"2008",
			"Question":"3. \"Human rights are basic moral guarantees that people in all countries and cultures possess, simply because they are people.\" Explain the statement.60"
		},
		{
			"Year":"2008",
			"Question":"4. Critically examine Gramsci's concept of Hegemony.60"
		},
		{
			"Year":"2008",
			"Question":"5(a). \"Swaraj is the culmination of Swadeshi and Sarvodaya.\""
		},
		{
			"Year":"2008",
			"Question":"5(b). The type of Government enshrined in 'the Preamble of the Indian Constitution"
		},
		{
			"Year":"2008",
			"Question":"5(c). Revision in the Election Code of Conduct"
		},
		{
			"Year":"2008",
			"Question":"5(d). The corelation between democracy and development in India"
		},
		{
			"Year":"2008",
			"Question":"6. Discuss the dominant external and internal influences in the framing of the Indian Constitution.60"
		},
		{
			"Year":"2008",
			"Question":"7. Examine the effect of caste and community in Indian politics. Do you foresee their continued relevance in the country's politics? 60"
		},
		{
			"Year":"2008",
			"Question":"8. In what ways do pressure groups and movements exert influence in politics? In the Indian political context, discuss the implications of such influence being exerted. 60"
		},
		{
			"Year":"2008",
			"Question":"9(a). How has geo-economics replaced geo-politics in the present International scenario ?"
		},
		{
			"Year":"2008",
			"Question":"9(b). Outline the constraints SAARC is facing to emerge as an effective regional organisation."
		},
		{
			"Year":"2008",
			"Question":"9(c). How does comparative political sociology help in understanding of socio political process of different countries of the world ?"
		},
		{
			"Year":"2008",
			"Question":"9(d). Elaborate the factors which cause North-South divide in the age of globalisation."
		},
		{
			"Year":"2008",
			"Question":"10. How does functioning of interest groups differ from political parties ? Discuss with appropriate examples.60"
		},
		{
			"Year":"2008",
			"Question":"11. Discuss the realist and neo-realist approaches to the study of International relations.60"
		},
		{
			"Year":"2008",
			"Question":"12. Do you agree with the notion that Marxist approach to the study of International relations is largely based on economic reductionism ? Give reasons. 60"
		},
		{
			"Year":"2008",
			"Question":"13(a). 'The relationship between India and China is characterised by high levels of conflict and cooperation.' Comment."
		},
		{
			"Year":"2008",
			"Question":"13(b). Explain the difference between security dilemma and insecurity dilemma."
		},
		{
			"Year":"2008",
			"Question":"13(c). Outline India's contribution to UN Peace Keeping activities ?"
		},
		{
			"Year":"2008",
			"Question":"13(d). Explain the concept of liegemonic stability'."
		},
		{
			"Year":"2008",
			"Question":"14. `The constant breakdown in WTO negotiations suggest too many disagreements in world politics.' Would you agree ?60"
		},
		{
			"Year":"2008",
			"Question":"15. The growth and possession of WMD has seriously undermined international security. Discuss.60"
		},
		{
			"Year":"2008",
			"Question":"16. Does India's rise as a -major market power in a globalised world mean that it is no longer concerned with the 'new international economic order' that it once championed ? Discuss.60"
		},
		{
			"Year":"2009",
			"Question":"1(a). Political Theory is, quite simply, mans attempt to consciously understand and solve the problems of his group life and organization. It is the disciplined investigation of political problems. Not only to show what a political practice is, but also to show what it means. In showing what a practice means, or what it ought to mean, political theory can alter what it is (Sabine)."
		},
		{
			"Year":"2009",
			"Question":"1(b). Women has always been mans dependent, If not his slave; the two sexes have never shared the world in equality (Simone de Beauvoir)."
		},
		{
			"Year":"2009",
			"Question":"1(c). Western thought, one might say, has been either platonic or anti platonic but hardly ever non-platonic (Popper)."
		},
		{
			"Year":"2009",
			"Question":"1(d). Socialism is a much used hat, whose original shape no one can define (C E M Joad)."
		},
		{
			"Year":"2009",
			"Question":"2(a). Compare and contrast Kautilya and Machiavalli on statecraft. 20"
		},
		{
			"Year":"2009",
			"Question":"2(b). Explain as to why Jeremy Bentham dismisses the theory of natural right as nonsense upon stilts. 20"
		},
		{
			"Year":"2009",
			"Question":"2(c). Comment on the proposition that liberal constitutionalism precedes liberal democracy. 20"
		},
		{
			"Year":"2009",
			"Question":"3. Examine in detail Marxs prescription for ending alienation and reaching the stage of dealienation. 60"
		},
		{
			"Year":"2009",
			"Question":"4. Critically examine Hamza Alavis Formulation of the over developed state. 60"
		},
		{
			"Year":"2009",
			"Question":"5(a). Inter State Committee."
		},
		{
			"Year":"2009",
			"Question":"5(b). Radical Humanism"
		},
		{
			"Year":"2009",
			"Question":"5(c). The Functions, duties and powers of the appropriate National Commission as laid down in clauses (5) (8), and (9) of Articles-338 of the constitution."
		},
		{
			"Year":"2009",
			"Question":"(5d). Implication of the use of Electronic Voting Machine (EVM) on electoral politics."
		},
		{
			"Year":"2009",
			"Question":"6. Answer the questions below"
		},
		{
			"Year":"2009",
			"Question":"6(a). Critically examine the arguments being advanced for review of the present system of appointment of judges to the higher judiciary of the country. 30"
		},
		{
			"Year":"2009",
			"Question":"6(b). Bring out the changing educational profile of the members of the Lok Sabha over the years, up to the present (15th) Lok Sabha."
		},
		{
			"Year":"2009",
			"Question":"7. The OBC politics has challenged the nature of dominant caste politics in the states. Critically examine this statement and bring out your conclusion. 60"
		},
		{
			"Year":"2009",
			"Question":"8. The environmental movements have challenged the policy and pattern of economic development in post independent India. Analyze with examples. 60"
		},
		{
			"Year":"2009",
			"Question":"9(a). Is it necessary to evolve a distinct theoretical framework for analysis emergent politics in the developing world?"
		},
		{
			"Year":"2009",
			"Question":"9(b). What is the significance of the increasing global diffusion of nuclear and long range delivery vehicle technology?"
		},
		{
			"Year":"2009",
			"Question":"9(c). What are the major critiques of liberal internationalization?"
		},
		{
			"Year":"2009",
			"Question":"9(d). Comment on the contribution of global feminism to the consolidation of global society."
		},
		{
			"Year":"2009",
			"Question":"10. Explain how far Deutschs model explains the framework international interdependence. Do you think that the processes of interdependence and integration have grown steadily in the post Cold War Globlisation trajectory? 60"
		},
		{
			"Year":"2009",
			"Question":"11. Explain the role of non state actors, like IMF, World Bank, European Union and MNCs, in modulating and transforming the broad dynamics of international relations. 60"
		},
		{
			"Year":"2009",
			"Question":"12. Examine the comparative advantages of democracy and autocracy in restraining political violence. Do you think that autocratic societies are more prone to political violence? Illustrate your answer with a comparative study of a few societies. 60"
		},
		{
			"Year":"2009",
			"Question":"13(a). Do you think that Indias Look East policy would help a common Asian market, unlike European common market"
		},
		{
			"Year":"2009",
			"Question":"13(b). In the context of developments on the nuclear weapons front in the neighbourhood, do you think that any change in India s defence strategy is indicated?"
		},
		{
			"Year":"2009",
			"Question":"13(c). Identify Indias contributions and assistance in the process of nation-building in South Africa."
		},
		{
			"Year":"2009",
			"Question":"13(d). To what extent is Indias policy in regard to Afghanistan dictated by a vision of Global South, rather than compulsions? "
		},
		{
			"Year":"2009",
			"Question":"14. Examine Indias role in strategic terms with regard to the land-locked countries in South Asia. With regard to Nepal, to what extent has the involvement of major posers such as China, the US and the EU impacted India s strategic interests. 60"
		},
		{
			"Year":"2009",
			"Question":"15. Analyze the basic causes of insurgency and terrorism in two majors areas that are affected in the country. In this regard, to what extent have state policies to counter terrorism been effective in these areas? 60"
		},
		{
			"Year":"2009",
			"Question":"16. Domestic problems and Historic legacies, apart from other factors, constitute major strains on Indian foreign policy. Discuss this statement with suitable examples. 60 "
		},
		{
			"Year":"2010",
			"Question":"1(a). \" Power flows throughout the system like blood in the capillaries of our body.\" (Foucault)"
		},
		{
			"Year":"2010",
			"Question":"1(b). Robert Dahls's concept of deformed polyarchy."
		},
		{
			"Year":"2010",
			"Question":"1(c). ' Personal is political.'"
		},
		{
			"Year":"2010",
			"Question":"1(d). 'Veil of ignorance.'"
		},
		{
			"Year":"2010",
			"Question":"2. (a) Asses the deliberative theories of democracy. 30"
		},
		{
			"Year":"2010",
			"Question":"2. (b) Distinguish between liberal feminism and socialist feminism in detail. 30"
		},
		{
			"Year":"2010",
			"Question":"3. (a) Evaluate Mark's instrumentalist approach to the State. 30"
		},
		{
			"Year":"2010",
			"Question":"3. (b) Compare and contrast Dharmasastra and Arthasastra with reference to State power. 30"
		},
		{
			"Year":"2010",
			"Question":"4. (a) Do you think that the modern nation - state has been declining in the wake of globalization? Justify your answer. 30"
		},
		{
			"Year":"2010",
			"Question":"4 (b) Critically examine the cultural relativist approach to human rights. 30"
		},
		{
			"Year":"2010",
			"Question":"5(a). Indian nationalism as depicted in S.N. Banerjea's 'A Nation in the making'."
		},
		{
			"Year":"2010",
			"Question":"5(b). Upsurge in political aprticipation among the marginalised communities in the Indian General Elections during the last two decades."
		},
		{
			"Year":"2010",
			"Question":"5(c). Inter- State water disputes."
		},
		{
			"Year":"2010",
			"Question":"(5d). Economic liberalisation and uneven development among Indian States."
		},
		{
			"Year":"2010",
			"Question":"6. (a) Assess the effectiveness of the National Human Rights Commission in redressing grievances pertaining to human rights violations in India. 30"
		},
		{
			"Year":"2010",
			"Question":"6. (b) \" Minorities are the natural custodians of the secular state.\" (D.E. Smith). Discuss. 30"
		},
		{
			"Year":"2010",
			"Question":"7(a). \" The Constituent Assembly was a one party body in an essentially one party country . The Assembly was the Congress and the Congress was India.\" ( Granville Austin)"
		},
		{
			"Year":"2010",
			"Question":"7(b). \"Articles 2 and 3 of the Indian Constitution are inconsistent with the spirit of federalism.\""
		},
		{
			"Year":"2010",
			"Question":"(7c). the principle of collective responsibility a la the cabinet system of government, has eroded in the context of emergence of coalitions governments in India."
		},
		{
			"Year":"2010",
			"Question":"8. (a) In what ways do civil liberties and human rights movements influence the working of Indian democracy ? Give your answer with suitable examples. 30"
		},
		{
			"Year":"2010",
			"Question":"8. (b) Do you think that post- 1991 reforms in India mark a significant shift from the Nehruvian model of economic development ? Justify your answer. 30"
		},
		{
			"Year":"2010",
			"Question":"9(a). How is the modern comparative politics-- approach different from the traditional legalinstitutional approach?"
		},
		{
			"Year":"2010",
			"Question":"9(b). Examine the changing nature of security in the recent times."
		},
		{
			"Year":"2010",
			"Question":"9(c). Explain the meaning and application of the concept of 'strategic engagement'."
		},
		{
			"Year":"2010",
			"Question":"10. (a) Examine the post-modernist critique of Realism in international politics.20"
		},
		{
			"Year":"2010",
			"Question":"10. (b) Assess in detail the prospects of the emergence of a nuclear-weapons-free world.40"
		},
		{
			"Year":"2010",
			"Question":"11. (a) Discuss the different perspectives on global environment that have emerged in the context of the Copenhagen Summit.20"
		},
		{
			"Year":"2010",
			"Question":"11(b) Critically examine globalisation from a Third World perspective.40"
		},
		{
			"Year":"2010",
			"Question":"12. Bring out your perspectives on the following in about 200 words each :20x3=60"
		},
		{
			"Year":"2010",
			"Question":"12(a). Plausible aims of the Non-Aligned Movement in the post-Cold War period"
		},
		{
			"Year":"2010",
			"Question":"12(b). The indications of the emergence of a global civil society"
		},
		{
			"Year":"2010",
			"Question":"12(c). Should National Interest be viewed as a constant category or is it situation-specific?"
		},
		{
			"Year":"2010",
			"Question":"13(a). Can Israel be termed a 'natural ally' of India?"
		},
		{
			"Year":"2010",
			"Question":"13(b). Examine India's response to the Af-Pak policy of the US."
		},
		{
			"Year":"2010",
			"Question":"13(c). Bring out the role played by Indian armed forces in UN peace-keeping efforts in various parts of the world."
		},
		{
			"Year":"2010",
			"Question":"14. (a) Examine the nature of the issues currently being debated with the European Union.20"
		},
		{
			"Year":"2010",
			"Question":"14 (b) Assess the problems being faced by India on account of illegal migration into the country.40"
		},
		{
			"Year":"2010",
			"Question":"15. (a) Comment on the recent trends in Russia's foreign policy.20"
		},
		{
			"Year":"2010",
			"Question":"15 (b) \"The UN today is more of a social service organisation than an exclusively securityoriented body.\" Critically examine.40"
		},
		{
			"Year":"2010",
			"Question":"16. (a) Bring out India's perspectives and concerns on reform in the UN Security Council.20"
		},
		{
			"Year":"2010",
			"Question":"16 (b) Would it be to India's benefit if it were to pursue a more serious relationship with SouthEast Asia? Critically evaluate.40"
		},


		
		{
			"Year":"2011",
			"Question":"1(a). “The State is a creation of nature and man is by nature a political animal.” (Aristotle)"
		},
		{
			"Year":"2011",
			"Question":"1(b). “The worth of a State… Is the worth of individuals composing it.” (J. S. Mill)"
		},
		{
			"Year":"2011",
			"Question":"1(c). Hobbies as an individualist"
		},
		{
			"Year":"2011",
			"Question":"1(d). Views of Gandhi and Ambedkar on ‘social justice’"
		},
		{
			"Year":"2011",
			"Question":"2. Answer the following questions"
		},
		{
			"Year":"2011",
			"Question":"2(a). Make an assessment of the post-colonial understanding of State. 30"
		},
		{
			"Year":"2011",
			"Question":"2(b). Examine the significance of the behavioural revolution in politics. 30"
		},
		{
			"Year":"2011",
			"Question":"3. Answer the following questions"
		},
		{
			"Year":"2011",
			"Question":"3(a). It is said where there is no law there is no liberty. Give your views on this statement. 30"
		},
		{
			"Year":"2011",
			"Question":"3(b). Examine the debate on the ‘End of Ideology’ 30"
		},
		{
			"Year":"2011",
			"Question":"4. Answer the following questions"
		},
		{
			"Year":"2011",
			"Question":"4(a). Attempt a Comparative examination of the views of Marx and Weber on ‘Power’ 30"
		},
		{
			"Year":"2011",
			"Question":"4(b). Examine the Participatory Model of Democracy. 30"
		},
		{
			"Year":"2011",
			"Question":"5. Comment on the following in about 150 words each: 15 × 4 = 60"
		},
		{
			"Year":"2011",
			"Question":"5(a). Dalit perspective on Indian National Movement"
		},
		{
			"Year":"2011",
			"Question":"5(b). Significance of the Civil Disobedience Movement"
		},
		{
			"Year":"2011",
			"Question":"5(c). Role of National Commission for Scheduled Castes"
		},
		{
			"Year":"2011",
			"Question":"5(d). Trade union as pressure group in Indian politics"
		},
		{
			"Year":"2011",
			"Question":"6. Answer the following questions"
		},
		{
			"Year":"2011",
			"Question":"6(a). Examine the significance of the Directive Principles of State Policy in achieving the goal of socio-economic justice. 30"
		},
		{
			"Year":"2011",
			"Question":"6(b). In normal conditions, the Governor is a constitutional executive but in case of constitutional crisis, he can become a powerful and effective executive. Discuss 30"
		},
		{
			"Year":"2011",
			"Question":"7. Critically examine and comment on the assertions given below in about 200 words each: 20 × 3 = 60"
		},
		{
			"Year":"2011",
			"Question":"7(a). It is not constitutional law but political factors that ultimately determine CentreStates relations in India."
		},
		{
			"Year":"2011",
			"Question":"7(b). Indian politics has influenced caste and caste has influenced Indian politics."
		},
		{
			"Year":"2011",
			"Question":"7(c). Secularism in Indian politics is a myth."
		},
		{
			"Year":"2011",
			"Question":"8. Answer the following questions"
		},
		{
			"Year":"2011",
			"Question":"8(a). Make an assessment of the role of the Election Commission of India in the conduct of free and fair elections. 30"
		},
		{
			"Year":"2011",
			"Question":"8(b). Examine the changing pattern of electoral behaviour in India. 30"
		},
		{
			"Year":"2011",
			"Question":"9(a). “Either terrorism triumphs or civilization triumphs.” Comment on the above statement. 20"
		},
		{
			"Year":"2011",
			"Question":"9(b). What is New Social Movement (NSM)? Explain the main challenges of the NSM in the developing countries 20"
		},
		{
			"Year":"2011",
			"Question":"9(c). Examine the nature and dynamics of contemporary globalization. 20"
		},
		{
			"Year":"2011",
			"Question":"10. Answer the following questions"
		},
		{
			"Year":"2011",
			"Question":"10(a). What is comprehensive approach to national security? 20"
		},
		{
			"Year":"2011",
			"Question":"10(b). Do you agree with the view that over-widening of the concept of ‘national security’ has made it a more amorphous concept? Discuss. 40"
		},
		{
			"Year":"2011",
			"Question":"11(a). “Structural-functional approach to political analysis focuses more on status quoism, and less on change.” Elucidate. 30"
		},
		{
			"Year":"2011",
			"Question":"11(b). Explain the uses of systems approach in international relations and examine the relevance of Kaplan's system analysis. 30"
		},
		{
			"Year":"2011",
			"Question":"12(a). How for the efforts to maintain international order in the post-Cold War period by the UN have been successful? 30"
		},
		{
			"Year":"2011",
			"Question":"12(b). What are the major impediments to UN Security Council reform? 30"
		},
		{
			"Year":"2011",
			"Question":"13(a). Explain the role of the Parliament in the shaping of 123 Agreement between India and the US on Civil-nuclear Cooperation."
		},
		{
			"Year":"2011",
			"Question":"13(b). Do you think that India should sign a treaty with China on water-sharing of Brahmaputra River, similar to what she did with Nepal and other neighboring states?"
		},
		{
			"Year":"2011",
			"Question":"13(c). “While India opposes NPT as discriminatory, it opposes CTBT on the ground of ineffectiveness.” Comment."
		},
		{
			"Year":"2011",
			"Question":"14(a). “India's policy of non-alignment was based on both idealist and realist calculations.”"
		},
		{
			"Year":"2011",
			"Question":"14(b). “India's policy in post-Cold War era is tilted towards pragmatism and wisdom.”"
		},
		{
			"Year":"2011",
			"Question":"15(a). Explain the major flaws in India's ‘Look East Policy’ Is it possible to steer and implement the policy successfully in views of China's emergence as a high-tech power in Asia-Pacific? 20 + 10 = 30"
		},
		{
			"Year":"2011",
			"Question":"15(b). To what extent is multi-lateralism a reality with regard to India's constructive strategic partnership with Central Asian states? 30"
		},
		{
			"Year":"2011",
			"Question":"16. Answer the following questions"
		},
		{
			"Year":"2011",
			"Question":"16(a). Explain the impact of coalition politics on India's Foreign Policy since late 1990S. 30"
		},
		{
			"Year":"2011",
			"Question":"16(b). Discuss the implications of ethnicity and nation-building in South Asia, and their impact in the relations of states within South Asia. 30 "
		},
		{
			"Year":"2012",
			"Question":"1.a. Difference between normative and empirical theories of politics."
		},
		{
			"Year":"2012",
			"Question":"1.b. Difference between equality of opportunity and equality of outcome."
		},
		{
			"Year":"2012",
			"Question":"1.c. Difference between Liberal and Radical forms of Feminism."
		},
		{
			"Year":"2012",
			"Question":"1.d. Hannah Arendt’s conception of the ‘political."
		},
		{
			"Year":"2012",
			"Question":"1.e.. Issues of debate in contemporary democratic theory."
		},
		{
			"Year":"2012",
			"Question":"2.a. What is meant bu ‘relative autonomy’ of State in Marxist analysis?"
		},
		{
			"Year":"2012",
			"Question":"2.b. Comment on the Marxist and Radical Humanist phases of M.N. Roy’s thought."
		},
		{
			"Year":"2012",
			"Question":"2.c. Examine the multi-cultural perspectives on rights."
		},
		{
			"Year":"2012",
			"Question":"3.a. ‘Locke is an individualist out and out’. Substantiate this statement."
		},
		{
			"Year":"2012",
			"Question":"3.b. Distinguish between the concepts of legitimacy and hegemony."
		},
		{
			"Year":"2012",
			"Question":"3.c. Why is ‘affirmative action’ important in provision of equal opportunity?"
		},
		{
			"Year":"2012",
			"Question":"4.a. Examine the Gandhian idea of village community as an ideal unit of selfgovernance."
		},
		{
			"Year":"2012",
			"Question":"4.b. Draw parallels between Arthashastra tradition and the ‘Realist’ tradition represented by Machiavelli."
		},
		{
			"Year":"2012",
			"Question":"4.c. Write a note on the Buddhist tradition in Indian political thought."
		},
		{
			"Year":"2012",
			"Question":"5.a. Efficacy of Satygraha as moral resistance colonial rule."
		},
		{
			"Year":"2012",
			"Question":"5.b. Judicial activism and social change."
		},
		{
			"Year":"2012",
			"Question":"5.c. Role of National Commission for Women in India"
		},
		{
			"Year":"2012",
			"Question":"5.e. Demands for the creation of new States in India"
		},
		{
			"Year":"2012",
			"Question":"5.f. Doctrine of Basic Structure of the Indian Constitution."
		},
		{
			"Year":"2012",
			"Question":"6.a. Discuss the extent to which the Indian Constitution reflects successful reconciliation of alternative perspectives. "
		},
		{
			"Year":"2012",
			"Question":"6.b. Examine the relevance of Directive Principles in the era of liberalisation and globalization."
		},
		{
			"Year":"2012",
			"Question":"7.a. Examine the impact of coalition-politics on Indian political system."
		},
		{
			"Year":"2012",
			"Question":"7.b. Critically examine Green Revolution as a strategy for sustainable agriculture development."
		},
		{
			"Year":"2012",
			"Question":"8.a. Examine the efficacy of available mechanisms for resolving inter-State dispute in India."
		},
		{
			"Year":"2012",
			"Question":"8.b. Discuss the impact of environmentalist movement on government policies in recent years."
		},
		{
			"Year":"2012",
			"Question":"9.a. Examining political phenomena through a process of cross-global investigation has become the fundamental function of Comparative Politics.” Discuss."
		},
		{
			"Year":"2012",
			"Question":"9.b. How did the struggle for representation increase the level and quality of democracy in the industrial societies?"
		},
		{
			"Year":"2012",
			"Question":"9.c. Do you agree that liberal international theories are essentially ‘Eurocentric’ and not necessarily imperialist?"
		},
		{
			"Year":"2012",
			"Question":"9.d. Review the increasing role of Multi National Corporations in the policy making process of developing countries."
		},
		{
			"Year":"2012",
			"Question":"9.e. Why is the ‘polarity of power’ thesis less relevant and meaningful in the present architecture of ‘balance of power’?"
		},
		{
			"Year":"2012",
			"Question":"10.a. What are the great debates between ‘classical’ and ‘modern’ realists ? Is there any thin line of continuity between these two traditions?"
		},
		{
			"Year":"2012",
			"Question":"10.b. Does the perspective of Dependencies Theory offer a robust critique on the nature of mainstream development process taking place in Africa and Latin America?"
		},
		{
			"Year":"2012",
			"Question":"10.c. Is ‘terrorism’ an essentially ‘contested’ concept ? What are the different manifestations of ‘terrorism’ as a concept, and as practice?"
		},
		{
			"Year":"2012",
			"Question":"11.a. What have been the main challenges to India’s foreign policy in the last two decades? Are these essentially ‘concerns’ with domestic politics or ‘strategic’ issues?"
		},
		{
			"Year":"2012",
			"Question":"11.b. What constitutes ‘national security discourses’ ? How far have the IR Feminists questioned how ‘security’ has been problematised ?"
		},
		{
			"Year":"2012",
			"Question":"11.c. Evaluate the nature and distinctions of anomic and associational interest groups in the pressure politics of developing countries."
		},
		{
			"Year":"2012",
			"Question":"11.d. Elucidate the transdisciplinary nature of modern comparative politics and identify the modern comparative politics and identify the contributions of political sociologists towards this goal."
		},
		{
			"Year":"2012",
			"Question":"12.a. How far have the UN reform efforts of 2004-05, transformed the concept of ‘Sovereignty’ as a fundamental principle of International Law ? Do you think that UN reform discourse represents a ‘biopolitical reprogramming’ of contemporary sovereignty and global governance?"
		},
		{
			"Year":"2012",
			"Question":"12.b. How would you explain the future of ‘Nuclear Deterrence’ ? Do you think that ‘preventive war’ is a good substitute for Nuclear Deterrence ?"
		},
		{
			"Year":"2012",
			"Question":"12.c. examine the significance of ideological and policy aspects in the structural growth of modern political parties."
		},
		{
			"Year":"2012",
			"Question":"13.a. Illustrate the issue of illegal cross-border migration in South Asia and its impact on regional alliances and bilateral relations."
		},
		{
			"Year":"2012",
			"Question":"13.b. “Human Rights constitute the Third Generation of Rights.” Analyse the range and complex dimension of Human Rights in the globalised era."
		},
		{
			"Year":"2012",
			"Question":"13.c. Is there any linkage between a shift in China’s relations with Japan to a perceived shift in her relations with India? Examine in the light of China’s so-called ‘antiencirclement struggle’."
		},
		{
			"Year":"2012",
			"Question":"13.d. Comment on the essential elements of India’s foreign policy that are required to secure energy and security in the Indian Ocean region."
		},
		{
			"Year":"2012",
			"Question":"13.e. is it correct to conclude that the ‘Arab Street’ revolutions have radically altered the political power scenario of the West Asian countries?"
		},
		{
			"Year":"2012",
			"Question":"14.a. How would you describe the contemporary words beyond the language of ‘North/South’ and ‘Developed/Developing’? Is the present transformation driven by domestic compulsion, or external overall crisis of the global economy?"
		},
		{
			"Year":"2012",
			"Question":"14.b. Is power a zero-sum or variable game in international relations? Can zero-sum game explain the mixture of conflict and cooperation of the present dynamics of international relations?"
		},
		{
			"Year":"2012",
			"Question":"14.c. Assess the scope and importance of setting up the Public Diplomacy Division in the Ministry of External Affairs in strengthening India’s Foreign Policy."
		},
		{
			"Year":"2012",
			"Question":"15.a. The effort in restricting illegal migration from Mexico to U.S.A. and Canada has been one major gain for the United States through NAFTA. Comment."
		},
		{
			"Year":"2012",
			"Question":"15.b. Bring out linkage between environmental degradation and neo-corporatism in the globalised era."
		},
		{
			"Year":"2012",
			"Question":"15.c. “Nations and States have become virtually synonymous.” Elucidate. "
		},
		{
			"Year":"2012",
			"Question":"15.d. “Despite the potentialities, India’s ‘Look East Policy’ requires a major course correction”. Discuss."
		},
		{
			"Year":"2012",
			"Question":"16.a. Do you think that Iran’s ‘victory’ in the NAM on the nuclear issue has brought in a new debate on the relevance of the Non-Aligned Movement.?"
		},
		{
			"Year":"2012",
			"Question":"16.b. What are the political and environmental contexts of the Siachen Glacier conflict? Comment on the possibility of environmental peace-keeping and collaborative arrangements being worked out with Pakistan on this aspects."
		},
		{
			"Year":"2012",
			"Question":"16.c. Examine the idea of a ‘balance’ between ‘security’ and ‘liberty’ in modern international politics. Do you think that the liberal international order is more ‘security-friendly’?"
		},
		{
			"Year":"2013",
			"Question":"1(a)“Personal is political”"
		},
		{
			"Year":"2013",
			"Question":"1(b)“Original position”"
		},
		{
			"Year":"2013",
			"Question":"1(c)“Covenants without swords are but words, and of no strength to secure a man at all.”"
		},
		{
			"Year":"2013",
			"Question":"1(d)Sri Aurobindo’s “idea of freedom”"
		},
		{
			"Year":"2013",
			"Question":"1(e)Sri Ahmed Khan as modernizer"
		},
		{
			"Year":"2013",
			"Question":"Q.2(a)Discuss the communitarian critique of liberalism. 20"
		},
		{
			"Year":"2013",
			"Question":"2(b)Examine Ambedkar’s critique of Marxism. 15"
		},
		{
			"Year":"2013",
			"Question":"2(c)Explain, as per Gramsci, the distinction between hegemony and domination. 15"
		},
		{
			"Year":"2013",
			"Question":"Q.3(a)Analyze the relationship between natural rights and human rights. 20"
		},
		{
			"Year":"2013",
			"Question":"3(b)Examine the significance of Dharma in Ancient Indian political thought. 15"
		},
		{
			"Year":"2013",
			"Question":"3(c)Discuss in what sense Max’s understanding of state can be considered as materialistic. 15"
		},
		{
			"Year":"2013",
			"Question":"Q.4(a)Explain Berlin’s notion of value pluralism. 20"
		},
		{
			"Year":"2013",
			"Question":"4(b)Analyse,as per Kautilya,the Saptanga theory of the state. 15"
		},
		{
			"Year":"2013",
			"Question":"4(c)Comment on the Assertion of Laslett that Filmer and not Hobbes was the main antagonist of Locke. 15"
		},
		{
			"Year":"2013",
			"Question":"5(a)Marxist understanding of India’s freedom movement"
		},
		{
			"Year":"2013",
			"Question":"5(b)Significance of the Preamble"
		},
		{
			"Year":"2013",
			"Question":"5(c)Decline of Indian Parliament"
		},
		{
			"Year":"2013",
			"Question":"5(d)Gandhian perspective of development and its contemporary relevance."
		},
		{
			"Year":"2013",
			"Question":"5(e)Compare and contrast Chipko Movement with Narmada Bachao Andolan."
		},
		{
			"Year":"2013",
			"Question":"Q.6(a)Explain the phenomenon of ethnic politics in India in recent times."
		},
		{
			"Year":"2013",
			"Question":"6(b)Analyse the significance of Article 32 of the Indian Constitution."
		},
		{
			"Year":"2013",
			"Question":"6(c)Examine the role of Supreme Court as the final interpreter of the Indian Constitution."
		},
		{
			"Year":"2013",
			"Question":"Q.7(a)“Cooperative federalism produces a strong central, or general government, yet it does not necessarily result in weak provincial governments that are largely administrative agencies for central policies. Indian federation has demonstrated this.”(Granville Austin) Examine the uniqueness of Indian federalism in the light of the above statement. 20m"
		},
		{
			"Year":"2013",
			"Question":"7(b)Explain to what extent the concept of “one-party dominance”(W.H.Morris-Jones)model is relevant in Indian policy today. 20m"
		},
		{
			"Year":"2013",
			"Question":"7(c)Analyze the position of the Prime Minister of India in a coalition regime. 20m"
		},
		{
			"Year":"2013",
			"Question":"Q.8(a)Examine the significance of the verdicts of the Supreme Court in the Golaknath and Keshavananda Bharati cases for an understanding of the scope of Article 368 in regard to Fundamental Rights."
		},
		{
			"Year":"2013",
			"Question":"8(b)Point out and comment on the historic importance of the document “Towards Equality(1974),for women’s movement in India.”"
		},
		{
			"Year":"2013",
			"Question":"8(c)Examine the changing structure of Panchayati Raj instituions with special reference to the 73rd Constituiton Amendment Act."
		},
		{
			"Year":"2013",
			"Question":"1.a.Identify the elements of change in India’s foreign policy."
		},
		{
			"Year":"2013",
			"Question":"1.b.Sketch the leadership role of India in WTO negotiations."
		},
		{
			"Year":"2013",
			"Question":"1.cExamine the recent developments in India-Japan relationship."
		},
		{
			"Year":"2013",
			"Question":"1.d.Bring out the objectives of India seeking permanent seat in Security Council"
		},
		{
			"Year":"2013",
			"Question":"1.e.Is India’s Nuclear doctrine a viable one?"
		},
		{
			"Year":"2013",
			"Question":"2.a.Compare and contrast social movements in advanced industrial and developing societies."
		},
		{
			"Year":"2013",
			"Question":"2.b.Give reasons for Regionalism of world politics."
		},
		{
			"Year":"2013",
			"Question":"2.c.Compare and Contrast Sin-India approaches to global Environmental concerns."
		},
		{
			"Year":"2013",
			"Question":"3.a.What roles do norms, taboos and epistemic play in the context of nuclear proliferation?"
		},
		{
			"Year":"2013",
			"Question":"3.b.Substitantiate APEC as a regional economic and trade arrangement."
		},
		{
			"Year":"2013",
			"Question":"3.c.Identify the major changes in the International Political economy in post Cold War period."
		},
		{
			"Year":"2013",
			"Question":"4.a.Is the rise of social movement a sign of opening up of popular space in political process or decline of representative politics?Examine."
		},
		{
			"Year":"2013",
			"Question":"4.b.Highlight the major features of Non-alignment 2.0 document"
		},
		{
			"Year":"2013",
			"Question":"4.c.Identify the role and place of Gender in the global economy."
		},
		{
			"Year":"2013",
			"Question":"5.a.Identify the challenges to American hegemony in post Soviet world."
		},
		{
			"Year":"2013",
			"Question":"5.b.What does the pace of nuclear proliferation in post Cold War suggest?"
		},
		{
			"Year":"2013",
			"Question":"5.c.State the place of Gender Justice in global agenda."
		},
		{
			"Year":"2013",
			"Question":"5.d.“Global commons belong to global society and requires global attention”.Comment."
		},
		{
			"Year":"2013",
			"Question":"5.e.Sketch the journey of global political economy from Washington consensus to the present."
		},
		{
			"Year":"2013",
			"Question":"6.a.Examine major principles of State centric world views."
		},
		{
			"Year":"2013",
			"Question":"6.b.How does Marxist approcah explain contemporary International Relations?"
		},
		{
			"Year":"2013",
			"Question":"6.c.‘National Interests are Dynamic’. Identify the dynamic nature of National Interests in the contemporary world polities with suitable examples."
		},
		{
			"Year":"2013",
			"Question":"7.a.‘The economic content of India’s foreign trade is increasingly growing’. Substantiate the statement with economic diplomatic engagements of India in the last decade."
		},
		{
			"Year":"2013",
			"Question":"7.b.Write a note on Intellectual precursors of Realism."
		},
		{
			"Year":"2013",
			"Question":"7.c.‘Building ‘peace by pieces’ is the basis of functionalism’. Elaborate."
		},
		{
			"Year":"2013",
			"Question":"8.a.‘Transnational actors have become driving forces of global politics’. Elaborate."
		},
		{
			"Year":"2013",
			"Question":"8.b.‘A minimal State ensures maximum of Individual Liberty’. Examine the concept of Minimal State."
		},
		{
			"Year":"2013",
			"Question":"8.c.‘Collective Security and Collective Defense are the institutional and State mechanism to sustain the domination of powers that be in International politics’. Elaborate."
		},
		{
			"Year":"2014",
			"Question":"1.a.” … political theory is not an escape mechanism but an arduous calling.” ( John Plamanetz)"
		},
		{
			"Year":"2014",
			"Question":"1.b.“All silencing of discussion is an assumption of infallibility.” (J. S. Mill)"
		},
		{
			"Year":"2014",
			"Question":"1.c.“Nationalism is not a mere political programme but a way of life like religion.” (Aurobindo Ghose)"
		},
		{
			"Year":"2014",
			"Question":"1.d.“India has thrown up a form of judicial democracy that has no parallel anywhere else, and has nurtured a kind of civil society that is uniquely its own.” (Bhikhu Parekh)"
		},
		{
			"Year":"2014",
			"Question":"1.e.“Power is never the property of an individual; it belongs to a group and remains in existence only so long as the group keeps together.” ( Hannah Arendt)"
		},
		{
			"Year":"2014",
			"Question":"2.a.Comment on the view that socialism in the 21st century may be reborn as anti-capitalism. 20 marks"
		},
		{
			"Year":"2014",
			"Question":"2.b.Examine the conditions that are required for the maintenance of legitimacy in modern societies. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"2.c.Evaluate the contributions of Buddhist tradition to Indian political thought. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"3.a.Explicate the conception of justice in the critiques of communitarian theorists. 20 marks"
		},
		{
			"Year":"2014",
			"Question":"3.b.Examine the conception of the State in the ideologies of Fascism and Marxism. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"3.c.How is liberty a precondition for equality? Explicate the relationship between equality and liberty. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"4.a.Explain how Machiavelli’s application of empirical method to human affairs marks an important stage in the evolution of political science. 20 marks"
		},
		{
			"Year":"2014",
			"Question":"4.b.Central to Aristotle’s political thought is his classification of the different types of political constitutions in the Politics. Evaluate. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"4.c.Explicate the features of deliberative democracy. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"5.a.The dilemmas of the human rights movements in India"
		},
		{
			"Year":"2014",
			"Question":"5.b.Relation between ethnicity and democracy in India"
		},
		{
			"Year":"2014",
			"Question":"5.c.Increasingly higher focus on Directive Principles of State Policy"
		},
		{
			"Year":"2014",
			"Question":"5.d.Marginalization of the left ideology in India"
		},
		{
			"Year":"2014",
			"Question":"5.e.The role of the Comptroller and Auditor General of India in promoting good governance"
		},
		{
			"Year":"2014",
			"Question":"6.a.Discuss the working of the National Commission for Scheduled Castes to curb violence against Dalits. 20 marks"
		},
		{
			"Year":"2014",
			"Question":"6.b.Examine the scope and limitations of women’s movements in India. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"6.c.Explain how peasant movements promoted nationalist ideas during the struggle for Indian independence. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"7.a.Discuss the nature of reforms of the electoral process in India and explain the further scope for reforms. 20 marks"
		},
		{
			"Year":"2014",
			"Question":"7.b.Examine the debates on the appointment procedure of judges to the higher judiciary in India. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"7.c.Explain how the participation of women impacted the functioning of rural local bodies in India. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"8.a.Explain how pressure groups have been influencing public policy-making with suitable illustrations. 20 marks"
		},
		{
			"Year":"2014",
			"Question":"8.b.What are the provisions for constitutional protection of right to freedom of religion and how far have they succeeded in promoting secularism in India? 15 marks"
		},
		{
			"Year":"2014",
			"Question":"8.c.Account for the changes in the socio-economic profile of legislators during last one decade in India. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"1.a.Party system in India is neither western nor indigenous. Explain."
		},
		{
			"Year":"2014",
			"Question":"1.b.In what respect is the new social movement new in nature? Discuss."
		},
		{
			"Year":"2014",
			"Question":"1.c.Do you agree that the U.N. has failed to contain transnational terrorism? Elaborate your answer with examples."
		},
		{
			"Year":"2014",
			"Question":"1.d.“The Feminist approach to international politics is biased.” Comment."
		},
		{
			"Year":"2014",
			"Question":"1.e“Ukraine crisis is a product of power politics and geo-politics.” Comment."
		},
		{
			"Year":"2014",
			"Question":"2.a.“Despite so many agreed areas of cooperation, innumerable institutional mechanisms and a permanent secretariat, South Asian Association for Regional Cooperation (SAARC) has not taken off as a meaningful regional grouping.” Discuss. 20 marks"
		},
		{
			"Year":"2014",
			"Question":"2.b.Critically evaluate the approaches of global south towards addressing environment concerns. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"2.c.Critically assess the changing nature of the concept of national security. 15"
		},
		{
			"Year":"2014",
			"Question":"3.a.Argue a case for U.N. reform in the context of changing global milieu. 20 marks"
		},
		{
			"Year":"2014",
			"Question":"3.b.Who was Mr. ‘X’ in international politics? Elaborate his approach to foreign policy. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"3.c.“Morton A. Kaplan’s system theory is contrary to the fundamental precepts of systems approach.” Comment. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"4.a.How do you explain the growing importance of multi-national corporations (MNCs) and civil society in contemporary international politics? 20 marks"
		},
		{
			"Year":"2014",
			"Question":"4.b.What is ‘global village’? Elaborate its main characteristics and also the factors that contributed to its growth. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"4.c.Discuss the main factors that have contributed to the gradual transformation of the world from ‘Billiard Ball Model’ to ‘Cobweb Model’. 15"
		},
		{
			"Year":"2014",
			"Question":"5.a.Is India’s quest for a permanent seat in the Security Council a possibility or just a pipedream? Elaborate with reasons."
		},
		{
			"Year":"2014",
			"Question":"5.b.“Afghanistan is a litmus test for India’s ascendance as a regional and global power.” Discuss."
		},
		{
			"Year":"2014",
			"Question":"5.c.“EU – India relations have a long way to go before they can purposely be termed strategic.” Discuss."
		},
		{
			"Year":"2014",
			"Question":"5.d.Do you agree with the view that the USA is of late willing to treat India as a partner rather than merely a camp-follower? Give reasons for your answer."
		},
		{
			"Year":"2014",
			"Question":"5.e.Discuss the grounds for India’s opposition to NPT."
		},
		{
			"Year":"2014",
			"Question":"6.a.Evaluate the recent changes in Indo – Japan relations. 20 marks"
		},
		{
			"Year":"2014",
			"Question":"6.b.“Federal units are critical in the making of India’s foreign policy.” Examine this statement with reference to the role of West Bengal vis-à-vis Bangladesh. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"6.c.“India’s policy of non-alignment has been guided by the genius of the Indian people and their interests.” Explain. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"7.a.Analyse the drivers of Indo – Russian relations in the post-Cold-War era. 20 marks"
		},
		{
			"Year":"2014",
			"Question":"7.b.Examine the implications of turmoil in Iraq and West Asia for India’s security and foreign policy concerns. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"7.c.Evaluate India’s participation in United Nations peace-keeping operations over the years. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"8.a.The Ministry of External Affairs is losing its importance in the making of India’s foreign policy with the parallel rise of the P.M.O. Explain. 20 marks"
		},
		{
			"Year":"2014",
			"Question":"8.b.“Some of the major changes that occurred in India’s foreign policy after the Sino – India war in 1962 were within the larger framework of continuity.” Discuss. 15 marks"
		},
		{
			"Year":"2014",
			"Question":"8.c.In the history of foreign policy, seldom have relations between any two nations blossomed as fast as they have in the case of India and Israel. Discuss. 15 marks"
		},
		{
			"Year":"2015",
			"Question":"1(a) Idea of Natural Rights"
		},
		{
			"Year":"2015",
			"Question":"1(b) Aristotle’s Conception of Equality"
		},
		{
			"Year":"2015",
			"Question":"1(c) ‘Difference Principle’ in Rawls’ Theory of Justice"
		},
		{
			"Year":"2015",
			"Question":"1(d) Difference between Participatory and Deliberative Democracy"
		},
		{
			"Year":"2015",
			"Question":"1(e) Gandhi’s Views on State"
		},
		{
			"Year":"2015",
			"Question":"2. (a) Examine the challenges to sovereignty of the State in the contemporary world.           20"
		},
		{
			"Year":"2015",
			"Question":"2(b) Discuss the key features of pre-Marxist socialist theory.             15"
		},
		{
			"Year":"2015",
			"Question":"2(c) Compare and contrast the views of Kautilya and Machiavelli on Statecraft.                 15"
		},
		{
			"Year":"2015",
			"Question":"3. (a) “Plato was an enemy of the open society.” (Popper) Comment.                      20"
		},
		{
			"Year":"2015",
			"Question":"3(b) Discuss the relationship between base and superstructure in Marxist theory.             15"
		},
		{
			"Year":"2015",
			"Question":"3(c) Distinguish between Power and Authority.                15"
		},
		{
			"Year":"2015",
			"Question":"4. (a) Discuss the ‘crisis of legitimacy’ in capitalist societies. (Habermas)                    20"
		},
		{
			"Year":"2015",
			"Question":"4(b) Discuss Gramsci’s notion of ‘organic intellectuals’               15"
		},
		{
			"Year":"2015",
			"Question":"4(c) Discuss David Easton’s model of systems analysis.             15"
		},
		{
			"Year":"2015",
			"Question":"5(a) Secularism in the Indian Constitution"
		},
		{
			"Year":"2015",
			"Question":"5(b) Satyagraha as a Strategy in the Indian National Movement"
		},
		{
			"Year":"2015",
			"Question":"5(c) 99th Amendment of the Indian Constitution"
		},
		{
			"Year":"2015",
			"Question":"(d) Structure and Function of NITI Aayog"
		},
		{
			"Year":"2015",
			"Question":"(e) Cooperative Federalism in India"
		},
		{
			"Year":"2015",
			"Question":"6. (a) Discuss the efficacy of judicial review in India.               20"
		},
		{
			"Year":"2015",
			"Question":"6(b) Critically analyze the discretionary powers granted to the Governor by the Indian Constitution.          15"
		},
		{
			"Year":"2015",
			"Question":"6(c) “Identity politics has trumped development politics in India.” Comment.            15"
		},
		{
			"Year":"2015",
			"Question":"7. (a) In the light of neo-economic policies adopted since 1991, examine the relevance of the term ‘socialist’ in the Preamble of the Indian Constitution.              20"
		},
		{
			"Year":"2015",
			"Question":"7(b) Identify the contested areas in Centre-State relations in India.              15"
		},
		{
			"Year":"2015",
			"Question":"7(c) Discuss the ‘Right to Education’ and the concerns raised by it.                  15"
		},
		{
			"Year":"2015",
			"Question":"8. (a) Examine the role of Panchayati Raj Institutions and Urban Local Bodies in deepening of democracy in India.               20"
		},
		{
			"Year":"2015",
			"Question":"8(b) Compare the Nehruvian and Gandhian models of development.                    15"
		},
		{
			"Year":"2015",
			"Question":"8(c) Account for the rise of regional political parties and assess their role in contemporary India.       15"
		},
		{
			"Year":"2015",
			"Question":"1(a) Which are the major approaches of comparative politics? Explain in brief, the political economy approach to the study of comparative inquiry."
		},
		{
			"Year":"2015",
			"Question":"2(b) Do you subscribe to the view that the modern constructs of the State and politics are pre-eminently Eurocentric and not indigenous and appropriate for the analysis of non-western societies?"
		},
		{
			"Year":"2015",
			"Question":"3(c) Identify the major differences between the classical realism of Hans J. Morgenthau and the neorealism of Kenneth Waltz. Which approach is best suited for analysing international relations after the Cold War?"
		},
		{
			"Year":"2015",
			"Question":"4(d) Is globalization essentially a process of ‘universalisation’ of capitalist modernity?"
		},
		{
			"Year":"2015",
			"Question":"5(e) What is the difference between Interest Groups and Pressure Groups? Are the Pressure Groups in India in a position to fully protect or promote the interests of their members?"
		},
		{
			"Year":"2015",
			"Question":"2. (a) ‘The struggle for democracy has been marked by bitter strife and tribulations.’Examine the statement, illustrating the cases of Pakistan, Nepal and Myanmar.                     20"
		},
		{
			"Year":"2015",
			"Question":"2(b) Discuss the theory of Nuclear Deterrence. Did Nuclear Deterrence prevent a superpower war?   15"
		},
		{
			"Year":"2015",
			"Question":"2(c) What are the real objectives of Millennium Development Goals (MDG)? Do you think that millennium development goals have been able to achieve the desired goals of poverty alleviation and sustainable development?                       15"
		},
		{
			"Year":"2015",
			"Question":"3. (a) Do you endorse that the conventional discourse on human rights has failed to include women’s rights? Explain in the context of feminist theories.      12+8=20"
		},
		{
			"Year":"2015",
			"Question":"3(b) How far are the world governance mechanisms, dominated by IMF and World Bank, legitimate and relevant? What measures do you suggest to improve their effectiveness in global governance?   15"
		},
		{
			"Year":"2015",
			"Question":"3(c) Discuss the collapse of the Soviet Union and its impact on international politics.       15"
		},
		{
			"Year":"2015",
			"Question":"4. (a) Has the reform of the economic and social arrangements of the United Nations been effective? 20"
		},
		{
			"Year":"2015",
			"Question":"4(b) ‘The European Union has become, the most politically influential, economically powerful and demographically diverse regional entity in the world.’ Discuss.        15"
		},
		{
			"Year":"2015",
			"Question":"4(c) How is it that economic and neo-liberal globalization is being interrogated from inside even in developed countries? What are the economic consequences of such globalization?"
		},
		{
			"Year":"2015",
			"Question":"5. Answer the following questions in about 150 words each: 10x5=50"
		},
		{
			"Year":"2015",
			"Question":"5(a) The social structure of a country influences its foreign policy-making. How does the social structure of India impact the course and direction of its foreign policy?"
		},
		{
			"Year":"2015",
			"Question":"5(b) ‘Non-alignment’ has been the basic principle of India’s foreign policy since independence. Discuss its relevance in the contemporary context."
		},
		{
			"Year":"2015",
			"Question":"5(c) Identify the constraints/challenges to the regional cooperation in South Asia."
		},
		{
			"Year":"2015",
			"Question":"5(d) Ethnic conflicts and insurgencies in North-East India can be better managed by improving relations with the neighbouring countries. Substantiate the statement with suitable examples."
		},
		{
			"Year":"2015",
			"Question":"5(e) How does the Parliament determine and influence the making of India’s foreign policy?"
		},
		{
			"Year":"2015",
			"Question":"6. (a) Before the year 2000, the Indo-U.S. relationship has been marked more with estrangement than cordiality. Why?                 20"
		},
		{
			"Year":"2015",
			"Question":"6(b) ‘Economic interest has emerged as the main component of India’s foreign policy.’ Discuss the statement in the light of India’s initiatives to improve relations with China, Japan and the Central Asian republics.                         15"
		},
		{
			"Year":"2015",
			"Question":"6(c) In 1998, India declared itself as a nuclear weapon state. India refuses to sign NPT and CTBT. What would be the implications for India’s nuclear policy in case it signs both the treaties?            15"
		},
		{
			"Year":"2015",
			"Question":"7. (a) Vision of a new world order has emerged as the major objective of India’s foreign policy. Discuss the policy initiative taken by India in this regard and the challenges faced by it.       20"
		},
		{
			"Year":"2015",
			"Question":"7(b) Discuss the factors for the decline of India’s presence in Latin America.                        15"
		},
		{
			"Year":"2015",
			"Question":"7(c) River water disputes are emerging as a major source of irritation between India and its neighbours. Identify the sources of conflicts and suggest the remedial measures.                      15"
		},
		{
			"Year":"2015",
			"Question":"8. (a) The United Nations completes 70 years of its establishment in 2015. What reforms is India asking for to strengthen the global institutions of governance and why?                    20"
		},
		{
			"Year":"2015",
			"Question":"8(b) Discuss the realistic foreign policy initiatives taken by India to balance its relations between Israel and the Arab world.                         15"
		},
		{
			"Year":"2015",
			"Question":"8(c) Discuss the humanitarian role played by India in the crisis-stricken Gulf countries like Yemen and Iraq.         15"
		},
		{
			"Year":"2016",
			"Question":"1.a.\"How would I and my fellow human beings behave if we were to find ourselves in a state of nature, and what does this behaviour tell us about our innate predispositions ?\" (Thomas Hobbes) 10 "
		},
		{
			"Year":"2016",
			"Question":"1.b.The Post-Behavioural Approach. "
		},
		{
			"Year":"2016",
			"Question":"1.c.Affirmative Action. "
		},
		{
			"Year":"2016",
			"Question":"1.d.Dr. B. R. Ambedkar's idea of state socialism. "
		},
		{
			"Year":"2016",
			"Question":"1.e.Gramsci 's concept of Hegemony. "
		},
		{
			"Year":"2016",
			"Question":"2.a.\"The Political ideology of Globalization is Neo-liberalism.\" Comment. 20"
		},
		{
			"Year":"2016",
			"Question":"2.b.Discuss Feminist theory of the State. 15"
		},
		{
			"Year":"2016",
			"Question":"2.c.Critically examine John Rawl's argument for democratic equality 15"
		},
		{
			"Year":"2016",
			"Question":"3.a.Discuss Sri Aurobindo's views on Cultural Nationalism. 20"
		},
		{
			"Year":"2016",
			"Question":"3.b.Explain Mar.x 's understanding of Humau Esst::m.:t:: and Alienation.  15"
		},
		{
			"Year":"2016",
			"Question":"3.c.\"The implementation of human rights is regarded as a matter of changing the conduct of States.\" Comment.  15"
		},
		{
			"Year":"2016",
			"Question":"4.a.Discuss Hannah Arendt's analysis of the role of Ideology in modern totalitarian regtmes.  20"
		},
		{
			"Year":"2016",
			"Question":"4.b.Explicate the features of respresentative Democracy. 15"
		},
		{
			"Year":"2016",
			"Question":"4.c.Examine Gandhi's critique of 'Modernisation'. 15"
		},
		{
			"Year":"2016",
			"Question":"5.a.Critically examine the Radical Humanist perspective on Indian National Movement. "
		},
		{
			"Year":"2016",
			"Question":"5.b.Cultural and Regional differences are the enduring bases on which politics is played out in India. "
		},
		{
			"Year":"2016",
			"Question":"5.c.'Article 368 does not enable Parliament to alter the basic structure or framework of the Constitution' . "
		},
		{
			"Year":"2016",
			"Question":"5.d.The purpose uf lltt: 42nd Constitutional Amendment was to make the economic ann social democracy explicitly visible. "
		},
		{
			"Year":"2016",
			"Question":"5.e.The philosophy and administration of the distribution of powers between Centre and State is required to be re-assessed. "
		},
		{
			"Year":"2016",
			"Question":"6.a.Critically examine the politics of Economic growth in India. 20"
		},
		{
			"Year":"2016",
			"Question":"6.b.Comment on the emergence of Backward classes in the Indian Politics. 15 "
		},
		{
			"Year":"2016",
			"Question":"6.c.Discuss the pattern of Political Parties from one dominant party system to coalition politics in national politics.  15"
		},
		{
			"Year":"2016",
			"Question":"7.a.Land reforms have failed in the eradication of rural poverty. Comment. 20"
		},
		{
			"Year":"2016",
			"Question":"7.b.Critically examine the role of Governor in recent times. 15"
		},
		{
			"Year":"2016",
			"Question":"7.c.Discuss the Right to Information and underline challenges being posed before it.  15"
		},
		{
			"Year":"2016",
			"Question":"8.a.The goal of Good governance will be achieved only by strengthening the grass root level democracy.  20"
		},
		{
			"Year":"2016",
			"Question":"8.b.Examine the objective and role of the National Human Rights Commission. 15 "
		},
		{
			"Year":"2016",
			"Question":"8.c.Critically examine the provisions made in the Constitution for the protection of Environment.  15"
		},
		{
			"Year":"2016",
			"Question":"1.a.Critically examine the Marxist aspect of political economy approach to the study of comparative politics. "
		},
		{
			"Year":"2016",
			"Question":"1.b.Comment on the decline of political parties and examine whether new social movements shall be alternative strategy for establishing link between government and society"
		},
		{
			"Year":"2016",
			"Question":"1.c.Discuss the impact of globalization on the internal functioning of the state "
		},
		{
			"Year":"2016",
			"Question":"1.d.Critically examine the functional and system approaches to the study of international relations. "
		},
		{
			"Year":"2016",
			"Question":"1.e.\"A combination of internal pressures (ethnic and regional forces) and external threats (EU, UN, TNC, global market, etc.) has produced what is commonly referred to as a 'crisis of the nation-state'.\" Elaborate. "
		},
		{
			"Year":"2016",
			"Question":"2.a.Why does global human security need to be emphasized along with economic security? Explain with examples.20 "
		},
		{
			"Year":"2016",
			"Question":"2.b.Do you endorse that the United Nations needs major changes in its structures and functioning? Suggest the changes for efficient improvements. 15"
		},
		{
			"Year":"2016",
			"Question":"2.c.Discuss the evolution of non-proliferation of nuclear weapons in the post-Cold War period. 15"
		},
		{
			"Year":"2016",
			"Question":"3.a.\"The IMF, World Bank, G-7, GATT and other structures are designed to serve the interests of TNCs, banks and investment firms in a 'new imperial age'.\" Substantiate with examples of governance of new world order. 20"
		},
		{
			"Year":"2016",
			"Question":"3.b.Examine in brief the rise and fall of the Cold War. 15"
		},
		{
			"Year":"2016",
			"Question":"3.c.How does the regionalism shape the world politics? Explain with Examples.15"
		},
		{
			"Year":"2016",
			"Question":"4.a.Explain the instruments and methods devised for the promotion of national interest. 20"
		},
		{
			"Year":"2016",
			"Question":"4.b.\"The notion of balance of power is notoriously full of confusion.\" In the light of this quotation, do you think that the concept of balance of power is relevant? 15"
		},
		{
			"Year":"2016",
			"Question":"4.c.Do interest groups help to promote democracy or to undermine it? Give your opinion 15"
		},
		{
			"Year":"2016",
			"Question":"5.a.Which determinant factors play an important role in making India's foreign policy? Illustrate with examples. "
		},
		{
			"Year":"2016",
			"Question":"5.b.Comment on India's contribution to Non-Alignment Movement and its contemporary relevance. "
		},
		{
			"Year":"2016",
			"Question":"5.c.Illustrate the main causes of tension between India and China. Suggest the possibilities of improving relationship. "
		},
		{
			"Year":"2016",
			"Question":"5.d.Critically analyze India's nuclear policy."
		},
		{
			"Year":"2016",
			"Question":"5.e.\"Sometimes we visualize that SAARC's efforts come to halt because of various impediments to regional cooperation.\" Elaborate with reasonable examples of impediments"
		},
		{
			"Year":"2016",
			"Question":"6.a.Explain Britain's ouster from EU and bring out its consequences on world economy in general and India in particular 20"
		},
		{
			"Year":"2016",
			"Question":"6.b.Comment on India's growing relationship with USA in the background of constrained relations between India and China.15"
		},
		{
			"Year":"2016",
			"Question":"6.c.Critically analyze China's role in international politics against India's demand for permanent seat in UN Security Council. 15"
		},
		{
			"Year":"2016",
			"Question":"7.a.Examine the main problems and challenges involved in looking after environmental concerns in world politics. 20"
		},
		{
			"Year":"2016",
			"Question":"7.b.Explain the concept of the North-South divide and suggest how structural inequalities between the high wage, high investment industrial North and low wage, low investment predominantly rural South can be reduced. 15"
		},
		{
			"Year":"2016",
			"Question":"7.c.Discuss the positive and negative impacts of Soviet Union's disintegration on developing nations 15"
		},
		{
			"Year":"2016",
			"Question":"8.a.Explain the socio-economic impacts of arms race and identify the obstacles in the way of disarmament.  20"
		},
		{
			"Year":"2016",
			"Question":"8.b.What are the hopes and aspirations of 'Look East Policy' of India? Explain. 15"
		},
		{
			"Year":"2016",
			"Question":"8.c.Discuss the shift of India's foreign policy towards Pakistan in the light of Pathankot incident. 15"
		},
		{
			"Year":"2017",
			"Question":"1(a) According to Sri Aurobindo, Swaraj is a necessary condition for India to accomplish its destined goal.(10)"
		},
		{
			"Year":"2017",
			"Question":"1(b) Neo-liberal perspective of State(10)"
		},
		{
			"Year":"2017",
			"Question":"1(c) Post-modernism (10)"
		},
		{
			"Year":"2017",
			"Question":"1(d) Eco-feminism   (10)"
		},
		{
			"Year":"2017",
			"Question":"1(e) Hobbesian notion of Political Obligation      (10)"
		},
		{
			"Year":"2017",
			"Question":"2. (a) Rawls' theory of justice is both contractual and distributive. Examine.     (20)"
		},
		{
			"Year":"2017",
			"Question":"2(b) Everywhere, inequality is a cause of revolution - Aristotle. Comment.      (15)"
		},
		{
			"Year":"2017",
			"Question":"2(c) Define Socialism. Discuss the salient features of Fabian Socialism.       (15)"
		},
		{
			"Year":"2017",
			"Question":"3. (a) What do you understand by Multiculturalism? Discuss Bhikhu Parekh's view on Multiculturalism.      (20)"
		},
		{
			"Year":"2017",
			"Question":"3(b) Deliberative democracy does not have its salience without participation and participatory democracy does not have its credence without deliberations. Comment.       (15)"
		},
		{
			"Year":"2017",
			"Question":"3(c) Differentiate between Freedom and Liberty. Discuss Marx's notion of freedom.       (15)"
		},
		{
			"Year":"2017",
			"Question":"4. (a) Political democracy could not last unless social democracy lay at its base - B.R. Ambedkar. Comment.           (20)"
		},
		{
			"Year":"2017",
			"Question":"4(b) Write a brief note on The End of History debate.          (15)"
		},
		{
			"Year":"2017",
			"Question":"4(c) What do you understand by the notion of Statecraft? Discuss the theory of statecraft as given by Kautilya.              (15)"
		},
		{
			"Year":"2017",
			"Question":"5(a) The success of Mahatma Gandhi lay in transforming both political and non-political movements into a unified nationalist movement.                  (10)"
		},
		{
			"Year":"2017",
			"Question":"5(b) Right to privacy is an intrinsic part of the right to life.           (10)"
		},
		{
			"Year":"2017",
			"Question":"5(c) Indian federation has moved from cooperative federation to competitive federation.       (10)"
		},
		{
			"Year":"2017",
			"Question":"5(d) State subvention/funding may be an effective instrument in strengthening electoral democracy in India.         (10)"
		},
		{
			"Year":"2017",
			"Question":"5(e) In the post-liberalization era, Indian politics is moving from ascriptive politics to developmental politics.          (10)"
		},
		{
			"Year":"2017",
			"Question":"6. (a) Differentiate parliamentary supremacy from parliamentary sovereignty. Would you consider the Indian Parliament as a Sovereign Parliament? Examine.       (20)"
		},
		{
			"Year":"2017",
			"Question":"6(b) Has the 73rd Constitutional Amendment empowered women in panchayats in India? Discuss.    (15)"
		},
		{
			"Year":"2017",
			"Question":"6(c) Religion is still an important factor in Indian politics. Discuss.          (15)"
		},
		{
			"Year":"2017",
			"Question":"7. (a) India has moved from 'one-party dominant system' to 'one-party led coalition'. Discuss.       (20)"
		},
		{
			"Year":"2017",
			"Question":"7(b) How is the President of India elected? Outline the salient characteristics of the electoral college of the Indian President.     (15)"
		},
		{
			"Year":"2017",
			"Question":"7(c) Examine the role of the National Commission for Minorities in preserving, promoting and protecting the rights of minorities in India.     (15)"
		},
		{
			"Year":"2017",
			"Question":"8. (a) Judiciary has acquired the role of both, a legislature and an executive in recent years. Examine with suitable examples.      (20)"
		},
		{
			"Year":"2017",
			"Question":"8(b) What do you understand by Green Revolution? Do you think that a Second Green Revolution is needed to adequately address the agrarian challenges in contemporary India? Examine.     (15)"
		},
		{
			"Year":"2017",
			"Question":"8(c) Differentiate Moderate Nationalism from Extremist/Militant Nationalism in terms of their objectives and means. (15)"
		},
		{
			"Year":"2017",
			"Question":"1. (a) Explain the Political-Sociological Approach in the field of comparative politics and discuss its limitations."
		},
		{
			"Year":"2017",
			"Question":"1(b) Critically examine the Globalisation in the past 25 years from the perspectives of the Western world."
		},
		{
			"Year":"2017",
			"Question":"1(c) Examine the LGBT (Lesbian, Gay, Bisexual and Transgender) movement: in developed societies and how it is affecting the political participation in developing societies."
		},
		{
			"Year":"2017",
			"Question":"1(d) American President: Donald Trump's proposal to withdraw from the ‘NAFTA’ would bring unforeseen consequences to the regionalisation of world politics. Elaborate."
		},
		{
			"Year":"2017",
			"Question":"1(e) Give an assessment of the Feminist critique of contemporary global issues."
		},
		{
			"Year":"2017",
			"Question":"2. (a) Is Realist Approach the best method to understand International Relations? Examine this in the context or Classical Realism.      20"
		},
		{
			"Year":"2017",
			"Question":"2(b) How has the development of Global capitalism changed the nature of socialist economies and developing societies?         15"
		},
		{
			"Year":"2017",
			"Question":"2(c) Discuss the changing nature of modem state with reference to transnational actors.     15"
		},
		{
			"Year":"2017",
			"Question":"3. (a) “The development or advanced missile technology and nuclear threat by North Korea has challenged the American hegemony in South-East Asia.” Evaluate the above statement in the context of recent developments in the region.         20"
		},
		{
			"Year":"2017",
			"Question":"3(b) Do you endorse the view that the end of Bipolarity and the rise of multiple regional organisations has made Non-Aligned Movement (NAM) more or less irrelevant?             15"
		},
		{
			"Year":"2017",
			"Question":"3(c) Do you agree with the view that despite the limitations in the functioning of the UN, it has distinguished and unique achievements to its credit?             15"
		},
		{
			"Year":"2017",
			"Question":"4. (a) The recent move of USA to withdraw from the Paris climate Agreement is a setback in the consensus achieved on protecting the world environment. In this context, assess the future prospective on climate control.          20"
		},
		{
			"Year":"2017",
			"Question":"4(b) How has ‘BREXIT’ affected the regionalisation process initiated by European Union and what could be its likely impacts in the regionalisation process of world politics?         15"
		},
		{
			"Year":"2017",
			"Question":"4(c) Examine the World System Approach as developed by Emmanuel Wallerstein.      15"
		},
		{
			"Year":"2017",
			"Question":"5(a) Examine the Indian National Movement and Geographical location of India as determinants of India’s foreign policy."
		},
		{
			"Year":"2017",
			"Question":"5(b) What are the impediments of the developments of South Asian Free Trade Area (SAFTA)?"
		},
		{
			"Year":"2017",
			"Question":"5(c) “The treaty of Perpetual Peace and Friendship between India and Bhutan needs to be revised with more pragmatic, realistic obligations and responsibilities.” Comment."
		},
		{
			"Year":"2017",
			"Question":"5(d) “India has been the largest and consistent country contributing to the UN peacekeepers worldwide.” Examine India’s role in this perspective."
		},
		{
			"Year":"2017",
			"Question":"5(e) Has the recent Indo-Israeli relationships given a new dynamics to India’s stand on Palestinian’s statehood?"
		},
		{
			"Year":"2017",
			"Question":"6. (a) Suggest measures so that India’s partnership with Africa becomes a true symbol of South-South Cooperation, delivering clear-cut economic and political dividends to both side of the equation.    20"
		},
		{
			"Year":"2017",
			"Question":"6(b) “Despite the difference between India and Pakistan on various issues, Indus Water Treaty has stood the test of time.” In the light of this statements, discuss the recent developments over the issue.      15"
		},
		{
			"Year":"2017",
			"Question":"6(c) Analyse the stalled progress of Doha Round of WTO negotiations over the differences between the developed and the developing countries.      15"
		},
		{
			"Year":"2017",
			"Question":"7. (a) How is the “Belt and Road Initiative” of China going to affect India-China relationship?      20"
		},
		{
			"Year":"2017",
			"Question":"7(b) The recent difference between India and Russia are the result of misconceptions than fact. Elucidate.       15"
		},
		{
			"Year":"2017",
			"Question":"7(c) ‘Uniting for Census’ also known as ‘Coffee Club’ has opposed the claims of India and other countries over permanent membership of the UN Security Council. Point out their major objections.        15"
		},
		{
			"Year":"2017",
			"Question":"8. (a) The natural behaviour of India and the United States is likely to serve each other’s interests. Hence, a deliberate strategy of dovetailing their efforts will obviously benefit both. Elaborate.    20"
		},
		{
			"Year":"2017",
			"Question":"8(b) Do you subscribe to the idea that in the new evolving Asian dynamics, Japan and India have not only moved closer in economic cooperation but also in strategic partnership?       15"
		},
		{
			"Year":"2017",
			"Question":"8(c) The Nuclear Non-Proliferation Treaty (NPT) has failed to achieve the ultimate objective of Global Nuclear Department. Discuss the deficiency in the provision of NPT.        15"
		},
		{
			"Year":"2018",
			"Question":"1.a.John Stuart Mill is a 'reluctant democrat'. - C.L. Wayper"
		},
		{
			"Year":"2018",
			"Question":"1.b.Decline of Political Theory"
		},
		{
			"Year":"2018",
			"Question":"1.c.Distributive Justice"
		},
		{
			"Year":"2018",
			"Question":"1.d.Substantive Democracy"
		},
		{
			"Year":"2018",
			"Question":"1.e.\"Nothing against the state, nothing over it, nothing beyond it.\" - Mussolini "
		},
		{
			"Year":"2018",
			"Question":"2.a.Critically examine the neo - liberal theory of state.20 "
		},
		{
			"Year":"2018",
			"Question":"2.b.Analyse John Rawls justification of discrimination to achieve the goals of justice. 15"
		},
		{
			"Year":"2018",
			"Question":"2.c.Equality means fair treatment rather than equal treatment. Comment. 15"
		},
		{
			"Year":"2018",
			"Question":"3.a.What do you understand by three generations of Human Rights?20"
		},
		{
			"Year":"2018",
			"Question":"3.b.Critically examine Macpherson's views on Democracy.15"
		},
		{
			"Year":"2018",
			"Question":"3.c.Explain the relationship between power, authority and legitimacy.13"
		},
		{
			"Year":"2018",
			"Question":"4.a.John Locke is the father of liberalism. Explain.20"
		},
		{
			"Year":"2018",
			"Question":"4.b.Discuss Ambedkar's ideas on 'annihilation of caste'.15"
		},
		{
			"Year":"2018",
			"Question":"4.c.Critically examine Machiavelli's views on religion and politics.15"
		},
		{
			"Year":"2018",
			"Question":"5.a.Revolt of 1857 is a 'Sepoy Mutiny' or 'First War of Independence'."
		},
		{
			"Year":"2018",
			"Question":"5.b.Indian Constitution is a 'Lawyers Paradise'. - Ivor Jennings"
		},
		{
			"Year":"2018",
			"Question":"5.c.New Panchayat Raj is an effective instrument for women empowerment."
		},
		{
			"Year":"2018",
			"Question":"5.d.Implementation of GST and NEET is a major challenge to Indian Federalism."
		},
		{
			"Year":"2018",
			"Question":"5.e.Political Personalities are more significant than Political parties in India."
		},
		{
			"Year":"2018",
			"Question":"6.a.Whether Judicial activism has undermined or strengthened Parliamentary Democracy in India? Discuss.20"
		},
		{
			"Year":"2018",
			"Question":"6.b.Do the Lieutenant Governors have more powers than the Governors of the states? Explain 15"
		},
		{
			"Year":"2018",
			"Question":"6.c.Critically examine the ethnic conflicts in North-East India. 15"
		},
		{
			"Year":"2018",
			"Question":"7.a.Examine the provisions of Panchayat Extension Services Act(PESA), 1996. 20"
		},
		{
			"Year":"2018",
			"Question":"7.b.Analyse the arguments in favor and against the lateral entry into higher civil services in India. 15"
		},
		{
			"Year":"2018",
			"Question":"7.c.Discuss asymmetrical federalism in India. 15"
		},
		{
			"Year":"2018",
			"Question":"8.a.Examine the various causes of agrarian crisis in India. 20"
		},
		{
			"Year":"2018",
			"Question":"8.b.Explain the increasing role of regional Political parties in national politics. 15"
		},
		{
			"Year":"2018",
			"Question":"8.c.Critically analyze the environmental movement in Tuticorin, Tamilnadu. 15"
		},
		{
			"Year":"2018",
			"Question":"1.a.Describe the changing nature of comparative Politics. Briefly explain the Political Economy approach to the study of Comparative Politics."
		},
		{
			"Year":"2018",
			"Question":"1.b.Describe the changing nature of the state in the developing societies in the context of inclusive growth in the 21st century."
		},
		{
			"Year":"2018",
			"Question":"1.c.How big a role does identity play in determining political participation in the developing countries? Discuss your answer with suitable illustrations."
		},
		{
			"Year":"2018",
			"Question":"1.d.Bring out the major differences between the classical Realism of Hans Morgenthau and Neorealism of Kenneth Waltz."
		},
		{
			"Year":"2018",
			"Question":"1.e.What according to Joseph Nye, are the major sources of a country's soft power? Discuss its relevance in the contemporary world politics."
		},
		{
			"Year":"2018",
			"Question":"2.a.Discuss the significance of Non-Aligned Movement as a unique contribution of the Non-Western world to World Politics. 20"
		},
		{
			"Year":"2018",
			"Question":"2.b.Discuss the consequences of Trump's \"America First\" and Xi's \"Chinese Dream' on world politics. 15"
		},
		{
			"Year":"2018",
			"Question":"2.c.Some feel Multinational Corporations(MNCs)are a vital new road to economic growth, whereas others feel they perpetuate underdevelopment.\" Discuss. 15"
		},
		{
			"Year":"2018",
			"Question":"3.a.Discuss the relevance of UN Security Council Resolution 1325 on the security of Women in conflict zones.20"
		},
		{
			"Year":"2018",
			"Question":"3.b.WOuld you agree that the on-going debates on international environmental politics continue to be marred by new North-South ideological divide over historical responsibility and developmental model? Illustrate your answer with suitable examples.15"
		},
		{
			"Year":"2018",
			"Question":"3.c.\"Since its inception the South Asian Association for Regional Cooperation(SAARC) has failed to deliver on its promises.\" What initiatives should be taken to reinvigorate the organization? 15"
		},
		{
			"Year":"2018",
			"Question":"4.a.Critically examine the notion of \"Asian Values\" in the context of the on-going debates on human rights.20"
		},
		{
			"Year":"2018",
			"Question":"4.b.Discuss the implications of the Trump-Kim Singapore Summit on the prospects of denuclearization of the Korean Peninsula.15"
		},
		{
			"Year":"2018",
			"Question":"4.c.Critically examine the Functionalist approach to the study of International Relations.15"
		},
		{
			"Year":"2018",
			"Question":"5.a.Do you agree with the view that the Indian Foreign Policy is increasingly being shaped by the Neoliberal Outlook? Elaborate."
		},
		{
			"Year":"2018",
			"Question":"5.b.\"India is often said to have a rich strategic culture.\" Discuss"
		},
		{
			"Year":"2018",
			"Question":"5.c.Evaluate India's stand on the recent Rohingya refugee issue."
		},
		{
			"Year":"2018",
			"Question":"5.d.\"India's current foreign policy marks significant qualitative shifts from that of the previous regimes.\" Discuss"
		},
		{
			"Year":"2018",
			"Question":"5.e.Analyse the significance of India's Look East Policy in the light of concerns of the indigenous peoples of North-East India."
		},
		{
			"Year":"2018",
			"Question":"6.a.India's coalitional diplomacy within the WTO has earned its wide appreciation. WHta accounts for the success of India's coalitional diplomacy? 20"
		},
		{
			"Year":"2018",
			"Question":"6.b.India's Capacity building programs under the Indian Technical and Economic Cooperation(ITEC) has earned much goodwill for it in Africa.\" Discuss 15"
		},
		{
			"Year":"2018",
			"Question":"6.c.\"India's Research and Information System for Developing Countries\" (RIS) is a major initiative in the area of South-South cooperation. Discuss 15"
		},
		{
			"Year":"2018",
			"Question":"7.a.Discuss the role of Indian Council for Cultural Relations(ICCR) in promoting India's soft power abroad. 20"
		},
		{
			"Year":"2018",
			"Question":"7.b.Discuss the role of Indian diaspora in promoting Indi-US relations. 15"
		},
		{
			"Year":"2018",
			"Question":"7.c.Discuss the various impediments in India's way to a permanent seat in the Security Council. 15"
		},
		{
			"Year":"2018",
			"Question":"8.a.Do you  think that India's capacity building role in Afghanistan has shrunk the strategic space for Pakistan there? Discuss. 20"
		},
		{
			"Year":"2018",
			"Question":"8.b.Critically assess the evolving convergence of India and China in the areas of trade and environment. 15"
		},
		{
			"Year":"2018",
			"Question":"8.c.Do you agree that the growing assertiveness of china is leading to multilayered Indo-Japan relations? Comment. 15"
		}
	]
