
	[
		
		{
			"Year":"1979",
			"Question":"1.a. Substantiate, citing literature, the view that analysis of social stability and change has been the main concern of classical sociologists."
		},
		{
			"Year":"1979",
			"Question":"1.b. Explain the view that the social system is a basic conceptual model useful in understanding social organization."
		},
		{
			"Year":"1979",
			"Question":"2. Explain as to why and how Durkheim described social reality to the group, not to the individual."
		},
		{
			"Year":"1979",
			"Question":"3. Taking clue from Weber’s analysis of the role of Calvinist ethics in the rise of mature capitalism, discuss the relative impact of (a) economic conditions, and (b) values and ideas, on social change."
		},
		{
			"Year":"1979",
			"Question":"4. “The personality is formed, maintained and changed as the socialization process moves along.” Explain."
		},
		{
			"Year":"1979",
			"Question":"5. What functions does social conflict perform? Explain the nature of social conflict in the developing countries today."
		},
		{
			"Year":"1979",
			"Question":"6(a) Pareto on social equilibrium."
		},
		{
			"Year":"1979",
			"Question":"6(b) Power and legitimacy"
		},
		{
			"Year":"1979",
			"Question":"6(c) Role-set and role conflict."
		},
		{
			"Year":"1979",
			"Question":"6(d) Totemism and social solidarity."
		},
		{
			"Year":"1979",
			"Question":"7. Discuss the Marxian theory of class as criticized by Weber"
		},
		{
			"Year":"1979",
			"Question":"8. What do you mean by empiricism? Examine the significance of empirical confirmation in building sociological theory."
		},
		{
			"Year":"1979",
			"Question":"9. “Participant observation in many situations is nothing more than a case study.” Comment."
		},
		{
			"Year":"1979",
			"Question":"10. Explain the basic features of the ex post facto research design and assess its role in sociological research."
		},
		{
			"Year":"1979",
			"Question":"11(a) Reliability and validity."
		},
		{
			"Year":"1979",
			"Question":"11(b) Verstehen method."
		},
		{
			"Year":"1979",
			"Question":"11(c) Sources of hypothesis."
		},
		{
			"Year":"1979",
			"Question":"11(d) Survey research"
		},
		{
			"Year":"1979",
			"Question":"1.a. Bring out the unity and diversity in the society and culture in India."
		},
		{
			"Year":"1979",
			"Question":"1.b.Describe the different approaches to the study of Indian society and examine fully the utility of any one of them."
		},
		{
			"Year":"1979",
			"Question":"2. Discuss the impact of religious, linguistic, caste and tribal groups on the nation building process in India."
		},
		{
			"Year":"1979",
			"Question":"3. Distinguish between tribe and caste bringing out the implications of the difference for settlement pattern and community living."
		},
		{
			"Year":"1979",
			"Question":"4. Enumerate and explain the factors conducive to joint family and comment on its prevalence/disappearance in rural India."
		},
		{
			"Year":"1979",
			"Question":"5. Enumerate the forces affecting the jajmani system and examine their impact on the ‘community’ aspect of the village."
		},
		{
			"Year":"1979",
			"Question":"6. Examine whether the different centres of political power in India are successful as democratic institutions."
		},
		{
			"Year":"1979",
			"Question":"7. Examine the changing stratification system in modern India in relation to the issues of equality and social justice."
		},
		{
			"Year":"1979",
			"Question":"8. Bring out the impact of education on social mobility and equality with special reference to the Scheduled castes."
		},
		{
			"Year":"1979",
			"Question":"9. Define social change and assess the role of legislative measures in bringing about social change in India."
		},
		{
			"Year":"1979",
			"Question":"10. Define social stratification and discuss the principles of stratification in the traditional hierarchy."
		},
		{
			"Year":"1979",
			"Question":"11(a) Social movements in post-independence India."
		},
		{
			"Year":"1979",
			"Question":"11(b) Industrialisation and social change in India."
		},
		{
			"Year":"1979",
			"Question":"11(c) Role of religion in the traditional Indian society."
		},
		{
			"Year":"1979",
			"Question":"11(d) Unintended consequences of planned social change in India."
		},
		{
			"Year":"1980",
			"Question":"1.a. Distinguish between formal and informal structures of organizations and show how some of the problems of formal organizations can be better understood in forms of this distinction."
		},
		{
			"Year":"1980",
			"Question":"1.b.Define ‘social stratification’ and critically examine the view that Marx has “oversimplified the structure of satisfaction by reducing it to one factor, control of the means of production”."
		},
		{
			"Year":"1980",
			"Question":"2. What do you mean by functionalism? Explain Merton’s paradigm of functional analysis. Does it satisfy the requirements of a rigorous theory?"
		},
		{
			"Year":"1980",
			"Question":"3. In what ways is organic solidarity different from mechanical solidarity? Does organic division of labour lead to greater efficiency? Illustrate your view with examples."
		},
		{
			"Year":"1980",
			"Question":"4. Examine Pareto’s analysis of the circulation of elites. It is valid for the modern industrial societies?"
		},
		{
			"Year":"1980",
			"Question":"5. Distinguish among power, prestige and authority. What are the different ways in which an authority may gain legitimacy? Why does a changing society face crises of legitimacy?"
		},
		{
			"Year":"1980",
			"Question":"6. Bring out the relationship between technological development and changes in family and kinship. How do you account for the different types of kinship system in the U.S. and Japan which are similar with regard to technological development?"
		},
		{
			"Year":"1980",
			"Question":"7. Define and elaborate social fact and social action as the subject matter of sociology. What are the problems which such a subject matter posses for its scientific study? Can it be studied scientifically at all?"
		},
		{
			"Year":"1980",
			"Question":"8. Distinguish between observation and interviewing as techniques of data collection.Under what contexts may their use be recommended? Bring out their merits and demerits as regards their objectivity and validity."
		},
		{
			"Year":"1980",
			"Question":"9(a) Religion as a force both for integration and conflict within society."
		},
		{
			"Year":"1980",
			"Question":"9(b) Dialectics of change as applied to the Indian society."
		},
		{
			"Year":"1980",
			"Question":"9(c) Changes in the society at large and role conflict within the family."
		},
		{
			"Year":"1980",
			"Question":"9(d) The significance of the combination of induction and deduction in scientific method."
		},
		{
			"Year":"1980",
			"Question":"1.a.What argument are adduced by some authors to assert that the caste system is peculiar only to India, and by some others to show that it is a universal phenomenon observable in other parts of the world as well?"
		},
		{
			"Year":"1980",
			"Question":"1.b.Some authors maintain that the caste system contributes to solidarity and harmony in society, whereas some other think that it is an exploitative system. What are the grounds for such divergent views?"
		},
		{
			"Year":"1980",
			"Question":"2. Analyse the interrelationships among the joint family, the caste system and the village community in the traditional Indian society and show how they were supported by the peculiar economic organization and the value system."
		},
		{
			"Year":"1980",
			"Question":"3. Describe the traditional modes of adaptation and mobility in tribe and caste in India and bring out the significant changes in these process since independence."
		},
		{
			"Year":"1980",
			"Question":"4. Traditionally, marriage in the Father-right societies in India was not merely a union between man and woman, but a permanent transfer of a woman from the family of her parents into that of her husband. What customs and practices in marriage and family can you adduce to substantiate this observation?"
		},
		{
			"Year":"1980",
			"Question":"5. There are tendencies in some parts of the country, on the part of the native people of a region to discriminate against the immigrants. Analyse the economic, demographic and socio-cultural factors which may give rise to the politics of nativism."
		},
		{
			"Year":"1980",
			"Question":"6. Examine India’s claim to be a secular state and society. Does the concept of secular state as understood in India lead to the spread of secularism in society as a scientificconcept."
		},
		{
			"Year":"1980",
			"Question":"7. Give a brief account of the major social reform movements in the 19th and 20th century India. How and why can they be regarded fundamentally different from such movements in the past."
		},
		{
			"Year":"1980",
			"Question":"8. Explain why it is not urbanization alone, but urbanization combined with industrialization, which is responsible for far-reaching changes in society."
		},
		{
			"Year":"1980",
			"Question":"9(a) Varna and Jati."
		},
		{
			"Year":"1980",
			"Question":"9(b) Growing economic disparities despite development planning."
		},
		{
			"Year":"1980",
			"Question":"9(c) Slow progress of Scheduled caste despite Protective Discrimination."
		},
		{
			"Year":"1980",
			"Question":"9(d) Whether the status of women in India is due to their inherent qualities or to social arrangements"
		},
		{
			"Year":"1981",
			"Question":"1(a) Alienation in modern society."
		},
		{
			"Year":"1981",
			"Question":"1(b) “Value Problem” in sociological research."
		},
		{
			"Year":"1981",
			"Question":"1(c) “Social Action and Pattern variables."
		},
		{
			"Year":"1981",
			"Question":"1(d) Socialization and the Self."
		},
		{
			"Year":"1981",
			"Question":"2. What are the major postulates in functional analysis? Is the framework conservative or radical in its approach to the study of social phenomena? Substantiate your view."
		},
		{
			"Year":"1981",
			"Question":"3. Discuss how the sociologists have tried to solve the problem of differentiating the nature and scope of their discipline from the subject matter of other social sciences."
		},
		{
			"Year":"1981",
			"Question":"4. Distinguish among the concepts of “social inequalities”, “social hierarchy” and “the perpetuation of social inequalities”. How are these features manifested in the different forms of social stratification?"
		},
		{
			"Year":"1981",
			"Question":"5(a) Cultural lag and directed change."
		},
		{
			"Year":"1981",
			"Question":"5(b) Role of education in continuity and change."
		},
		{
			"Year":"1981",
			"Question":"5(c) Impact of property concepts on the nature of society."
		},
		{
			"Year":"1981",
			"Question":"5(d) Power of the elite and the masses in democratic societies."
		},
		{
			"Year":"1981",
			"Question":"6. In what sense is family a primary group? Examine the correspondence between the nature and functions of the family on the one hand and the nature and functions of the state on the other, in a changing society."
		},
		{
			"Year":"1981",
			"Question":"7. Explain the basic features of “bureaucracy” and “oligarchy”. Do you, think that they have become a part or all modern societies? If so, why? Substantiate your answer with examples."
		},
		{
			"Year":"1981",
			"Question":"8. Analyse Weber’s thesis on the “protestant ethic and the spirit of capitalism”. In the light of this thesis do you think that all religions facilitate social change? Illustrate your answer."
		},
		{
			"Year":"1981",
			"Question":"1(a) Orthogenetic and heterogenetic factors of social change in India."
		},
		{
			"Year":"1981",
			"Question":"1(b) The changing position of woman in India."
		},
		{
			"Year":"1981",
			"Question":"1(c) Jajmani system."
		},
		{
			"Year":"1981",
			"Question":"1(d) Panchayati Raj."
		},
		{
			"Year":"1981",
			"Question":"2. Examine on the basis of empirical evidence whether castes are evolving into social classes. How do you account for the phenomenon of casteism?"
		},
		{
			"Year":"1981",
			"Question":"3. Describe the variation in the form, structure and function of the Indian family at present. Can this be under-stood in terms of rural-urban dichotomy? Elaborate your point of view."
		},
		{
			"Year":"1981",
			"Question":"4. Bring out the socio-cultural contexts of educational inequality. In view of these circumstances what measures you think are appropriate for the solution of the educational problems of the scheduled castes?"
		},
		{
			"Year":"1981",
			"Question":"5(a) Acculturation and integration of tribal communities."
		},
		{
			"Year":"1981",
			"Question":"5(b) Social structural impediments to the adaptation of family planning practices in India."
		},
		{
			"Year":"1981",
			"Question":"5(c) Socio-religious reform movements in modern India."
		},
		{
			"Year":"1981",
			"Question":"5(d) Socio-cultural causes of corruption."
		},
		{
			"Year":"1981",
			"Question":"6. Compare and contrast the stratification systems and ideological patterns among the major religious categories in India. Evaluate the problem of religious conversion against this background."
		},
		{
			"Year":"1981",
			"Question":"7. In what sense was the traditional Indian village a ‘community’? Bring out the impact of the Community Development Programme upon that ‘community’."
		},
		{
			"Year":"1981",
			"Question":"8. Describe the rural-urban differences in socio cultural characteristics such as caste and religion and bring out their implications for economic and political behaviour."
		},
		{
			"Year":"1982",
			"Question":"1(a) Sucide as a social fact."
		},
		{
			"Year":"1982",
			"Question":"1(b) Decent and Kinship as social networks."
		},
		{
			"Year":"1982",
			"Question":"1(c) Modernization and intergenerational mobility."
		},
		{
			"Year":"1982",
			"Question":"1(d) Suitability of questionnaire for data collection in developing societies."
		},
		{
			"Year":"1982",
			"Question":"2. How far do you agree with the view that while neopositivism reduces sociology measurement, functionalism directs attention towards meaning? Can functionalism explain dynamic social processes?"
		},
		{
			"Year":"1982",
			"Question":"3. Discuss the utility of Max Weber’s ideal type as a methodological tool. Explain how Weber uses the ideal type procedure to depict the authority patterns."
		},
		{
			"Year":"1982",
			"Question":"4. In social stratification a particular form of social inequality? Analyse the role of wealth, power and status in the perpetuation of stratification systems in the society."
		},
		{
			"Year":"1982",
			"Question":"5(a) Pressure groups and economic development."
		},
		{
			"Year":"1982",
			"Question":"5(b) Industrialization and regional imbalances."
		},
		{
			"Year":"1982",
			"Question":"5(c) Social movements and the uplift of the weaker sections."
		},
		{
			"Year":"1982",
			"Question":"5(d) Indoctrination and educational processes."
		},
		{
			"Year":"1982",
			"Question":"6. Discuss the role of participative decision making in formal and informal organizations. Is it possible to have workers’ participation in industrial organizations?"
		},
		{
			"Year":"1982",
			"Question":"7. Distinguish between science and religion. Examine religion as a functional and dysfunctional factor in the contemporary society."
		},
		{
			"Year":"1982",
			"Question":"8. Analyse Marxian theory of social change. Is it useful to comprehend the changes in the developing societies?"
		},
		{
			"Year":"1982",
			"Question":"1(a) Continuity and change in India."
		},
		{
			"Year":"1982",
			"Question":"1(b) Agrarian and industrial class structure."
		},
		{
			"Year":"1982",
			"Question":"1(c) Intergenerational gap and youth unrest."
		},
		{
			"Year":"1982",
			"Question":"1(d) Decentralization of power and political participation."
		},
		{
			"Year":"1982",
			"Question":"2. What are the features of economic development? Outline the social determinants and consequence of economic development in India."
		},
		{
			"Year":"1982",
			"Question":"3. Discuss the changing political relations in rural India in the context of democratic decentralization."
		},
		{
			"Year":"1982",
			"Question":"4. Critically examine the view that joint family organization in India is changing over to nuclear family."
		},
		{
			"Year":"1982",
			"Question":"5(a) Education and society mobility."
		},
		{
			"Year":"1982",
			"Question":"5(b) Direction of tribal change."
		},
		{
			"Year":"1982",
			"Question":"5(c) Socio-cultural dimensions of Indian villages"
		},
		{
			"Year":"1982",
			"Question":"5(d) Westernization and modernization."
		},
		{
			"Year":"1982",
			"Question":"6. Discuss industrialization and urbanization as inter related factors of social change in India."
		},
		{
			"Year":"1982",
			"Question":"7. What is a social movement? Discuss with examples the part played by social movements in bringing about social change in India."
		},
		{
			"Year":"1982",
			"Question":"8. What do you understand by population dynamics? Discuss the social dimensions of population control and family welfare programmes in India"
		},
		{
			"Year":"1983",
			"Question":"1(a) Participant observation and the problem of objectivity."
		},
		{
			"Year":"1983",
			"Question":"1(b) Functional prerequisites of society"
		},
		{
			"Year":"1983",
			"Question":"1(c) Religious and scientific world views."
		},
		{
			"Year":"1983",
			"Question":"1(d) Family in industrial societies."
		},
		{
			"Year":"1983",
			"Question":"2. Distinguish between social change and social development. How does the knowledge of Sociology help in the formulation of development policies?"
		},
		{
			"Year":"1983",
			"Question":"3. Discuss suicide as a social fact. While explaining the typology of suicide according to Durkheim, bring out the destabilising role of anomic in modern societies."
		},
		{
			"Year":"1983",
			"Question":"4. Are caste and class merely different forms of qualitatively different types of social stratification? Elucidate your point of view."
		},
		{
			"Year":"1983",
			"Question":"5(a) Bureaucracy and planned development."
		},
		{
			"Year":"1983",
			"Question":"5(b) Jajmani system as a form of exchange."
		},
		{
			"Year":"1983",
			"Question":"5(c) “Vote Banks” and the democratic process."
		},
		{
			"Year":"1983",
			"Question":"5(d) Secularization and social solidarity."
		},
		{
			"Year":"1983",
			"Question":"6. Analyse the social determinants of industrialization. Will industrialization per se lead to equality and balanced development in the society?"
		},
		{
			"Year":"1983",
			"Question":"7. Do you agree with the view that legitimacy is a powerful instrument in the hands of the elite in the contemporary society? What are the different grounds on which ruling elite have tried to legitimize their authority in democratic and totalitartian societies?"
		},
		{
			"Year":"1983",
			"Question":"8. Examine the concept of equality of educational opportunity. What are the socialconstraints and social consequences implicit in the pursuit of this goal?"
		},
		{
			"Year":"1983",
			"Question":"1(a) Universalisation and parochialisation in Indian civilization."
		},
		{
			"Year":"1983",
			"Question":"1(b) Bride and bridegroom price."
		},
		{
			"Year":"1983",
			"Question":"1(c) The changing social composition of the political elite since Independence."
		},
		{
			"Year":"1983",
			"Question":"1(d) Unionization and the agrarian classes."
		},
		{
			"Year":"1983",
			"Question":"2. What is the relative role of ritual and secular factors in the traditional caste system? Explain how their role in changing in the modern time."
		},
		{
			"Year":"1983",
			"Question":"3. Distinguish between the Indological and the Sociological views on the Hindu family and show how the former has influenced the latter."
		},
		{
			"Year":"1983",
			"Question":"4. Examine with particular reference to Scheduled Castes and Scheduled Tribes, the view that education promotes social equality."
		},
		{
			"Year":"1983",
			"Question":"5(a) Religious minorities and national integration."
		},
		{
			"Year":"1983",
			"Question":"5(b) Distinction between tribe caste."
		},
		{
			"Year":"1983",
			"Question":"5(c) Socio-cultural dimensions of infant mortality in India."
		},
		{
			"Year":"1983",
			"Question":"5(d) Women’s role in economic development."
		},
		{
			"Year":"1983",
			"Question":"6. Discuss the efficacy of land reforms to transform India’s agrarian social structure."
		},
		{
			"Year":"1983",
			"Question":"7. Examine the view that the traditional social institutions of India are a major impediment to its industralisation."
		},
		{
			"Year":"1983",
			"Question":"8. How far is, it true to say that the urban social structure in India is only a replica of the rural social structure?"
		},
		{
			"Year":"1984",
			"Question":"1(a) Report and objective in social science research."
		},
		{
			"Year":"1984",
			"Question":"1(b) Alienation in developing societies."
		},
		{
			"Year":"1984",
			"Question":"1(c) Change in sex roles and the socialization of children."
		},
		{
			"Year":"1984",
			"Question":"1(d) Social aspects of industrial economic system."
		},
		{
			"Year":"1984",
			"Question":"2. Do you agree with the view that sociology can never be a science? What limitations need to be taken into consideration in the scientific study of social phenomena?"
		},
		{
			"Year":"1984",
			"Question":"3. Discuss Max’s concept of class. Is class struggle inevitable for the elimination of inequalities and exploitation in the third world societies?"
		},
		{
			"Year":"1984",
			"Question":"4. Analyse scientific theory of culture. Will the crisis in culture in the contemporary society facilitate the emergence of new man?"
		},
		{
			"Year":"1984",
			"Question":"5(a) Ideal types and social analysis."
		},
		{
			"Year":"1984",
			"Question":"5(b) Changing concept of property."
		},
		{
			"Year":"1984",
			"Question":"5(c) Religious factor in economic development."
		},
		{
			"Year":"1984",
			"Question":"5(d) Education and modernization."
		},
		{
			"Year":"1984",
			"Question":"6. Discuss family as a basic and fundamental social institution. Do you think the changing sex roles necessitate the replacement of family by another institution?"
		},
		{
			"Year":"1984",
			"Question":"7. Explain the role of community power structure in the political decision-making processes in the society. Are power and authority getting broad based in India today?"
		},
		{
			"Year":"1984",
			"Question":"8. Examine the relationship between social structure and social change. Has the Indian social structure facilitated or hindered the process of change?"
		},
		{
			"Year":"1984",
			"Question":"1(a) Caste among the non-Hindus."
		},
		{
			"Year":"1984",
			"Question":"1(b) Scheduled caste elites."
		},
		{
			"Year":"1984",
			"Question":"1(c) The changing status of women."
		},
		{
			"Year":"1984",
			"Question":"1(d) Dominant caste and the agrarian power structure."
		},
		{
			"Year":"1984",
			"Question":"2. What is the structural perspective on the caste system? Is it not an oversimplification to describe the system as a hierarchy of statuses based on the opposition of the pure and impure?"
		},
		{
			"Year":"1984",
			"Question":"3. Describe the main characteristics of Jaimani system. Do you agree with the view that it is basically an Institution of politico-economic dominance and dependence?"
		},
		{
			"Year":"1984",
			"Question":"4. Discuss the social consequences of economic development in India. Do you share the view that it has increased economic inequality and failed to promote social justice?"
		},
		{
			"Year":"1984",
			"Question":"5(a) The impact of democratization on the village community."
		},
		{
			"Year":"1984",
			"Question":"5(b) The social background of poverty."
		},
		{
			"Year":"1984",
			"Question":"5(c) Rural-urban migration."
		},
		{
			"Year":"1984",
			"Question":"5(d) The future of tribal culture."
		},
		{
			"Year":"1984",
			"Question":"6. Examine the role of caste as a pressure-group in contemporary Indian politics."
		},
		{
			"Year":"1984",
			"Question":"7. Trace the impact of urbanization on the Hindu family."
		},
		{
			"Year":"1984",
			"Question":"8. How far is tradition a barrier to modernization? Does not modernization take to form of traditionalization in India?"
		},
		{
			"Year":"1985",
			"Question":"1(a) Sociology is a science of society."
		},
		{
			"Year":"1985",
			"Question":"1(b) Research Design."
		},
		{
			"Year":"1985",
			"Question":"1(c) Interview as a method of social research."
		},
		{
			"Year":"1985",
			"Question":"1(d) Religion and society."
		},
		{
			"Year":"1985",
			"Question":"2. Discuss the contributions of Durkheim to sociology. How far did his methodology influence sociological traditions?"
		},
		{
			"Year":"1985",
			"Question":"3. How does culture influence personality? Can personality influence culture? How?"
		},
		{
			"Year":"1985",
			"Question":"4. What are the agencies of social control? Which is the most effective one in a democratic society?"
		},
		{
			"Year":"1985",
			"Question":"5(a) Planned development in a democracy."
		},
		{
			"Year":"1985",
			"Question":"5(b) Power."
		},
		{
			"Year":"1985",
			"Question":"5(c) Social Mobility."
		},
		{
			"Year":"1985",
			"Question":"5(d) Youth Culture."
		},
		{
			"Year":"1985",
			"Question":"6. Has development been successful in removing poverty? Can you relate development to progress?"
		},
		{
			"Year":"1985",
			"Question":"7. Can education be considered as an agent of social change? In what manner can it establish a new social order?"
		},
		{
			"Year":"1985",
			"Question":"8. How is Marxism relevant to developing nations? Will it be able to establish classless societies?"
		},
		{
			"Year":"1985",
			"Question":"1(a) Divorce among the Muslims."
		},
		{
			"Year":"1985",
			"Question":"1(b) Protective discrimination: its sociology and politics."
		},
		{
			"Year":"1985",
			"Question":"1(c) Kula, Vansa and Gotra."
		},
		{
			"Year":"1985",
			"Question":"1(d) Inequality in the agrarian social structure."
		},
		{
			"Year":"1985",
			"Question":"2. Comment on the distinction between ‘hierarchy’ and ‘social stratification’. Which of the two will be a more appropriate term to describe the caste system and why?"
		},
		{
			"Year":"1985",
			"Question":"3. Discuss the process of social mobility in the caste system commonly described as sanskritization and westernization. Have they eflected any structural change in the system?"
		},
		{
			"Year":"1985",
			"Question":"4. Examine the impact of recent social legislation on Hindu marriage and family with special reference to the status of women."
		},
		{
			"Year":"1985",
			"Question":"5(a) Education for social equality."
		},
		{
			"Year":"1985",
			"Question":"5(b) Planning for the rural poor: IRDP and NREP."
		},
		{
			"Year":"1985",
			"Question":"5(c) Religious and ethlnic conflict in India."
		},
		{
			"Year":"1985",
			"Question":"5(d) Servodava as a social movement."
		},
		{
			"Year":"1985",
			"Question":"6. What is the link between industrialisation and urbanisation? Answer with reference to India."
		},
		{
			"Year":"1985",
			"Question":"7. Discuss the salient features of the demographic situation in India. What are the prospects of reducing the birth rate and stabilizing it in the near feature?"
		},
		{
			"Year":"1985",
			"Question":"8. How far is generational disaffiliation responsible for youth activism in India? Why is the Indian youth failing to respond to the national challenges?"
		},
		{
			"Year":"1986",
			"Question":"1(a) The problem of objectivity in Sociology."
		},
		{
			"Year":"1986",
			"Question":"1(b) Techniques employed in measuring attitudes."
		},
		{
			"Year":"1986",
			"Question":"1(c) Bureaucracy in developing societies"
		},
		{
			"Year":"1986",
			"Question":"1(d) New strategies for the rural development in India."
		},
		{
			"Year":"1986",
			"Question":"2. Discuss Durkheim’s concept of Division of labour. In what way does it differ from that of classical and neoclassical economists? "
		},
		{
			"Year":"1986",
			"Question":"3. Show how culture constituted a seminal idea in B. Malinowski’s works."
		},
		{
			"Year":"1986",
			"Question":"4. What is ‘social action’? what is its place in the analytical Frameworks of Max Weber and Talcott Parsons?"
		},
		{
			"Year":"1986",
			"Question":"5(a) Ethnic group and its role in society."
		},
		{
			"Year":"1986",
			"Question":"5(b) Historical materialism."
		},
		{
			"Year":"1986",
			"Question":"6. Critically assess R.K. Mertion’s views on the contributions of research to the development of sociological theory."
		},
		{
			"Year":"1986",
			"Question":"7. How do you relate the educational system to the economic development in India?"
		},
		{
			"Year":"1986",
			"Question":"8. Discuss the role of religion to the world today. Has the supergrowth of science any de mystifying effect on religion?"
		},
		{
			"Year":"1986",
			"Question":"1(a) The case for a uniform civil code."
		},
		{
			"Year":"1986",
			"Question":"1(b) The Indian family in continuity and change."
		},
		{
			"Year":"1986",
			"Question":"1(c) Class-conflict in the agrarian society"
		},
		{
			"Year":"1986",
			"Question":"1(d) The Indian intellectual between tradition and modernity."
		},
		{
			"Year":"1986",
			"Question":"2. Examine the impact of Buddhism aud Islam on the Hindu society."
		},
		{
			"Year":"1986",
			"Question":"3. ‘Despite all the fusion and fusion that the caste system has undergone through the ages. It has binded to maintain the permanency of its form’. Comment."
		},
		{
			"Year":"1986",
			"Question":"4. Discuss the changing value-orientations of women in the Indian middle class families. "
		},
		{
			"Year":"1986",
			"Question":"5(a) Education for development: the sociological implications of the new education policy."
		},
		{
			"Year":"1986",
			"Question":"5(b) Communal tensions: their economic and social background."
		},
		{
			"Year":"1986",
			"Question":"5(c) Urban emerging pattern of rural leadership."
		},
		{
			"Year":"1986",
			"Question":"5(d) Urban decay: the culture of overcrowded neigh-bourhoods and slums in industrial cities. "
		},
		{
			"Year":"1986",
			"Question":"6. Trace the impact of culture contact on the Indian tribes."
		},
		{
			"Year":"1986",
			"Question":"7. Discuss the factors responsible for the growing felling of alienation among the religious minorities in India. How can they be made to overcome this feeling?"
		},
		{
			"Year":"1986",
			"Question":"8. Stress the importance of regional development in the context of national planning in India. Can regional disparities be reduced within the framework of a centralist planning?"
		},
		{
			"Year":"1987",
			"Question":"1(a) Techniques of Data Collection"
		},
		{
			"Year":"1987",
			"Question":"1(b) Ideal Types"
		},
		{
			"Year":"1987",
			"Question":"1(c) Social Movement"
		},
		{
			"Year":"1987",
			"Question":"1(d) Alienation."
		},
		{
			"Year":"1987",
			"Question":"2. Do you agree with Max Weber that the Protestant Ethic and the Spirit of Capitalism are correlated? What are the alternative theories suggested by other academics?"
		},
		{
			"Year":"1987",
			"Question":"3. A.R. Radcliffe-Brown is said to have improved upon B. Malinowski’s Functional theory. Discuss, how."
		},
		{
			"Year":"1987",
			"Question":"4. Do you think that in T. Parsons there has been a transition from the analysis of the structure of social action as such to the structural-functional analysis of social systems”? discuss in detail."
		},
		{
			"Year":"1987",
			"Question":"5(a) Authoritarian Personality"
		},
		{
			"Year":"1987",
			"Question":"5(b) Collective Representations"
		},
		{
			"Year":"1987",
			"Question":"5(c) Religious Secularization"
		},
		{
			"Year":"1987",
			"Question":"5(d) Legitimacy."
		},
		{
			"Year":"1987",
			"Question":"6. Critically examine the statement. A study of power inevitably involves an investigation of social class."
		},
		{
			"Year":"1987",
			"Question":"7. What is meant by Equality of Educational Opportunities? What are its possibilities in developing countries?"
		},
		{
			"Year":"1987",
			"Question":"8. Do you accept that Marxism offers a ‘pre-fabricated theory of social change’? Discuss critically."
		},
		{
			"Year":"1987",
			"Question":"1(a) Role of Elite in social transformation"
		},
		{
			"Year":"1987",
			"Question":"1(b) Reservations: Need and achievement"
		},
		{
			"Year":"1987",
			"Question":"1(c) Convergence of class and caste"
		},
		{
			"Year":"1987",
			"Question":"1(d) Crimes against women."
		},
		{
			"Year":"1987",
			"Question":"2. Assess the impact of the west in shaping the Indian Renaissance Movement in the 19th century."
		},
		{
			"Year":"1987",
			"Question":"3. Is the caste system immobile? Bring out the factors promoting intra-caste and intercaste mobility."
		},
		{
			"Year":"1987",
			"Question":"4. Examine the roots of youth unrest. How can we channel youth power for national development?"
		},
		{
			"Year":"1987",
			"Question":"5(a) Unequal access to education"
		},
		{
			"Year":"1987",
			"Question":"5(b) Bonded labour"
		},
		{
			"Year":"1987",
			"Question":"5(c) Role of mass media in modernization."
		},
		{
			"Year":"1987",
			"Question":"5(d) Reaching development to the rural poor."
		},
		{
			"Year":"1987",
			"Question":"6. Analyses the different dimensions of the integration of tribes in the national polity. How can the process be accelerated?"
		},
		{
			"Year":"1987",
			"Question":"7. Bring out the socio-cultural constraints in population control in rural areas. Suggest steps to make population control measures more effective."
		},
		{
			"Year":"1987",
			"Question":"8. Is corruption a necessary concomitant of development? How can it be curbed?"
		},
		{
			"Year":"1988",
			"Question":"1(a) Experimental design."
		},
		{
			"Year":"1988",
			"Question":"1(b) Bearing of research on theory."
		},
		{
			"Year":"1988",
			"Question":"1(c) Functional theory of stratification."
		},
		{
			"Year":"1988",
			"Question":"1(d) Structural principles of kinship."
		},
		{
			"Year":"1988",
			"Question":"2. Explain the basic premises of the anti-positivist attack on sociology. Do you agree with these? Substantiate your answer."
		},
		{
			"Year":"1988",
			"Question":"3. Discuss the relation between social structure and anomie as presented by R.K. Merton Attempt a critical appraisal of this analysis."
		},
		{
			"Year":"1988",
			"Question":"4. In what respects do you think Weber’s conception of sociology differs from that of Durkheim? Which one of the two is more satisfactory? Substantiate your answer."
		},
		{
			"Year":"1988",
			"Question":"5(a) Achievement orientation."
		},
		{
			"Year":"1988",
			"Question":"5(b) Theory of underdevelopment."
		},
		{
			"Year":"1988",
			"Question":"5(c) Formal organization."
		},
		{
			"Year":"1988",
			"Question":"5(d) Types of social ……ements."
		},
		{
			"Year":"1988",
			"Question":"6. Attempt a comparative analysis of the Weberian and Marxian theories of social change. Which do you think is more relevant to the Indian society at present? Give reasous for your answer."
		},
		{
			"Year":"1988",
			"Question":"7. Examine the role of education is cultural continuity. In the context of the Indian society, how would you reconcile this with the demands for social change?"
		},
		{
			"Year":"1988",
			"Question":"8. What do you understand by community power structure? discuss the major changes in recent times in the pattern of the distribution of power in Indian society."
		},
		{
			"Year":"1988",
			"Question":"1(a) Regional Variation in Kinship System."
		},
		{
			"Year":"1988",
			"Question":"1(b) Intergenerational Gap"
		},
		{
			"Year":"1988",
			"Question":"1(c) Industrialization and caste."
		},
		{
			"Year":"1988",
			"Question":"1(d) Linguistic Conflicts"
		},
		{
			"Year":"1988",
			"Question":"2. Examine the historical roots of Indian society and identify the factors of continuity and change in it."
		},
		{
			"Year":"1988",
			"Question":"3. The organic solidarity of caste has given way to competitive solidarity. Discuss this statement in the context of the processes of fission and fusion in the Caste system."
		},
		{
			"Year":"1988",
			"Question":"4. Analyse the traditional production relations in Indian villages in the framework of the jajmani system. Account for tis disappearance in recent tines."
		},
		{
			"Year":"1988",
			"Question":"5(a) Grass root Planning."
		},
		{
			"Year":"1988",
			"Question":"5(b) Demoncratic Decentralization."
		},
		{
			"Year":"1988",
			"Question":"5(c) Intergrated Rurol Development Programme."
		},
		{
			"Year":"1988",
			"Question":"5(d) Acculturation."
		},
		{
			"Year":"1988",
			"Question":"6. Discuss the role of the state in restructuring Indian Society since Independence. Examine the effectiveness of such interventions."
		},
		{
			"Year":"1988",
			"Question":"7. Analyse the limitations of working a democratic political system in a traditional society."
		},
		{
			"Year":"1988",
			"Question":"8. Distinguish between Westernization and Modernization. How do tradition and modernity co-exist in India?"
		},
		{
			"Year":"1989",
			"Question":"1(a) Science and Social Behaviour"
		},
		{
			"Year":"1989",
			"Question":"1(b) Open and Closed Models of Mobility"
		},
		{
			"Year":"1989",
			"Question":"1(c) Alienation"
		},
		{
			"Year":"1989",
			"Question":"1(d) Pre industrial Economic System"
		},
		{
			"Year":"1989",
			"Question":"2. Is the Durkheimian concept of religion entirely different from that of his predecessors? Why and how?"
		},
		{
			"Year":"1989",
			"Question":"3. Had the French Revolution anything to do with the emergency os Sociology in Europe? Make a critical study."
		},
		{
			"Year":"1989",
			"Question":"4. How does Malinowski differ from Radcliffe Brown on the concept of functionalism?"
		},
		{
			"Year":"1989",
			"Question":"5(a) Measurement of Attitudes"
		},
		{
			"Year":"1989",
			"Question":"5(b) Formal and Informal Structures of Bureaucracy"
		},
		{
			"Year":"1989",
			"Question":"5(c) Power of the Elite"
		},
		{
			"Year":"1989",
			"Question":"5(d) Education and Modernisation"
		},
		{
			"Year":"1989",
			"Question":"6. What does Weber mean by ideal types? How is the concept relevant in sociology?"
		},
		{
			"Year":"1989",
			"Question":"7. How do changes in the age and sex roles in the family affect the social structure itself?"
		},
		{
			"Year":"1989",
			"Question":"8. How far are social policy and directed social change effective in social development?"
		},
		{
			"Year":"1989",
			"Question":"1(a) Purushartha"
		},
		{
			"Year":"1989",
			"Question":"1(b) Social implications of inter caste marriage"
		},
		{
			"Year":"1989",
			"Question":"1(c) Orthogenetic and heterogenetic factos of social change in India"
		},
		{
			"Year":"1989",
			"Question":"1(d) Secularism as a scientific concept"
		},
		{
			"Year":"1989",
			"Question":"2. ‘The soil grow castes: the machines makes classes.’ Comment."
		},
		{
			"Year":"1989",
			"Question":"3. Analyse the impact of the modern West on traditional social values in India."
		},
		{
			"Year":"1989",
			"Question":"4. Examine the social consequences of economic development with special reference to India."
		},
		{
			"Year":"1989",
			"Question":"5(a) Green Revolution and Social Tensions"
		},
		{
			"Year":"1989",
			"Question":"5(b) Electoral Reform in India"
		},
		{
			"Year":"1989",
			"Question":"5(c) Integration of Tribes"
		},
		{
			"Year":"1989",
			"Question":"5(d) Rationale behind protective Discrimination"
		},
		{
			"Year":"1989",
			"Question":"6. Delmeate the contents of the New Education Policy. Has it made any dent in the educational system?"
		},
		{
			"Year":"1989",
			"Question":"7. Analyse the socio economic factors that continue to depress the position of women in Indian society. What steps have been taken to remedy the situation in recent years?"
		},
		{
			"Year":"1989",
			"Question":"8. Discuss the basic problems of the Scheduled castes. Bring out the impact of conversion on their social status."
		},
		{
			"Year":"1990",
			"Question":"1(a) Participant observation"
		},
		{
			"Year":"1990",
			"Question":"1(b) Bureaucracy and economic development"
		},
		{
			"Year":"1990",
			"Question":"1(c) Status inconsistency"
		},
		{
			"Year":"1990",
			"Question":"1(d) Conformity and deviance"
		},
		{
			"Year":"1990",
			"Question":"2. Alcott Parsons’ theory of social system has been criticized as a veiled status quoits ideology. Critically examine valid and justified in this criticism."
		},
		{
			"Year":"1990",
			"Question":"3. How does Marx’s treatment of alienation differ from that of other sociologists?"
		},
		{
			"Year":"1990",
			"Question":"4. What does R.K. Merton mean when he admits that not everything works out for the best of everyone in society? What is his improvement on functional theory?"
		},
		{
			"Year":"1990",
			"Question":"5(a) Education and inequality"
		},
		{
			"Year":"1990",
			"Question":"5(b) Directed social change"
		},
		{
			"Year":"1990",
			"Question":"5(c) Community power structure"
		},
		{
			"Year":"1990",
			"Question":"5(d) Socialization and personality"
		},
		{
			"Year":"1990",
			"Question":"6. Trace the Psychological and Sociological roots of social movements in society today. Do social movements facilitate social change?"
		},
		{
			"Year":"1990",
			"Question":"7. Discuss the nature and character of voluntary associations. What is their importance in developing societies."
		},
		{
			"Year":"1990",
			"Question":"8. ‘Religion is said to have emancipated human beings on the one hand but it also alienates them on the other.’ Bring out the paradoxical functions religion plays in a modern secular society."
		},
		{
			"Year":"1990",
			"Question":"1(a) Basic features of traditional Hindu social organisation."
		},
		{
			"Year":"1990",
			"Question":"1(b) Market economy and Agrarian social structure"
		},
		{
			"Year":"1990",
			"Question":"1(c) Religion and national integration in India."
		},
		{
			"Year":"1990",
			"Question":"1(d) Corruption and Political process"
		},
		{
			"Year":"1990",
			"Question":"2. Action, for the Indian is not individualistic but societal. Critically evaluate the statement."
		},
		{
			"Year":"1990",
			"Question":"3. Discuse the process of mobility that has taken place in the caste structure in India in this context, explain the convergence of caste and class."
		},
		{
			"Year":"1990",
			"Question":"4. Critically assess the role of social legislation in bringing about basic structural changes it marriage, family and property in India. What are the main obstacles in evolving a common Civil Code?"
		},
		{
			"Year":"1990",
			"Question":"5(a) Cultural factors in the adoption of family planning in India"
		},
		{
			"Year":"1990",
			"Question":"5(b) Educational inequality and social change"
		},
		{
			"Year":"1990",
			"Question":"5(c) Sociological perspective of ‘Right to Work’ in India"
		},
		{
			"Year":"1990",
			"Question":"5(d) Political power and rural development in India"
		},
		{
			"Year":"1990",
			"Question":"6. ‘Indian tradition, today exhibits a form of neo-traditionsalism along with modernisation.’ Comment."
		},
		{
			"Year":"1990",
			"Question":"7. What are the main social determinants of economic development in India? Examine this question with special reference to the growth of entrepreneurship and the rise of business houses in India."
		},
		{
			"Year":"1990",
			"Question":"8. Critically evaluate the role of religion and ethniqity in Indian politics since the First General Electtons in 1952."
		},
		{
			"Year":"1991",
			"Question":"1(a) The problem of objectivity"
		},
		{
			"Year":"1991",
			"Question":"1(b) Social control"
		},
		{
			"Year":"1991",
			"Question":"1(c) Protestant Ethic"
		},
		{
			"Year":"1991",
			"Question":"1(d) Modernisation."
		},
		{
			"Year":"1991",
			"Question":"2. ‘Why does the individual, while becoming more autonomous, depend more upon society? (Durkheim). How has the author tried to answer this question?"
		},
		{
			"Year":"1991",
			"Question":"3. How does Parsons defend the nuclear family in promoting industrialisation? Is his thesis universally valid?"
		},
		{
			"Year":"1991",
			"Question":"4. ‘The history of the hitherto existing societies is the history of class struggle.’ Critically comment on this Marxian thesis."
		},
		{
			"Year":"1991",
			"Question":"5(a) Methods of scientific investigation"
		},
		{
			"Year":"1991",
			"Question":"5(b) Functional theory of stratification"
		},
		{
			"Year":"1991",
			"Question":"5(c) Intergenerational mobility"
		},
		{
			"Year":"1991",
			"Question":"5(d) The sacred and the profane."
		},
		{
			"Year":"1991",
			"Question":"6. What is the importance of Merton’s Middle Range Theory in sociology? Discuss critically."
		},
		{
			"Year":"1991",
			"Question":"7. What role can the power of unorganized masses play in bringing about social change in a democratic society?"
		},
		{
			"Year":"1991",
			"Question":"8. ‘Education is induction into the Learner’s culture’. Examine the statement in society today."
		},
		{
			"Year":"1991",
			"Question":"1(a) Ritual purity and pollution in Hindu Society"
		},
		{
			"Year":"1991",
			"Question":"1(b) Social responsibility of political elites"
		},
		{
			"Year":"1991",
			"Question":"1(c) Bonded-labour"
		},
		{
			"Year":"1991",
			"Question":"1(d) Plural society and secularism"
		},
		{
			"Year":"1991",
			"Question":"2. ‘Family jointness still continues unaffected by the differences of religion, caste, urbanization and occupation.’ Elucidate."
		},
		{
			"Year":"1991",
			"Question":"3. Privatization of economy can often result in growing social inequalities explotation and corruption. How far are these fears justified in the Indian context? "
		},
		{
			"Year":"1991",
			"Question":"4. Discuss the changes in the structure of power relationships of various castes at the regional levels."
		},
		{
			"Year":"1991",
			"Question":"5(a) The share-croppers’ movement in India"
		},
		{
			"Year":"1991",
			"Question":"5(b) The demographic transition"
		},
		{
			"Year":"1991",
			"Question":"5(c) TRYSEM- as a measure for rural development"
		},
		{
			"Year":"1991",
			"Question":"5(d) Common civil Code and status of women"
		},
		{
			"Year":"1991",
			"Question":"6. ‘Institutionalised inequality in India has its cultural and economic coordinates.’ Discuss."
		},
		{
			"Year":"1991",
			"Question":"7. Is legitimacy of key political institutions declining in India? Discuss this issue in the context of the process of nation-building."
		},
		{
			"Year":"1991",
			"Question":"8. ‘Uneven development is the major source of tribal unrest in India.’ Examine the statement in relation to the movements in tribal India."
		},
		{
			"Year":"1992",
			"Question":"1(a) Design of sociological research."
		},
		{
			"Year":"1992",
			"Question":"1(b) Parsons idea of equilibrium."
		},
		{
			"Year":"1992",
			"Question":"1(c) Concept of social structure."
		},
		{
			"Year":"1992",
			"Question":"1(d) Internal contradictions."
		},
		{
			"Year":"1992",
			"Question":"2. What are the basic questions which inspired Durkheim to study the division of labour in society? Critically comment on his conclusions."
		},
		{
			"Year":"1992",
			"Question":"3. Critically bring out the differences in the approaches of Karl Marx and Max Weber to the study of class structure in industrial capitalist society."
		},
		{
			"Year":"1992",
			"Question":"4. Examine critically the place of culture in Malinowski’s contribution of functional society."
		},
		{
			"Year":"1992",
			"Question":"5(a) Informal structure of bureaucracy."
		},
		{
			"Year":"1992",
			"Question":"5(b) Education as a medium of cultural reproduction."
		},
		{
			"Year":"1992",
			"Question":"5(c) Social consequences of increase in the rate or divorce"
		},
		{
			"Year":"1992",
			"Question":"5(d) Merits and demerits of secret ballot in democracy"
		},
		{
			"Year":"1992",
			"Question":"6. ‘Social inequality is the device by which societies ensure that the most important positions are filled by the most qualified persons.’ Explain this viewpoint and state the grounds on which it is refuted."
		},
		{
			"Year":"1992",
			"Question":"7. Elaborate the concepts of ‘status –consistency’ and ‘status-inconsistency’. State the factors responsible for ‘status inconsistency’ in modern societies."
		},
		{
			"Year":"1992",
			"Question":"8. What is happening to religion in the face of challenges of science in modern societies? Elaborate your answer with the help of sociological literature."
		},
		{
			"Year":"1992",
			"Question":"1(a) Urban social organization."
		},
		{
			"Year":"1992",
			"Question":"1(b) Ethnic diversity and education."
		},
		{
			"Year":"1992",
			"Question":"1(c) Mass-Media and education."
		},
		{
			"Year":"1992",
			"Question":"1(d) Rural credit and its bearing on poverty."
		},
		{
			"Year":"1992",
			"Question":"2. Examine the features of continuity and change of Indian society in historical perspective."
		},
		{
			"Year":"1992",
			"Question":"3. ‘Erosion of ecology and economy, and not politicization, is the main source of tribal unrest in India today. Examine the validity of this statement."
		},
		{
			"Year":"1992",
			"Question":"4. How has the process of social and cultural change been examined by Indian sociologists? Discuss their approaches."
		},
		{
			"Year":"1992",
			"Question":"5(a) Social consequences of market economy."
		},
		{
			"Year":"1992",
			"Question":"5(b) Educational problem of rural women."
		},
		{
			"Year":"1992",
			"Question":"5(c) Sanskritization."
		},
		{
			"Year":"1992",
			"Question":"5(d) Changing pattern of Hindu joint family."
		},
		{
			"Year":"1992",
			"Question":"6. Probe the social consequences of the land ceiling legislation in any one of the Indian States and state the major difficulties in its implementation."
		},
		{
			"Year":"1992",
			"Question":"7. ‘The market cannot function without State: Critically examine the statement within the Indian context."
		},
		{
			"Year":"1992",
			"Question":"8. Explain how emerging rural-urban nexuses are reshaping the character of Indian political elite and functioning of political institutions."
		},
		{
			"Year":"1993",
			"Question":"1(a) Ideology and the emergence of Sociology"
		},
		{
			"Year":"1993",
			"Question":"1(b) Methods of Sociology according to Max Weber"
		},
		{
			"Year":"1993",
			"Question":"1(c) Concepts of functional alternatives"
		},
		{
			"Year":"1993",
			"Question":"1(d) Social determinants of economic development"
		},
		{
			"Year":"1993",
			"Question":"2. Critically examine AGIL model of Talcott Parsons. How far is this model capable of explaining social changes in society?"
		},
		{
			"Year":"1993",
			"Question":"3. Describe the functional analysis of religion given by Durkheim. Is this analysis applicable to the modern industrialized societies?"
		},
		{
			"Year":"1993",
			"Question":"4. Give a brief account of the trends in sociological analysis of change in traditional family and kinship systems in the face of industrialization."
		},
		{
			"Year":"1993",
			"Question":"5(a) Significance of objectivity in sociological research"
		},
		{
			"Year":"1993",
			"Question":"5(b) Social class and vertical mobility"
		},
		{
			"Year":"1993",
			"Question":"5(c) Dysfunctions of bureaucracy"
		},
		{
			"Year":"1993",
			"Question":"5(d) Protest movements"
		},
		{
			"Year":"1993",
			"Question":"6. Explain Karl Marx’s theory of social stratification. On what grounds functionalists refute it?"
		},
		{
			"Year":"1993",
			"Question":"7. Bring the relationship between culture and personality. Discuss with examples the differences in personalities in the same culture."
		},
		{
			"Year":"1993",
			"Question":"8. Evaluate the functioning of political parties in the democracies of the Third World."
		},
		{
			"Year":"1993",
			"Question":"1(a) Primitive Communism"
		},
		{
			"Year":"1993",
			"Question":"1(b) Muslim women and divorce"
		},
		{
			"Year":"1993",
			"Question":"1(c) Minority groups and communalism"
		},
		{
			"Year":"1993",
			"Question":"1(d) Panchayati Raj and rural leadership"
		},
		{
			"Year":"1993",
			"Question":"2. Examine the unity and limitations of indological source material to understanding of Indian society."
		},
		{
			"Year":"1993",
			"Question":"3. Explain the paradox of social change in the modern Indian society and describe the factors responsible for it."
		},
		{
			"Year":"1993",
			"Question":"4. Explain issue emerging from inter-religion interaction in India to-day. Evaluate them in the context of secularism in India. "
		},
		{
			"Year":"1993",
			"Question":"5(a) Pressure groups in Indian politics"
		},
		{
			"Year":"1993",
			"Question":"5(b) Positive and preventive checks on population"
		},
		{
			"Year":"1993",
			"Question":"5(c) Social movements and social mobility"
		},
		{
			"Year":"1993",
			"Question":"5(d) Social significance of Grihasthasrama"
		},
		{
			"Year":"1993",
			"Question":"6. Discuss the executive measures and peoples’ participation in implementing various development programmes at the village level in India."
		},
		{
			"Year":"1993",
			"Question":"7. What were the main trends of social reforms movements in nineteenth century? Critically discuss any one internal revitalization movement in Indian society."
		},
		{
			"Year":"1993",
			"Question":"8. Discuss the educational problems of weaker sections in India. What are the measures adopted to solve these problems?"
		},
		{
			"Year":"1994",
			"Question":"1(a) Intellectual sources for the rise of Sociology"
		},
		{
			"Year":"1994",
			"Question":"1(b) Malinowski’s concept of culture"
		},
		{
			"Year":"1994",
			"Question":"1(c) Organic analogy"
		},
		{
			"Year":"1994",
			"Question":"1(d) Ideal types"
		},
		{
			"Year":"1994",
			"Question":"2. State Talcott Parsons’ contribution to theory of social action. What are the limitations of this theory?"
		},
		{
			"Year":"1994",
			"Question":"3. In modern structural-functionalism. Merton’s effort to develop a “Paradigm” for functional analysis in the most significant one. Evaluate this statement."
		},
		{
			"Year":"1994",
			"Question":"4. What did Max Weber mean by Interpretative under standing? Why did he believe that to model sociological researches exclusively on strategies and ambitions of natural sciences was a serious mistatke?"
		},
		{
			"Year":"1994",
			"Question":"5(a) Comparative method in Sociology"
		},
		{
			"Year":"1994",
			"Question":"5(b) Authority"
		},
		{
			"Year":"1994",
			"Question":"5(c) Pathological form of division of labour"
		},
		{
			"Year":"1994",
			"Question":"5(d) Types of social movements"
		},
		{
			"Year":"1994",
			"Question":"6. Critically examine Karl Marx’s theory of alienation."
		},
		{
			"Year":"1994",
			"Question":"7. Explain the view that the nuclear family “fits” the needs of industrial society. Is it that the structure of nuclear family is the same in all industrial societies?"
		},
		{
			"Year":"1994",
			"Question":"8. What is Social Policy and its relevance to social development. Under what circumstances social policy becomes a hinderance in social development?"
		},
		{
			"Year":"1994",
			"Question":"1(a) Caste and occupational mobility"
		},
		{
			"Year":"1994",
			"Question":"1(b) Changing social origins of political elites in India"
		},
		{
			"Year":"1994",
			"Question":"1(c) Social consequences of land ceiling legislation"
		},
		{
			"Year":"1994",
			"Question":"1(d) Minority status and religious conversions"
		},
		{
			"Year":"1994",
			"Question":"2. “Buddhism is a social movement against hierarchical tradition for social equality in Indian society.” Discuss."
		},
		{
			"Year":"1994",
			"Question":"3. Discuss the functions of traditional economic institutions in India. Analyse the factors responsible for change in them."
		},
		{
			"Year":"1994",
			"Question":"4. Explain the relationship of human resource development and education in modern context."
		},
		{
			"Year":"1994",
			"Question":"5(a) Caste among Muslims in India."
		},
		{
			"Year":"1994",
			"Question":"5(b) Legislation and socio economic change in family"
		},
		{
			"Year":"1994",
			"Question":"5(c) Sources of tribal unrest in India"
		},
		{
			"Year":"1994",
			"Question":"5(d) Decentralization of power and local development"
		},
		{
			"Year":"1994",
			"Question":"6. Explain continuity and change of traditional social institutions in urban community in India. How are they adopting to the process of urban development."
		},
		{
			"Year":"1994",
			"Question":"7. Evaluate the role of state in social and economic reconstruction of Indian Society since independence."
		},
		{
			"Year":"1994",
			"Question":"8. “Poverty breeds poverty in rural India.” Evaluate integrated Rural Development Programme in the light of this statement."
		},
		{
			"Year":"1995",
			"Question":"1(a) Methods of science and sociology"
		},
		{
			"Year":"1995",
			"Question":"1(b) Social class and social status"
		},
		{
			"Year":"1995",
			"Question":"1(c) Social fact"
		},
		{
			"Year":"1995",
			"Question":"1(d) Primary group"
		},
		{
			"Year":"1995",
			"Question":"2. “Subjective perception of the objection reality prepares the context for the articulation of class antagonism.” Evaluate this statements with reference to Karl Marx’s contribution."
		},
		{
			"Year":"1995",
			"Question":"3. Bring out the strength and the weakness of Robert Merton’s advancement over the classical functionalism."
		},
		{
			"Year":"1995",
			"Question":"4. Critically examine the role of formal and informal structures of bureaucracy in economic and social reconstruction of the developing societies."
		},
		{
			"Year":"1995",
			"Question":"5(a) Middle-range theories"
		},
		{
			"Year":"1995",
			"Question":"5(b) Role of culture"
		},
		{
			"Year":"1995",
			"Question":"5(c) Social disorganization"
		},
		{
			"Year":"1995",
			"Question":"5(d) Social consequences of economic development"
		},
		{
			"Year":"1995",
			"Question":"6. What has been the impact of industrialization on family and kinship organization? Illustrate the significance of kinship organization in the industrial societies."
		},
		{
			"Year":"1995",
			"Question":"7. Elaborate the meaning of the term ‘equality of educational opportunity’. Discuss education as a medium of cultural reproduction and social transformation."
		},
		{
			"Year":"1995",
			"Question":"8. Explain the classical concept of social change and critically examine the contribution of the linear theories of social change."
		},
		{
			"Year":"1995",
			"Question":"1(a) Equality and social justice"
		},
		{
			"Year":"1995",
			"Question":"1(b) Agrarian social structure"
		},
		{
			"Year":"1995",
			"Question":"1(c) Industrialization and occupational diversification"
		},
		{
			"Year":"1995",
			"Question":"1(d) Social basis of trade unions"
		},
		{
			"Year":"1995",
			"Question":"2. Explain the significance of empirical approach to the study of Indian society. How does the use of historical approach enrich empirical orientation?"
		},
		{
			"Year":"1995",
			"Question":"3. Discuss the main problems of national integration in India and delineate the role of education in tackling these problems."
		},
		{
			"Year":"1995",
			"Question":"4. “Nuclear families grow into joint families and then break into nuclear families. The change from nuclear to joint and from joint to nuclear families is fairly frequent in India. “Explain the changes in the structure and function of joint family in this context."
		},
		{
			"Year":"1995",
			"Question":"5(a) Cultural and structural aspect of caste"
		},
		{
			"Year":"1995",
			"Question":"5(b) Faction in rural life"
		},
		{
			"Year":"1995",
			"Question":"5(c) Tribal integration"
		},
		{
			"Year":"1995",
			"Question":"5(d) Sanskritization"
		},
		{
			"Year":"1995",
			"Question":"6. How far did the Community Development Projects help in realizing the goals of planned change? Examine critically."
		},
		{
			"Year":"1995",
			"Question":"7. It is often alleged that the social situation in India is not conducive to the efficient functioning of a democratic polity. Comment."
		},
		{
			"Year":"1995",
			"Question":"8. Discuss the salient features of urbanization in India. What steps would you suggest to tackle the negative aspects of urbanization?"
		},
		{
			"Year":"1996",
			"Question":"1(a) Value-free sociology"
		},
		{
			"Year":"1996",
			"Question":"1(b) Role-Conflict and its resolution"
		},
		{
			"Year":"1996",
			"Question":"1(c) Mode of production"
		},
		{
			"Year":"1996",
			"Question":"1(d) The idea of functional indispensability"
		},
		{
			"Year":"1996",
			"Question":"2. Discuss Talcott Parsons’ contribution to the analysis of social change."
		},
		{
			"Year":"1996",
			"Question":"3. “Not all facts about human behaviour are necessarily social facts.” State the meaning of ‘social facts’ and the methods of studying them with reference to this statement."
		},
		{
			"Year":"1996",
			"Question":"4. Explain the origin and characteristics of bureaucracy according to Max Weber. Illustrate the structural sources of dysfunctions of bureaucracy."
		},
		{
			"Year":"1996",
			"Question":"5(a) Impacts of change in sex-role on family"
		},
		{
			"Year":"1996",
			"Question":"5(b) Types of exchange"
		},
		{
			"Year":"1996",
			"Question":"5(c) Education and social inequalities"
		},
		{
			"Year":"1996",
			"Question":"5(d) Reformative social movements"
		},
		{
			"Year":"1996",
			"Question":"6. Compare the role of custom as on agency of social control in primitive and modern industrial societies."
		},
		{
			"Year":"1996",
			"Question":"7. Discuss the meaning and role of voluntary organizations in the efforts of transformation of society through state-action."
		},
		{
			"Year":"1996",
			"Question":"8. Critically examine the impact traditional social structures on the development and functioning of a democratic polity."
		},
		{
			"Year":"1996",
			"Question":"1(a) Varna ashrama dharma"
		},
		{
			"Year":"1996",
			"Question":"1(b) Avenues of caste mobility in traditional Indian society"
		},
		{
			"Year":"1996",
			"Question":"1(c) Role of pressure groups in Indian politics"
		},
		{
			"Year":"1996",
			"Question":"1(d) Social consequences of market economy"
		},
		{
			"Year":"1996",
			"Question":"2. “Tradition and modernity co-exist in contexporary Indian society.” Discuss the factors responsible for this continuity and change."
		},
		{
			"Year":"1996",
			"Question":"3. Describe the factors responsible for increasing economic inequalities in India and discuss their social consequences."
		},
		{
			"Year":"1996",
			"Question":"4. How far has education of women led to an improvement in their social status in the modern Indian society? Which other factors are related to the status of women in India?"
		},
		{
			"Year":"1996",
			"Question":"5(a) Urban neighbourhoods"
		},
		{
			"Year":"1996",
			"Question":"5(b) Pattern of secularism in India"
		},
		{
			"Year":"1996",
			"Question":"5(c) Problem of education among ‘Backward classes’"
		},
		{
			"Year":"1996",
			"Question":"5(d) Indicators of modernization in Indian society"
		},
		{
			"Year":"1996",
			"Question":"6. Describe the socio-cultural consequences of tribals contacts with the non-tribals. What measures would you suggest to bring the tribals in the national mainstream?"
		},
		{
			"Year":"1996",
			"Question":"7. Describe the traditional power structure in rural India. Discuss the factors that have contributed to its changes pattern in recent years."
		},
		{
			"Year":"1996",
			"Question":"8. Do you think that caste and democracy are compatible with each other? Discuss with reference to some studies conducted on the issue in India."
		},
		{
			"Year":"1997",
			"Question":"1(a) Sociology as an interpretative discipline"
		},
		{
			"Year":"1997",
			"Question":"1(b) A good hypothesis"
		},
		{
			"Year":"1997",
			"Question":"1(c) Anomie"
		},
		{
			"Year":"1997",
			"Question":"1(d) Types of mobility"
		},
		{
			"Year":"1997",
			"Question":"2. Is it possible to study social phenomenon scientifically? Give a critical answer."
		},
		{
			"Year":"1997",
			"Question":"3. Critically examine Max Weber’s theory of social action and its limitations."
		},
		{
			"Year":"1997",
			"Question":"4. Discuss Talcott Parsons contribution to the analysis of social system. "
		},
		{
			"Year":"1997",
			"Question":"5(a) Fundamentals of religion"
		},
		{
			"Year":"1997",
			"Question":"5(b) Concept of social movement"
		},
		{
			"Year":"1997",
			"Question":"5(c) Role of education in social development"
		},
		{
			"Year":"1997",
			"Question":"5(d) Industrialization and social change"
		},
		{
			"Year":"1997",
			"Question":"6. “Education is an instrument of social control and social change.” Critically examine the statement."
		},
		{
			"Year":"1997",
			"Question":"7. What are the problems of universalisation of primary education? Discuss fully."
		},
		{
			"Year":"1997",
			"Question":"8. Explain the concept of social change. Critically examine the contribution of Karl Marx’s theory of social change."
		},
		{
			"Year":"1997",
			"Question":"1(a) Pluralism and national unity"
		},
		{
			"Year":"1997",
			"Question":"1(b) Industrial class structure in India"
		},
		{
			"Year":"1997",
			"Question":"1(c) Impact of Islam on Indian society"
		},
		{
			"Year":"1997",
			"Question":"1(d) Social consequences of occupational diversification"
		},
		{
			"Year":"1997",
			"Question":"2. Outline the social factors related to generation gap. How has the generation gap led to the problems of youth unrest?"
		},
		{
			"Year":"1997",
			"Question":"3. Describe the socio-cultural background of the political elites of contemporary India. What has been the influence of their background on their political orientations?"
		},
		{
			"Year":"1997",
			"Question":"4. Caste is becoming weaker and stronger at the same time in present day India. Discuss the factors responsible for continuity and change."
		},
		{
			"Year":"1997",
			"Question":"5(a) Social profile of slums"
		},
		{
			"Year":"1997",
			"Question":"5(b) Social dimensions of drug addiction"
		},
		{
			"Year":"1997",
			"Question":"5(c) Issues of tribal identity"
		},
		{
			"Year":"1997",
			"Question":"5(d) Communal tensions in India"
		},
		{
			"Year":"1997",
			"Question":"6. Describe the role played by education in social mobility. Do you think that education has been the most important factor in accelerating social mobility in modern Indian society? Give arguments in favour of your answer."
		},
		{
			"Year":"1997",
			"Question":"7. What changes have taken place in the tribal social stratification pattern in recent times? Describe the factors responsible for these changes."
		},
		{
			"Year":"1997",
			"Question":"8. Describe the factors related to social movements. In the light of these factors explain the emergence of peasant movement in India"
		},
		{
			"Year":"1998",
			"Question":"1(a) Value neutrality in social science"
		},
		{
			"Year":"1998",
			"Question":"1(b) Reliability of a sample"
		},
		{
			"Year":"1998",
			"Question":"1(c) Pattern variables"
		},
		{
			"Year":"1998",
			"Question":"1(d) Caste as a class"
		},
		{
			"Year":"1998",
			"Question":"2. “It is not the consciousness of men that determines their being, but on the contrary it is their social being that determines their consciousness.” Examine Karl Marx’s notion of mode of production in the light of this statement."
		},
		{
			"Year":"1998",
			"Question":"3. Analyse critically the functional theory of social stratification."
		},
		{
			"Year":"1998",
			"Question":"4. ‘Socialisation is a process by which all of us acquire the culture that we transmit to the next generation.’ Elaborate the statement and discuss its various stages."
		},
		{
			"Year":"1998",
			"Question":"5(a) Features of pre-industrial economic system"
		},
		{
			"Year":"1998",
			"Question":"5(b) Education and culture"
		},
		{
			"Year":"1998",
			"Question":"5(c) Vertical and horizontal mobility"
		},
		{
			"Year":"1998",
			"Question":"5(d) Religious pluralism"
		},
		{
			"Year":"1998",
			"Question":"6. Examine social consequences of changes in technology. Illustrate your answer with examples form new productive processes and equipment."
		},
		{
			"Year":"1998",
			"Question":"7. Explain the concept of power. Distinguish between power and authority."
		},
		{
			"Year":"1998",
			"Question":"8. What are the structural conditions under which movements emerge? Discuss with reference to any one theory of genesis of social movements."
		},
		{
			"Year":"1998",
			"Question":"1(a) Response of Indian society to the early impact of West"
		},
		{
			"Year":"1998",
			"Question":"1(b) Implications of emergence of regional political parties"
		},
		{
			"Year":"1998",
			"Question":"1(c) Modes and contents of expression of Dalit consciousness"
		},
		{
			"Year":"1998",
			"Question":"1(d) Problem of adult illiteracy in India"
		},
		{
			"Year":"1998",
			"Question":"2. Assess the impact of market economy on the traditional rural economic structure."
		},
		{
			"Year":"1998",
			"Question":"3. Examine the causes and consequences of growing size of urban middle class."
		},
		{
			"Year":"1998",
			"Question":"4. Analyse critically the Government of India’s tribal policy."
		},
		{
			"Year":"1998",
			"Question":"5(a) Revivalist social movements in India."
		},
		{
			"Year":"1998",
			"Question":"5(b) Increasing economic disparities between rural and urban populations"
		},
		{
			"Year":"1998",
			"Question":"5(c) Role of caste associations"
		},
		{
			"Year":"1998",
			"Question":"5(d) Social consequences of unplanned urban growth"
		},
		{
			"Year":"1998",
			"Question":"6. Discuss the constitutional safeguards for religious minority groups and account for increasing religious fundamentalism in India."
		},
		{
			"Year":"1998",
			"Question":"7. “Political and economic empowerment of women is necessary but not a sufficient condition for improving social status of women in India.” Comment."
		},
		{
			"Year":"1998",
			"Question":"8. Examine the socio-economic consequences of the changing age-structure of India’s population."
		},
		{
			"Year":"1999",
			"Question":"1(a) Sociology as a by-product of Industrial Revolution"
		},
		{
			"Year":"1999",
			"Question":"1(b) Role conflict as a source of deviation"
		},
		{
			"Year":"1999",
			"Question":"1(c) Limitations of questionnaire as a technique of data collection."
		},
		{
			"Year":"1999",
			"Question":"1(d) Gemeinschaft and Gesselschaft types of communities."
		},
		{
			"Year":"1999",
			"Question":"2. How would you distinguish between the stratified and the unstratified social positions? What explanation would you profer for the universal existence of the social stratification in human society?"
		},
		{
			"Year":"1999",
			"Question":"3. Elaborate on the social necessity of religion. Discuss the relationship between religion and science."
		},
		{
			"Year":"1999",
			"Question":"4. Social control is more a matter of conviction than that of coercion. Comment. Discuss the role of ideology in social control."
		},
		{
			"Year":"1999",
			"Question":"5(a) Division of labour and differentiation of social structure"
		},
		{
			"Year":"1999",
			"Question":"5(b) Impact of the democratic political system on the traditional social structure"
		},
		{
			"Year":"1999",
			"Question":"5(c) Social structure and Anomie"
		},
		{
			"Year":"1999",
			"Question":"5(d) Functional problems of the social system"
		},
		{
			"Year":"1999",
			"Question":"6. Discuss the nature and characteristics of social mobility. Can the nature and the rate of social mobility be treated as an index of economic development? Comment."
		},
		{
			"Year":"1999",
			"Question":"7. Bring out the commonality between a social movement and a revolution. Would you agree with the view that each revolution is preceded by a social movement? Give reasons."
		},
		{
			"Year":"1999",
			"Question":"8. Elaborate on the concept of structural change. Discuss the endogenic factors of structural change in a society, with suitable examples."
		},
		{
			"Year":"1999",
			"Question":"1(a) Social Justice"
		},
		{
			"Year":"1999",
			"Question":"1(b) National Unity"
		},
		{
			"Year":"1999",
			"Question":"1(c) Total Literacy Campaign (TLC)"
		},
		{
			"Year":"1999",
			"Question":"1(d) Peasant Society"
		},
		{
			"Year":"1999",
			"Question":"2. Discuss 73rd and 74th Constitutional Amendments with reference to decentralization of power."
		},
		{
			"Year":"1999",
			"Question":"3. What is meant by privatization and how could it effect economic reforms in India?"
		},
		{
			"Year":"1999",
			"Question":"4. What do you mean by ‘Green Revolution’ and what are its socio-economic consequences? Discuss."
		},
		{
			"Year":"1999",
			"Question":"5(a) Secularism"
		},
		{
			"Year":"1999",
			"Question":"5(b) Sanskritization"
		},
		{
			"Year":"1999",
			"Question":"5(c) Naxalbari Movement"
		},
		{
			"Year":"1999",
			"Question":"5(d) Dowry as a social problem"
		},
		{
			"Year":"1999",
			"Question":"6. Define religious minority. Discuss the problems of religious minorities in India."
		},
		{
			"Year":"1999",
			"Question":"7. Slums are scars on the social fabric. How can these scars be removed?"
		},
		{
			"Year":"1999",
			"Question":"8. How is modernization an agent of change? Discuss its positive and negative aspects."
		},
		{
			"Year":"2000",
			"Question":"1(a) Sociology and social anthropology"
		},
		{
			"Year":"2000",
			"Question":"1(b) Problem of objectivity in social research"
		},
		{
			"Year":"2000",
			"Question":"1(c) Alienation"
		},
		{
			"Year":"2000",
			"Question":"1(d) Role conflict"
		},
		{
			"Year":"2000",
			"Question":"2. Emile Durkheim had argued that the function of division of labour in society is that of the promotion of social solidarity. Elaborate the statement and analyse the distinction between two forms of solidarity discussed by him."
		},
		{
			"Year":"2000",
			"Question":"3. How does social structure produce a strain toward anomie and deviant behaviour? Examine it with reference to Robert K. Merton’s contribution to this field of study."
		},
		{
			"Year":"2000",
			"Question":"4. Discuss the factors responsible for changing structure of family in modern societies."
		},
		{
			"Year":"2000",
			"Question":"5(a) Inter- generational mobility"
		},
		{
			"Year":"2000",
			"Question":"5(b) Social determinants of economic development"
		},
		{
			"Year":"2000",
			"Question":"5(c) ‘Relative Deprivation’"
		},
		{
			"Year":"2000",
			"Question":"5(d) Role of pressure groups in democracy"
		},
		{
			"Year":"2000",
			"Question":"6. Pitirim A. Sorokin sees the course of history as a continuous but irregular fluctuation between two basically different kinds of culture. While explaining this stand of Sorokin, analyse whether it appropriate to characterise such a notion of change as a cyclical theory of social change."
		},
		{
			"Year":"2000",
			"Question":"7. Is ideology an essential component of a social movement? Illustrate your answer with suitable examples from some contemporary social movements."
		},
		{
			"Year":"2000",
			"Question":"8. Critically examine functional and dysfunctional aspects of religion."
		},
		{
			"Year":"2000",
			"Question":"1(a) Impact of Buddhism on Indian society"
		},
		{
			"Year":"2000",
			"Question":"1(b) Cast among Indian Christians"
		},
		{
			"Year":"2000",
			"Question":"1(c) Consequences of globalization for India"
		},
		{
			"Year":"2000",
			"Question":"1(d) Educational inequalities in India"
		},
		{
			"Year":"2000",
			"Question":"2. Which means of social mobility were available in the traditional caste system?Describe the form of social mobility in contemporary Indian society."
		},
		{
			"Year":"2000",
			"Question":"3. Critically examine the protective discrimination policy for the disadvantaged groups in India. Would you suggest any change in this policy?"
		},
		{
			"Year":"2000",
			"Question":"4. What have been the functions of democracy in India? Has democracy been successful in eliminating some of the traditional social inequalities?"
		},
		{
			"Year":"2000",
			"Question":"5(a) Religious fundamentalism"
		},
		{
			"Year":"2000",
			"Question":"5(b) Socio-cultural factors related to declining proportion of famales in sex-ratio"
		},
		{
			"Year":"2000",
			"Question":"5(c) Self-respect movement"
		},
		{
			"Year":"2000",
			"Question":"5(d) Social correlated of prostitution"
		},
		{
			"Year":"2000",
			"Question":"6. Critically examine various tribal policies. Which tribal policy would you advocate for tribal development in India and why?"
		},
		{
			"Year":"2000",
			"Question":"7. Do you agree with the view that slums are areas of darkness and despair? Give reasons in support of your answer."
		},
		{
			"Year":"2000",
			"Question":"8. Critically evaluate the child welfare programmes in India. Have they benefited all sections of children in India?"
		},
		{
			"Year":"2001",
			"Question":"1(a) Sociology as an interpretative discipline"
		},
		{
			"Year":"2001",
			"Question":"1(b) Manifest and latent functions"
		},
		{
			"Year":"2001",
			"Question":"1(c) Sources of legitimacy of power"
		},
		{
			"Year":"2001",
			"Question":"1(d) Emerging pattern of sex-roles in modern society."
		},
		{
			"Year":"2001",
			"Question":"2. Explain Karl Marx’s conception of class-antagonism. How have the functionalists reacted to his views?"
		},
		{
			"Year":"2001",
			"Question":"3. What is the focus of sociological analysis in the contributions of Emile Durkheim? Give your answer with the help of any one of his contributions."
		},
		{
			"Year":"2001",
			"Question":"4. State the meaning and characteristics of an ideal type What, according to Max Weber, is the use and significance of the ideal type in social science research?"
		},
		{
			"Year":"2001",
			"Question":"5(a) Types of Exchange"
		},
		{
			"Year":"2001",
			"Question":"5(b) Incest taboo"
		},
		{
			"Year":"2001",
			"Question":"5(c) Informal structure of Bureaucracy"
		},
		{
			"Year":"2001",
			"Question":"5(d) Religion and Science."
		},
		{
			"Year":"2001",
			"Question":"6. Distinguish between the processes of formal education and socialization. Examine effectivity in-formal education as an instrument of social change."
		},
		{
			"Year":"2001",
			"Question":"7. What social conditions causes a social movement? Explain, with illustrations, the career of a social movement."
		},
		{
			"Year":"2001",
			"Question":"8. Define social policy. Evaluate the performance of social policy in modernization ofdeveloping societies."
		},
		{
			"Year":"2001",
			"Question":"1(a) Caste and Indian polity"
		},
		{
			"Year":"2001",
			"Question":"1(b) Poverty alleviation programmes"
		},
		{
			"Year":"2001",
			"Question":"1(c) Impact of West on Indian society"
		},
		{
			"Year":"2001",
			"Question":"1(d) Agrarian class structure in India."
		},
		{
			"Year":"2001",
			"Question":"2. Examine the role of Arya Samaj and Ramkrishna Mission on reform movements in India."
		},
		{
			"Year":"2001",
			"Question":"3. What factors are responsible for the instability of the Indian family? Will the family survive the present crisis in modern society?"
		},
		{
			"Year":"2001",
			"Question":"4. What is meant by democratic decentralization? Assess the working of panchayati Raj in India."
		},
		{
			"Year":"2001",
			"Question":"5(a) Education and social mobility"
		},
		{
			"Year":"2001",
			"Question":"5(b) Satya Sadhak Samaj"
		},
		{
			"Year":"2001",
			"Question":"5(c) Privatization and globalization"
		},
		{
			"Year":"2001",
			"Question":"5(d) Social consequences of alcoholism and drug addiction"
		},
		{
			"Year":"2001",
			"Question":"6. Critically examine the existing welfare programmes for women in India. Have they benefitted all sections of women in India?"
		},
		{
			"Year":"2001",
			"Question":"7. Explain the concept of secular state and discuss the problems of India as a secular state."
		},
		{
			"Year":"2001",
			"Question":"8. Elaborate the concept of political elite. Explain how social struetural origins of political elites influence their political orientations."
		},
		{
			"Year":"2002",
			"Question":"1(a) Sociology as a Science"
		},
		{
			"Year":"2002",
			"Question":"1(b) Theory and Fact"
		},
		{
			"Year":"2002",
			"Question":"1(c) Social mobility and social change"
		},
		{
			"Year":"2002",
			"Question":"1(d) Social movement and social change"
		},
		{
			"Year":"2002",
			"Question":"2. Examine the nature of social facts as understood by Durkheim."
		},
		{
			"Year":"2002",
			"Question":"3. Critically examine Weber’s theory of Protestant Ethic and the Spirit of Capitalism."
		},
		{
			"Year":"2002",
			"Question":"4. Distinguish between Sex and Gender. Discuss the gender issues with suitable examples."
		},
		{
			"Year":"2002",
			"Question":"5(a) Industrialisation and social change"
		},
		{
			"Year":"2002",
			"Question":"5(b) Community power"
		},
		{
			"Year":"2002",
			"Question":"5(c) The sacred and the profane"
		},
		{
			"Year":"2002",
			"Question":"5(d) Ethos of science"
		},
		{
			"Year":"2002",
			"Question":"6. What are the uses of Bogardus’ social distance scale and of Likert scale? Discuss."
		},
		{
			"Year":"2002",
			"Question":"7. In what way is the process of socialisation helpful in the development of personality? Explain with suitable examples."
		},
		{
			"Year":"2002",
			"Question":"8. Explain Melvin Tumin’s critique related to the theory of social stratification."
		},
		{
			"Year":"2002",
			"Question":"1(a) Emergence of Dalit Consciousness"
		},
		{
			"Year":"2002",
			"Question":"1(b) Integration of Tribes in Hindu Culture"
		},
		{
			"Year":"2002",
			"Question":"1(c) Characteristics of Neo-Rich agrarian class."
		},
		{
			"Year":"2002",
			"Question":"1(d) Reservation and Panchayat Raj institutions."
		},
		{
			"Year":"2002",
			"Question":"2. Discuss the metaphysical and ethical basis of Hindu social organisation."
		},
		{
			"Year":"2002",
			"Question":"3. Discuss the Louis Dumont’s concept of purity and pollution. How far these concepts are relevant in explaining the Hindu caste system?"
		},
		{
			"Year":"2002",
			"Question":"4. Examine the ways in which Indian society can be strengthened as multi-cultural society. Is the dominance of single culture is a hinderance to multiculturalism in India?"
		},
		{
			"Year":"2002",
			"Question":"5(a) Inequality among Brahmins."
		},
		{
			"Year":"2002",
			"Question":"5(b) Problems of Hindu minority in Kashmir."
		},
		{
			"Year":"2002",
			"Question":"5(c) Nature of atrocities on married women."
		},
		{
			"Year":"2002",
			"Question":"5(d) Problems of child labour in India."
		},
		{
			"Year":"2002",
			"Question":"6. Is Secularism a weak ideology? Critically analyse the reasons for anti-secular trends in India."
		},
		{
			"Year":"2002",
			"Question":"7. Examine the impact of mass media on Indian society. Whether western consumerism and materialistic culture, creeping in through mass media, are adversely affecting the traditional Indian culture?"
		},
		{
			"Year":"2002",
			"Question":"8. Analyse the ideological and strategical features of Naxalbari movement."
		},
		{
			"Year":"2003",
			"Question":"1(a) Primary and Reference Groups"
		},
		{
			"Year":"2003",
			"Question":"1(b) Utility of Reliability and Validity in Social Research"
		},
		{
			"Year":"2003",
			"Question":"1(c) Social System and the Pattern Variables"
		},
		{
			"Year":"2003",
			"Question":"1(d) Education and social Development"
		},
		{
			"Year":"2003",
			"Question":"2. Highlight the problem of objectivity and value-neutrality in Social Research. Elaborate, with suitable examples, the limitations associated with the tools of measurements in Social Science Researches."
		},
		{
			"Year":"2003",
			"Question":"3. Discuss the meanings and significance of culture in Human Society. Critically bring out the role of Culture in the development of personality"
		},
		{
			"Year":"2003",
			"Question":"4. Critically examine Max Weber’s theory of the ‘Protestant ethics and the spirit of the Capitalism’. Could it be the otherwise possibility that the tenets of the capitalism must also have effected the emergence of the Protestant ethics? Comment with suitable examples."
		},
		{
			"Year":"2003",
			"Question":"5(a) Social impact of New Technologies in India."
		},
		{
			"Year":"2003",
			"Question":"5(b) Class-in-itself and Class-for-itself"
		},
		{
			"Year":"2003",
			"Question":"5(c) Social determinants of Economic Development"
		},
		{
			"Year":"2003",
			"Question":"5(d) Social Structure and Political Participation."
		},
		{
			"Year":"2003",
			"Question":"6. Examine the conceptual distinction between social inequality and social stratification. How do the nature and forms of the social stratification system determine the patterns of social mobility?"
		},
		{
			"Year":"2003",
			"Question":"7. Elaborate on the concepts of Family and Lineage Discuss the relationship between Rules of descent and inheritance of property."
		},
		{
			"Year":"2003",
			"Question":"8. Critically analyse the concept of Anomie. Elaborate with suitable examples, the theoretical relationship between nature of Anomie and types of Social Deviations as have been formulated by R.K. Merton."
		},
		{
			"Year":"2003",
			"Question":"1(a) Caste among Muslims"
		},
		{
			"Year":"2003",
			"Question":"1(b) Emergence of classes among tribes"
		},
		{
			"Year":"2003",
			"Question":"1(c) Social consequences of green revolution"
		},
		{
			"Year":"2003",
			"Question":"1(d) Regionalism"
		},
		{
			"Year":"2003",
			"Question":"2. Describe the characteristics of dominant caste. Discuss its role in village politics in India."
		},
		{
			"Year":"2003",
			"Question":"3. Outline the factors responsible for unrest in agrarian communities of India. What suggestions will you give to arrest this trend?"
		},
		{
			"Year":"2003",
			"Question":"4. Discuss how occupational diversification has affected the pattern of social stratification in India"
		},
		{
			"Year":"2003",
			"Question":"5(a) Educational problems of weaker sections"
		},
		{
			"Year":"2003",
			"Question":"5(b) Socio-cultural factors influencing infant mortality rates"
		},
		{
			"Year":"2003",
			"Question":"5(c) Isolation approach in tribal policy"
		},
		{
			"Year":"2003",
			"Question":"5(d) Social dimensions of corruption"
		},
		{
			"Year":"2003",
			"Question":"6 Describe the socio-economic factors responsible of communal tensions in India. What suggestions will you give to control them? "
		},
		{
			"Year":"2003",
			"Question":"7. Differentiate between pressure groups and interest groups. Describe the role of some prominent pressure groups in contemporary Indian politics."
		},
		{
			"Year":"2003",
			"Question":"8. Describe the process of modernization in India. Discuss the factors that have impeded this process."
		},
		{
			"Year":"2004",
			"Question":"1(a) Objectivity and Value Neutrality in Social Research."
		},
		{
			"Year":"2004",
			"Question":"1(b) Bureaucracy in New Capitalist Economy"
		},
		{
			"Year":"2004",
			"Question":"1(c) Gender Roles in Changing Structure of family"
		},
		{
			"Year":"2004",
			"Question":"1(d) Class within Caste and Caste within Class."
		},
		{
			"Year":"2004",
			"Question":"2. Give a critical Review of Emile Durkheim’s Theory on Religion and Society. To what extent does it explain the contemporary scenario in Asia?"
		},
		{
			"Year":"2004",
			"Question":"3. ‘Socialisation and social control are complementary to each other in maintaining social order.’ Elucidate your answer with appropriate illustrations."
		},
		{
			"Year":"2004",
			"Question":"4. Briefly discuss the Conflict Perspective on social stratification and examine the view that social inequality in India is the function of rigid social stratification system."
		},
		{
			"Year":"2004",
			"Question":"5(a) Authority and Legitimacy"
		},
		{
			"Year":"2004",
			"Question":"5(b) Privatization of Education & Equality of Opportunity"
		},
		{
			"Year":"2004",
			"Question":"5(c) Science and Social Responsibility"
		},
		{
			"Year":"2004",
			"Question":"5(d) Ideology and Strategy of Social Movement"
		},
		{
			"Year":"2004",
			"Question":"6. Examine in detail the impact of new global economy on work organisation and family structure in India."
		},
		{
			"Year":"2004",
			"Question":"7. Examine the functional as well as dysfunctional aspects of religion in a pluralistic society taking India and the United States of America as illustrative models."
		},
		{
			"Year":"2004",
			"Question":"8. Bring out a comparative analysis of Marxian and Parsonian views of social change and examine the relevance of each view of social development in the contemporary India."
		},
		{
			"Year":"2004",
			"Question":"1(a) Caste mobilisation in North India."
		},
		{
			"Year":"2004",
			"Question":"1(b) Impact of Muslims on Indian Society."
		},
		{
			"Year":"2004",
			"Question":"1(c) Feudalism and Semi Feudalism"
		},
		{
			"Year":"2004",
			"Question":"1(d) Social Consequences of Globalisation."
		},
		{
			"Year":"2004",
			"Question":"2. Discuss the influence of socio-cultural factors on age of marriage in India."
		},
		{
			"Year":"2004",
			"Question":"3. Critically evaluate education as a tool for social justice."
		},
		{
			"Year":"2004",
			"Question":"4. “The 73rd and the 74th constitutional amendments have motivated social mobilisation in rural India.” Discuss."
		},
		{
			"Year":"2004",
			"Question":"5(a) Role of religion in civil society."
		},
		{
			"Year":"2004",
			"Question":"5(b) Migration and tribal communities."
		},
		{
			"Year":"2004",
			"Question":"5(c) Socio-cultural factors related to foeticide"
		},
		{
			"Year":"2004",
			"Question":"5(d) Strategies of rural development"
		},
		{
			"Year":"2004",
			"Question":"6. Discuss in detail impact of mass media and education on Indian society."
		},
		{
			"Year":"2004",
			"Question":"7. Discuss in detail atrocities on women and suggest annihilative measures for them."
		},
		{
			"Year":"2004",
			"Question":"8. Analyse socio-cultural consequences of corruption and suggest remedial measures for curbing it."
		},
		{
			"Year":"2005",
			"Question":"1(a) Sociology and its relationship with economics and political science"
		},
		{
			"Year":"2005",
			"Question":"1(b) Social research design"
		},
		{
			"Year":"2005",
			"Question":"1(c) Class struggle as conceived by Karl Marx"
		},
		{
			"Year":"2005",
			"Question":"1(d) Role of Family in Social Control"
		},
		{
			"Year":"2005",
			"Question":"2. Discuss Max Weber’s ideal types and the role of authority in bureaucracy."
		},
		{
			"Year":"2005",
			"Question":"3. Elucidate changing structure of family and marriage in modern society."
		},
		{
			"Year":"2005",
			"Question":"4. How is vertical and horizontal social mobility problematic in society? Suggest solutions."
		},
		{
			"Year":"2005",
			"Question":"5(a) Social determinants of economic development"
		},
		{
			"Year":"2005",
			"Question":"5(b) Power elite in society and the emergence of new elite in power structure"
		},
		{
			"Year":"2005",
			"Question":"5(c) Origins of religious beliefs and practices in pre-modern societies"
		},
		{
			"Year":"2005",
			"Question":"5(d) Social consequences of science and technology in India"
		},
		{
			"Year":"2005",
			"Question":"6. Discuss modes of political participation and voting behaviour in India."
		},
		{
			"Year":"2005",
			"Question":"7. Describe the ideological changes that have ushered in modern society due to social movements in India."
		},
		{
			"Year":"2005",
			"Question":"8. Discuss mass education as an instrument of social change and modernization."
		},
		{
			"Year":"2005",
			"Question":"1(a) Racial Theories of origin of caste"
		},
		{
			"Year":"2005",
			"Question":"1(b) Characteristics of peasant societies"
		},
		{
			"Year":"2005",
			"Question":"1(c) Generation gap"
		},
		{
			"Year":"2005",
			"Question":"1(d) Inequality in Education"
		},
		{
			"Year":"2005",
			"Question":"2. Discuss the paradoxical nature of change in contemporary Indian society. Describe the factors responsible for it."
		},
		{
			"Year":"2005",
			"Question":"3. Describe the process of emergence of the middle class in India. What role has the middle class played in national development?"
		},
		{
			"Year":"2005",
			"Question":"4. Discuss the social base of political parties in India. What has been its impact on Indian democracy?"
		},
		{
			"Year":"2005",
			"Question":"5(a) Pluralism and national unity"
		},
		{
			"Year":"2005",
			"Question":"5(b) Religious fundamentalism"
		},
		{
			"Year":"2005",
			"Question":"5(c) Self-respect Movement"
		},
		{
			"Year":"2005",
			"Question":"5(d) Obstacles to change in Indian society"
		},
		{
			"Year":"2005",
			"Question":"6. Describe the distinctive features of tribal communities in India. Discuss the factors affecting tribal identity."
		},
		{
			"Year":"2005",
			"Question":"7. Describe various aspects of urban environment in India and assess the impact of urban development programmes on it."
		},
		{
			"Year":"2005",
			"Question":"8. Describe the process of social mobility among lower castes and discuss the role of the Backward Classes Movement in strengthening this process."
		},
		{
			"Year":"2006",
			"Question":"1(a) Intellectual background for the emergence of sociology."
		},
		{
			"Year":"2006",
			"Question":"1(b) Concept of Ideal Type and its limitations."
		},
		{
			"Year":"2006",
			"Question":"1(c) Nuclear family and industrial society."
		},
		{
			"Year":"2006",
			"Question":"1(d) Vertical society mobility."
		},
		{
			"Year":"2006",
			"Question":"2. Explain Karl Marx’s theory of social change’. What are the reactions of functionalists to his views?"
		},
		{
			"Year":"2006",
			"Question":"3. What according to Emile Durkheim is the nature of relationship between the individual and society? Explain this with the help of his analysis of division of labor in society."
		},
		{
			"Year":"2006",
			"Question":"4. What are the reactions of Robert Merton to the functionalism pioneered by social anthropologists? Indicate in limitations of his idea of latent functions."
		},
		{
			"Year":"2006",
			"Question":"5(a) Caste-system as a principle of social stratification."
		},
		{
			"Year":"2006",
			"Question":"5(b) Structure of a social movement."
		},
		{
			"Year":"2006",
			"Question":"5(c) Religion and Science."
		},
		{
			"Year":"2006",
			"Question":"5(d) Human factors involved in directed social change."
		},
		{
			"Year":"2006",
			"Question":"6. “Education is one of the basic activities for the continued existence and development of a society”. Elaborate this statement."
		},
		{
			"Year":"2006",
			"Question":"7. Explain the idea of social responsibility of science. Analyse the social consequences of development of science and the social consequences of development of science and technology in the context of removal of backwardness in developing societies."
		},
		{
			"Year":"2006",
			"Question":"8. State significance of social policy in social development. Under what conditions a social policy fails to be effective in its performance?"
		},
		{
			"Year":"2006",
			"Question":"1(a) Continuity and change in indian society"
		},
		{
			"Year":"2006",
			"Question":"1(b) Backward Classes movement"
		},
		{
			"Year":"2006",
			"Question":"1(c) Social consequences of privatisation"
		},
		{
			"Year":"2006",
			"Question":"1(d) Industrialisation & family change in india, with examples"
		},
		{
			"Year":"2006",
			"Question":"2. Describe the major aspects of traditional Hindu social organisation. How far are they relevant for present day indian society?"
		},
		{
			"Year":"2006",
			"Question":"3. Discuss the social factors responsible for the emergence of Dalit consciousness in India. What have been the social consequences of this phenomenon?"
		},
		{
			"Year":"2006",
			"Question":"4. Is indian peasant society a non-modern society? Evaluate with suitable examples in support of your answer."
		},
		{
			"Year":"2006",
			"Question":"5(a) Social Factors related to declining sex- ratio"
		},
		{
			"Year":"2006",
			"Question":"5(b) Environmental Pollution in urban areas"
		},
		{
			"Year":"2006",
			"Question":"5(c) Self Respect Movement"
		},
		{
			"Year":"2006",
			"Question":"5(d) Discrimination against women"
		},
		{
			"Year":"2006",
			"Question":"6. Describe the indicators of secularism. In your opinion, it is being practised in letter and spirit in present day indian society?"
		},
		{
			"Year":"2006",
			"Question":"7. Discuss the salient features of the population policy of government of india. what modifications would you suggest to make it more effective?"
		},
		{
			"Year":"2006",
			"Question":"8. Describe the social factors re;ated with the problems of alcoholism and drug addiction. what measures would you suggest to tacle these problems?"
		},
		{
			"Year":"2007",
			"Question":"1(a) Sociology as a science of society"
		},
		{
			"Year":"2007",
			"Question":"1(b) Talcott Parsons concept of social system"
		},
		{
			"Year":"2007",
			"Question":"1(c) Social facts"
		},
		{
			"Year":"2007",
			"Question":"1(d) Robert Merton’s views on manifest and latent functions"
		},
		{
			"Year":"2007",
			"Question":"2. Explain Karl Marx’s analysis of capitalistic mode of production and class-struggle. What are the intellectual reactions to his views?"
		},
		{
			"Year":"2007",
			"Question":"3. What is the subject-matter of Sociology according to Max Weber? Which major methods did he suggest for social science research? Illustrate your answer with his sociological contributions."
		},
		{
			"Year":"2007",
			"Question":"4. Elaborate Emile Durkheim’s analysis of the elementary forms of Religious Life & role of religion in society. How does he explain existence of religion in modern industrial societies?"
		},
		{
			"Year":"2007",
			"Question":"5(a) Changing structure of family"
		},
		{
			"Year":"2007",
			"Question":"5(b) Role-conflict and its resolution"
		},
		{
			"Year":"2007",
			"Question":"5(c) Education as an instrument of social change"
		},
		{
			"Year":"2007",
			"Question":"5(d) Features of Pre-Industrial economic system"
		},
		{
			"Year":"2007",
			"Question":"6. Indicate social determinants of economic development. Discuss any one sociological perspective analysing backwardness and poverty in the developing societies."
		},
		{
			"Year":"2007",
			"Question":"7. What are the structural elements of a social movement? State how a social movement comes to its end. Illustrate your answer with example."
		},
		{
			"Year":"2007",
			"Question":"8. Explain the meaning and modes of political participation. What are the factors preventing people’s participation in politics in India?"
		},
		{
			"Year":"2007",
			"Question":"1(a) Problem of dowry"
		},
		{
			"Year":"2007",
			"Question":"1(b) Sanskritisation"
		},
		{
			"Year":"2007",
			"Question":"1(c) Programmes for urban development"
		},
		{
			"Year":"2007",
			"Question":"1(d) Problems of religious minorities"
		},
		{
			"Year":"2007",
			"Question":"2. Discuss the role of various reform movements in India."
		},
		{
			"Year":"2007",
			"Question":"3. Describe the salient features of the poverty alleviation programmes. What modifications would you suggest to make them more effective?"
		},
		{
			"Year":"2007",
			"Question":"4. Discuss the various problems of tribal communities in India and assess the impact of tribal development efforts after Independence."
		},
		{
			"Year":"2007",
			"Question":"5(a) Education and social mobility(b) Regionalism"
		},
		{
			"Year":"2007",
			"Question":"5(c) Market economy and its social consequences"
		},
		{
			"Year":"2007",
			"Question":"5(d) Agrarian Unrest"
		},
		{
			"Year":"2007",
			"Question":"6. Discuss the major problems of religious fundamentalism in contemporary India. Give suggestions to tackle these problems."
		},
		{
			"Year":"2007",
			"Question":"7. Discuss the social consequences of economic reforms like liberalization, privatization and globalization."
		},
		{
			"Year":"2007",
			"Question":"8. Discuss the impact of legislation and socio –economic changes on marriage and family institutions. Are these institutions weakening in contemporary India?"
		},
		{
			"Year":"2008",
			"Question":"1(a) Role of value in sociology enquiry"
		},
		{
			"Year":"2008",
			"Question":"1(b) Social mobility in open and closed system"
		},
		{
			"Year":"2008",
			"Question":"1(c) Social movement as an expression of protest"
		},
		{
			"Year":"2008",
			"Question":"1(d) Education as an agent of social change"
		},
		{
			"Year":"2008",
			"Question":"2. How is emergence of sociology linked with modernization of Europe?"
		},
		{
			"Year":"2008",
			"Question":"3. What is the importance of sampling in sociological studies? Distinguish between simple random sampling and stratified random sampling."
		},
		{
			"Year":"2008",
			"Question":"4. Using Max Weber’s theory, discuss what ethical and religious ideas produced capitalism in certain societies and how?"
		},
		{
			"Year":"2008",
			"Question":"5(a) Relevant of pattern variable in the society change"
		},
		{
			"Year":"2008",
			"Question":"5(b) Mead’s notion of self"
		},
		{
			"Year":"2008",
			"Question":"5(c) Importance and source of hypotheses in social research"
		},
		{
			"Year":"2008",
			"Question":"5(d) New trends in the type and forms of family in the cotemporary India"
		},
		{
			"Year":"2008",
			"Question":"6. What is Merton’s view of relationship between social structure and deviance? In what sense is a deviant also a conformist?"
		},
		{
			"Year":"2008",
			"Question":"7. In what important ways can religion be a force both for social stability and social change? Discuss."
		},
		{
			"Year":"2008",
			"Question":"8. How does hierarchy get built into the system of natural and social inequalities?"
		},
		{
			"Year":"2008",
			"Question":"1(a) Village studies in Indian Sociology"
		},
		{
			"Year":"2008",
			"Question":"1(b) Concept of Hierarchy in Louis Dumont’s writing"
		},
		{
			"Year":"2008",
			"Question":"1(c) Informal sector in the urban economy in India"
		},
		{
			"Year":"2008",
			"Question":"1(d) S N D P Movement"
		},
		{
			"Year":"2008",
			"Question":"2. How has the Marxist perspective been applied to explain social backward of Indian Nationalism."
		},
		{
			"Year":"2008",
			"Question":"3. What is Patriarchy? How have the women’s movements confronted the norm of Patriarchy?"
		},
		{
			"Year":"2008",
			"Question":"4. How do you differentiate between social change and modernization? Explain with examples from Indian Society?"
		},
		{
			"Year":"2008",
			"Question":"5(a) Disparities in education"
		},
		{
			"Year":"2008",
			"Question":"5(b) Pressure Groups"
		},
		{
			"Year":"2008",
			"Question":"5(c) Religious revivalism"
		},
		{
			"Year":"2008",
			"Question":"5(d) Reproductive Health"
		},
		{
			"Year":"2008",
			"Question":"6. What is the impact of Globalization on the structure and mobilization of the working class in India"
		},
		{
			"Year":"2008",
			"Question":"7. What factors accounts for resurgence of ethnic identity movement in India? What according to you is the proper strategy of integration of ethnic groups in mainstream?"
		},
		{
			"Year":"2008",
			"Question":"8. How do you define development? What are your suggestions to resolve the issues of displacement and environment related to development?"
		},
		{
			"Year":"2009",
			"Question":"1a) Problems of objectivity in sociological research."
		},
		{
			"Year":"2009",
			"Question":"1b) Subject-matter of Sociology, according to Emile Durkheim."
		},
		{
			"Year":"2009",
			"Question":"1c) Comparison between Sociology and Economics"
		},
		{
			"Year":"2009",
			"Question":"1d) Talcott Parson’s idea of ‘ moving equilibrium’"
		},
		{
			"Year":"2009",
			"Question":"2. a). Distinguish between probability and non probability sampling methods. How many types of sampling design are there? 30"
		},
		{
			"Year":"2009",
			"Question":"2b). Comment on the responses of the functionalist school to Karl’s Marx’s views on social change. 30"
		},
		{
			"Year":"2009",
			"Question":"3. a). Comment on the reasons why neo-idealists and symbolic integrationists are critical of ‘ positivism’ in Sociology. 30"
		},
		{
			"Year":"2009",
			"Question":"3b). What are the reasons for calling Kingsley Davis and Wilbert Moore’s theory of social stratification a functional theory ? 30"
		},
		{
			"Year":"2009",
			"Question":"4. To Robert Merton , deviant behavior is a result of anamic . Analysis his sociological theory of deviant behavior , with a special reference to his formulation of types of deviance. 60"
		},
		{
			"Year":"2009",
			"Question":"5. Write short notes on any three of the following (each note should not exceed 200 words ) 20×3=60"
		},
		{
			"Year":"2009",
			"Question":"5a) C. W. Mills’ Power Elite"
		},
		{
			"Year":"2009",
			"Question":"5b) Industrialization and Changes in the Family’s Functionsc) Secularization of societies in the modern world."
		},
		{
			"Year":"2009",
			"Question":"5d) Structure of social movement."
		},
		{
			"Year":"2009",
			"Question":"6. a). Comments on the critics charge that Immanuel Wallerstein’s dependency theory is simplistic and wrong.30"
		},
		{
			"Year":"2009",
			"Question":"6b). What , according to Max Weber , is the role of “ Particular religion ideas” in the emergence of modern capitalism ? 30"
		},
		{
			"Year":"2009",
			"Question":"7. “Science without religion is lame. Religion without science is blind” Comment on this statement critically in the light of emerging sociological context in Europe, USA and India. 60"
		},
		{
			"Year":"2009",
			"Question":"8. Discuss the emerging forms of marriage and family with examples from the West and The East . Can there be family without marriage ? Examine. 60"
		},
		{
			"Year":"2009",
			"Question":"1a) Ideological perspective of G.S. Ghurye"
		},
		{
			"Year":"2009",
			"Question":"1b) Emergence of middle class in India"
		},
		{
			"Year":"2009",
			"Question":"1c) Dynamics of Dalit Movements"
		},
		{
			"Year":"2009",
			"Question":"1d) Colonial hangover and its social impact"
		},
		{
			"Year":"2009",
			"Question":"2. a). What has been the impact of globalization on the cultural aspect(s) of the family ? 30"
		},
		{
			"Year":"2009",
			"Question":"2b). Comment on the changes in the household dimensions of family under modern economic reforms.30"
		},
		{
			"Year":"2009",
			"Question":"3. What are the main principles of the structural functional perspective ? Comment on the suitability of applying this perspective to the study of Indian Society. 60"
		},
		{
			"Year":"2009",
			"Question":"4a). Changes that the agrarian social structure in India is under going."
		},
		{
			"Year":"2009",
			"Question":"4b). Can religion form a sufficient basis of forming cultural identity in India ?"
		},
		{
			"Year":"2009",
			"Question":"5a) Law and social change"
		},
		{
			"Year":"2009",
			"Question":"5b) New rural elite and leadership"
		},
		{
			"Year":"2009",
			"Question":"5c) Fertility and population growth"
		},
		{
			"Year":"2009",
			"Question":"5d) Possibilities of slum reform"
		},
		{
			"Year":"2009",
			"Question":"6a). Comment on the influence of social and cultural factors on family planning in India."
		},
		{
			"Year":"2009",
			"Question":"6b). Evaluate the success of Indian peasant movements in achieving their goals."
		},
		{
			"Year":"2009",
			"Question":"7. a). In the Context of the Caste System , Critically examine Louis Dumont’s concept of purity and pollution. 30"
		},
		{
			"Year":"2009",
			"Question":"7b). Comment on the sociological impact of globalization on people working in the informal sector. 30"
		},
		{
			"Year":"2009",
			"Question":"8. Do you think that poverty, deprivation and inequalities are the major challenges in the process of social transformations? What are your suggestions to address and resolve these Problems? 60"
		},
		{
			"Year":"2010",
			"Question":"1a. content analysis"
		},
		{
			"Year":"2010",
			"Question":"1b. nomothetic & ideographic methods"
		},
		{
			"Year":"2010",
			"Question":"1c. serendipity"
		},
		{
			"Year":"2010",
			"Question":"1d. cybernetic hierarchical of control"
		},
		{
			"Year":"2010",
			"Question":"1e. ethnicity & development"
		},
		{
			"Year":"2010",
			"Question":"2.a. sociology without history is rootless & history without sociology is fruitless.Elaborate. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"2b. examine the social dimensions of religious revivalism & fundamentalism in the context of globalization. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"3.a. work in capitalism is reduced to mere labor in which the individual doesn’t develop freely his physical & mental energy but mortifies his body & ruins his mind. Critically evaluate the assertion. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"3b. compare Karl Marx with emile Durham with reference to the framework of division of labor. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"4.a. critically analyze the contributions of g.h. mead to ‘symbolic interactionism’. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"4b. examine how open & closed systems of stratification are undergoing transformation in the emergence of new hierarchical social orders in societies. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"5. write short notes on any 4 of the following , keeping sociological perspectives in view in about 200 words each. 15×4 = 60"
		},
		{
			"Year":"2010",
			"Question":"5a. feminization of labor in informal sector"
		},
		{
			"Year":"2010",
			"Question":"5b. identity politics"
		},
		{
			"Year":"2010",
			"Question":"5c. positive religion"
		},
		{
			"Year":"2010",
			"Question":"5d. kinship & social capital"
		},
		{
			"Year":"2010",
			"Question":"5e. human relation school of thought by Elton mayo as a social organization of work process in industry"
		},
		{
			"Year":"2010",
			"Question":"6.a. there has been the substantial decline in labor class & increase in labor force in nonmanual jobs with the advent of new technological revolution . critically examine. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"6b. discuss between people being socially excluded & people excluding themselves socially in societies. 15 mrks"
		},
		{
			"Year":"2010",
			"Question":"6c. science has empirical means to logical ends & religion has non-empirical means to logical ends. Comment. 15 mrks"
		},
		{
			"Year":"2010",
			"Question":"7.a. list the source of power & explain the various indicators based on which power can be measured. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"7b. analyze social impact of market economy on traditional societies. 15 mrks"
		},
		{
			"Year":"2010",
			"Question":"7c. examine the social dimensions of displacement induced by development. 15 mrks"
		},
		{
			"Year":"2010",
			"Question":"8.a. evaluate how civil society & democracy mutually reinforce each other. 30 mrks"
		},
		{
			"Year":"2010",
			"Question":"8b. examine karl marx’s views on ‘class-in-itself’ & ‘class-for-itself’ with reference to proletarians. 30 mrks."
		},
		{
			"Year":"2010",
			"Question":"1a. a.r. desai’s characterization of leadership of Indian freedom movement"
		},
		{
			"Year":"2010",
			"Question":"1b. women in IT sector"
		},
		{
			"Year":"2010",
			"Question":"1c. the parsi community & its contribution to Indian society"
		},
		{
			"Year":"2010",
			"Question":"2a. the heterogenic features that influenced Indian tradition, according to yogendra singh"
		},
		{
			"Year":"2010",
			"Question":"2b. linkage between patriarchy & honor killings"
		},
		{
			"Year":"2010",
			"Question":"2c. Dumont’s concept of homohierarchies."
		},
		{
			"Year":"2010",
			"Question":"3. a. with reference to their understanding of the Indian village, compare the perspective of m.n.srinivas & s.c. dube 30 mks"
		},
		{
			"Year":"2010",
			"Question":"3b. critically assess the forms in which untouchability continues to be practiced . 30 mks"
		},
		{
			"Year":"2010",
			"Question":"4.a. discuss the inter-relationships between caste, class & power . 30 mks"
		},
		{
			"Year":"2010",
			"Question":"4b. how far is structural functional perspective helpful inj understanding changes in contemporary Indian society?"
		},
		{
			"Year":"2010",
			"Question":"5a. factors responsible for increasing demands for the formation of separate states"
		},
		{
			"Year":"2010",
			"Question":"5b. social security measures for the elderly"
		},
		{
			"Year":"2010",
			"Question":"5c. ethnic movements"
		},
		{
			"Year":"2010",
			"Question":"6.a. evaluate the policy of SEZ & nature of social response to it. 30 mks"
		},
		{
			"Year":"2010",
			"Question":"6b. from sociological perspective, examine the effects of the BPO industry on the youth. 30 mks"
		},
		{
			"Year":"2010",
			"Question":"7.a. identify the reasons for the resilience of democratic system in India. 30 mks"
		},
		{
			"Year":"2010",
			"Question":"7b. assess the contribution of contemporary women’s movements in women’s empowerment. 30 mks"
		},
		{
			"Year":"2010",
			"Question":"8.a. discuss the social-cultural factors for the declining sex-ratio in some states of India. 30 mks"
		},
		{
			"Year":"2010",
			"Question":"8b. highlight the important dimensions of inter-caste conflict in India. 30 mks"
		},
		{
			"Year":"2011",
			"Question":"1(a) Emergence of Sociology is an outcome of modernity and social change in Europe"
		},
		{
			"Year":"2011",
			"Question":"1(b) Fact and Value"
		},
		{
			"Year":"2011",
			"Question":"1(c) Reliability and Validity"
		},
		{
			"Year":"2011",
			"Question":"1(d) The Protestant Ethic and the Spirit of Capitalism"
		},
		{
			"Year":"2011",
			"Question":"1(e) The problem of gender"
		},
		{
			"Year":"2011",
			"Question":"2. (a) What can Sociology show us about our actions? Discuss the practical significance of Sociology. 30"
		},
		{
			"Year":"2011",
			"Question":"2(b) What is Class? Do you think that Weber’s contribution to social stratification is different from that of Marx? 30"
		},
		{
			"Year":"2011",
			"Question":"3. (a) What is subjective method in social research ? Examine Focus group Discussion (FGD) as a technique for data collection, with suitable examples. 30"
		},
		{
			"Year":"2011",
			"Question":"3(b) Define Ideal Type and explain Weber’s concept of ‘Verstehen’ for understanding social phenomena. 30"
		},
		{
			"Year":"2011",
			"Question":"4. (a) Give conceptual meaning of social system. What is cognitive consonance between ‘pattern’ variables’ and ‘paradigm’? 30"
		},
		{
			"Year":"2011",
			"Question":"4(b) What do you mean by social mobility? Discuss the major sources and causes of mobility. 30"
		},
		{
			"Year":"2011",
			"Question":"5(a) Self-Help Group (SHG) as an informal organization of work"
		},
		{
			"Year":"2011",
			"Question":"5(b) Power Elite"
		},
		{
			"Year":"2011",
			"Question":"5(c) Cultural Pluralism"
		},
		{
			"Year":"2011",
			"Question":"5(d) Lineage and Descent"
		},
		{
			"Year":"2011",
			"Question":"5(e) Development and Dependency"
		},
		{
			"Year":"2011",
			"Question":"6. (a) What is formal organization? “The growth of bureaucracy has resulted in extreme concentration of power at larger levels of social organization.” Discuss. 20"
		},
		{
			"Year":"2011",
			"Question":"6(b) Highlight prerequisites of social movement bring out the differences between social movement and revolution. 20"
		},
		{
			"Year":"2011",
			"Question":"6(c) “Collective action in politics can bring integration and disintegration in society.” Comment. 20"
		},
		{
			"Year":"2011",
			"Question":"7. (a) Define sect, cult and religion. In what way do Weber’s views on religion differ from those of Durkheim? 20"
		},
		{
			"Year":"2011",
			"Question":"7(b) What you mean by marriage and family? Discuss the structural and functional changes in family in modern society. 20"
		},
		{
			"Year":"2011",
			"Question":"7(c) Explain the concepts of Participatory Democracy What conditions are assumed to be conducive to participation? 20"
		},
		{
			"Year":"2011",
			"Question":"8. (a) “ Social support mechanism needs to be strengthened for effective implementation of development programmes.” 20"
		},
		{
			"Year":"2011",
			"Question":"8(b) Discuss World System Theory in the context of modern society. 20"
		},
		{
			"Year":"2011",
			"Question":"8(c) “Science and Technology are major forces accelerating the process of social change.” Comment. "
		},
		{
			"Year":"2011",
			"Question":"1(a) Perspectives’ on the study of caste by M.N. Srinivas and Andre Beteille."
		},
		{
			"Year":"2011",
			"Question":"1(b) Distinction between the concepts of family and household."
		},
		{
			"Year":"2011",
			"Question":"1(c) Unity and diversity among the tribes in India."
		},
		{
			"Year":"2011",
			"Question":"(1d) The book-view and the field-view in Indian sociology."
		},
		{
			"Year":"2011",
			"Question":"2. (a) Bring out the relationship between fertility and social structure as viewed by Davisand Blake. 30"
		},
		{
			"Year":"2011",
			"Question":"2(b) “Protective discrimination not only protects but also discriminates.” Comment. 30"
		},
		{
			"Year":"2011",
			"Question":"3. (a) Distinguish between ‘secularism’ and ‘secularisation’. Analyse the nature and extent of secularization in contemporary India. 30"
		},
		{
			"Year":"2011",
			"Question":"3(b) Analyze the term ‘dalit’ and the evolution of the related concept as a reflection of the changing consciousness and self-assertion of the dalit community. 30"
		},
		{
			"Year":"2011",
			"Question":"4. (a) How are the issues of ethnicity are the issues of ethnicity and nationalism related? Discuss in the context of the emergence of ethno nationalism in India. 30"
		},
		{
			"Year":"2011",
			"Question":"4(b) What are the linkage points between globalization and the growth of the informal sector? How have these affected the nature and functioning of the working class? 30"
		},
		{
			"Year":"2011",
			"Question":"5(a) Stage of the Women’s movement in India."
		},
		{
			"Year":"2011",
			"Question":"5(b) Impact of Green Revolution on rural class structure."
		},
		{
			"Year":"2011",
			"Question":"5(c) Infant Mortality Rate is the most sensitive index for measuring development. Comment."
		},
		{
			"Year":"2011",
			"Question":"5(d) Structural factors behind violence against women."
		},
		{
			"Year":"2011",
			"Question":"6. (a) Critically examine D.N. Dhanagare’s views on agrarian movements in India. 20"
		},
		{
			"Year":"2011",
			"Question":"6(b) Explain the interface between population, ecology and environment in the context of India. 20"
		},
		{
			"Year":"2011",
			"Question":"6(c) ‘Casteism is the modern edition of the caste system.’ Do you agree with this statement / Discuss with arguments. 20"
		},
		{
			"Year":"2011",
			"Question":"7. (a) Comment on the factors responsible for the growth and consolidation of middle level peasantry in rural India. How is it related to capitalism in Indian agriculture? 30"
		},
		{
			"Year":"2011",
			"Question":"8. (a) Rapid urbanization and sustainable development do not go together. Discuss with arguments. 20"
		},
		{
			"Year":"2011",
			"Question":"8(b) Analyze the changing nexus between caste and tribe. 20"
		},
		{
			"Year":"2011",
			"Question":"8(c) Bring out the relationship between social class and mortality. 20"
		},
	

		
		{
			"Year":"2012",
			"Question":"1(a) Interpretative Sociology"
		},
		{
			"Year":"2012",
			"Question":"1(b) Fact Value and Objectivity"
		},
		{
			"Year":"2012",
			"Question":"1(c) Universalism vs. Particilarism"
		},
		{
			"Year":"2012",
			"Question":"1(d) Comparative Method"
		},
		{
			"Year":"2012",
			"Question":"1(e) Sacred and Profane"
		},
		{
			"Year":"2012",
			"Question":"2.a. How did the French revolution and Industrial revolution play an important role in the emergence of Sociology?(20)"
		},
		{
			"Year":"2012",
			"Question":"2.b. Show how Durkheim through of totemism demonstrates the reality of religion.(20)"
		},
		{
			"Year":"2012",
			"Question":"3.a. ‘Power and authority go together.’ Examine. Explain the various types of authority also.(30)"
		},
		{
			"Year":"2012",
			"Question":"3.b. Examine how Weber’s characterisation of capitalism is different from those of Marx.(30)"
		},
		{
			"Year":"2012",
			"Question":"4.a. Differentiate between the qualitative and quantitative methods of research(20)"
		},
		{
			"Year":"2012",
			"Question":"4.b. sometimes workers do not feel attachment for their work. Marks formed a theory on the situation, discuss that theory.(20)"
		},
		{
			"Year":"2012",
			"Question":"4.c. social fact is to be treated as a thing. Discuss(20)"
		},
		{
			"Year":"2012",
			"Question":"5(a) Stratification of Classes"
		},
		{
			"Year":"2012",
			"Question":"5(b) Industrial Democracy"
		},
		{
			"Year":"2012",
			"Question":"5(c)Citizenship and Civil Society"
		},
		{
			"Year":"2012",
			"Question":"5(d)Millenarian Movements"
		},
		{
			"Year":"2012",
			"Question":"5(e)Theory of Cultural Lag-Ogburn and Nimkoff."
		},
		{
			"Year":"2012",
			"Question":"6.a. In our society Hierarchical relations are influenced by social mobility ? Discuss."
		},
		{
			"Year":"2012",
			"Question":"6.b. In Marxian classification of Society, feudal and slave societies are very important. How are they different from each other?"
		},
		{
			"Year":"2012",
			"Question":"6.c. Are Social movement always influenced by ideologies? Discuss."
		},
		{
			"Year":"2012",
			"Question":"7.a. Discuss the factors leading to growing religious revivalism in the contemporary world."
		},
		{
			"Year":"2012",
			"Question":"7.b. Describe the important of lineage and descent in kinship and family."
		},
		{
			"Year":"2012",
			"Question":"7.c. Show how family is distinct from household."
		},
		{
			"Year":"2012",
			"Question":"8.a.  How so formal and informal organisation of work influence labour’s mobility ? Exaplain with examples."
		},
		{
			"Year":"2012",
			"Question":"8.b.  What do you understand by nation ? Is the nation same as the state ? Discuss."
		},
		{
			"Year":"2012",
			"Question":"8.c. ‘Revolutionary change have some specific characteristics.’ Discuss with examples."
		},
		{
			"Year":"2012",
			"Question":"1(a) Limitations of the dialectical approach to the study on Indian society."
		},
		{
			"Year":"2012",
			"Question":"1(b) Changing rural power structure."
		},
		{
			"Year":"2012",
			"Question":"1(c) Challenges to institution of marriage."
		},
		{
			"Year":"2012",
			"Question":"1(d) Westernization and institutional changes in India."
		},
		{
			"Year":"2012",
			"Question":"1(e) Interaction of ‘little tradition’ and ‘great iradition’."
		},
		{
			"Year":"2012",
			"Question":"2.a.i. Tribe and Caste"
		},
		{
			"Year":"2012",
			"Question":"2.a.ii. Affinal kin and Consanguineous kin."
		},
		{
			"Year":"2012",
			"Question":"2.a.iii. Marriage as sacrament and marriage as contract."
		},
		{
			"Year":"2012",
			"Question":"2.a.iv. Positional change and structural change."
		},
		{
			"Year":"2012",
			"Question":"2.b. ‘Indian society may be understood as a system of cognitive structures.’ How far do you agree with this statement?"
		},
		{
			"Year":"2012",
			"Question":"2.c. Comment on the social and cultural determinants of sexual decision of labour. "
		},
		{
			"Year":"2012",
			"Question":"3.a. Examine the impact of secularization on various religious communities in India."
		},
		{
			"Year":"2012",
			"Question":"3.b. Has geographic and economic mobility impacted the tribal culture and social structure ? Give examples."
		},
		{
			"Year":"2012",
			"Question":"4.a. Has nuclear family existed in traditional India? Discuss with reference to the views of I. P. Desai."
		},
		{
			"Year":"2012",
			"Question":"4.b. How have social reform movements in colonial India contributed to modernization of Indian society?"
		},
		{
			"Year":"2012",
			"Question":"4.c. Discuss the factors which contributed to industrial modernization in India. What are the salient features of new industrial class structure ?"
		},
		{
			"Year":"2012",
			"Question":"5.a. Demographic perspective of Indian youth."
		},
		{
			"Year":"2012",
			"Question":"5.b. Regional political elites and the democratic process."
		},
		{
			"Year":"2012",
			"Question":"5.c. Education and Dalit empowerment."
		},
		{
			"Year":"2012",
			"Question":"5.d. Constitution as a living document of social change."
		},
		{
			"Year":"2012",
			"Question":"5.e. Education and removal of inequality."
		},
		{
			"Year":"2012",
			"Question":"6.a. Critically examine the concepts of nation and citizenship in the context of globalization."
		},
		{
			"Year":"2012",
			"Question":"6.b. Discuss some social and cultural determinants of infant morality rate. Give your suggestions to prevent infanticide."
		},
		{
			"Year":"2012",
			"Question":"6.c.Bring out some positive and negative social consequences of green revolution. How has green revolution changed the rural social structure?Q 7. 30 markers"
		},
		{
			"Year":"2012",
			"Question":"7.a Describe those social changes which have contributed to increase of violence against women. What are the emerging forms of violence against women? Suggest suitable measures to contain this problem."
		},
		{
			"Year":"2012",
			"Question":"7.b. What are the problems if ageing population? Describe the declining traditional social support system for the aged. Suggest alternative measures to support ageing population."
		},
		{
			"Year":"2012",
			"Question":"8.a. Have the new economic policy and economic reform led to weakening of labour class movements? Explain your views with examples."
		},
		{
			"Year":"2012",
			"Question":"8.b. Do you think that some policies and laws relating to environment have retarded the development process ? Give examples. How can an ideal balance between environmental protection and development goals be broug"
		},
		{
			"Year":"2013",
			"Question":"1(a)Sociology emerged in Europe and flourished to begin with on social reformist orientation in the USA. Comment.(10 marks)"
		},
		{
			"Year":"2013",
			"Question":"1(b)Compare and contrast Sociology with Anthropology(10 marks)"
		},
		{
			"Year":"2013",
			"Question":"(1c)Critically examine positivistic approach in sociological studies.(10 marks)"
		},
		{
			"Year":"2013",
			"Question":"1(d)Examine science and technology on agents of social change.(10 marks)"
		},
		{
			"Year":"2013",
			"Question":"1(e)Analyse the contemporary trends in family with examples.(10 marks)"
		},
		{
			"Year":"2013",
			"Question":"2.(a) Analyse the limitations of quantitative methods in social research(20 marks)"
		},
		{
			"Year":"2013",
			"Question":"2(b) Critically examine the functionalist tradition in sociology (20 marks)"
		},
		{
			"Year":"2013",
			"Question":"2(c)Analyse the salient features of historical materialism (10 marks)"
		},
		{
			"Year":"2013",
			"Question":"3.(a) Compare Karl Marx with Emile Durkheim with reference to the framework of ‘division of labour’.(20)"
		},
		{
			"Year":"2013",
			"Question":"3(b)Critically analyse the contributions of G.H. Mead to ‘symbolic interactionism’.(20)"
		},
		{
			"Year":"2013",
			"Question":"3(c)Examine the salient features of Weberian bureaucracy.(10)"
		},
		{
			"Year":"2013",
			"Question":"4.(a)How are open and closed systems of stratification undergoing transformation in the emergence of new hierarchical social order in societies?(20)"
		},
		{
			"Year":"2013",
			"Question":"4(b)Is patriarchy a universal phenomenon? Critically examine how patriarchy affects sexual division of labour in societies.(20)"
		},
		{
			"Year":"2013",
			"Question":"4(c)Examine the role of pressure groups in parliamentary democracy. (10)"
		},
		{
			"Year":"2013",
			"Question":"5.(a)Distinguish between people being socially excluded and people excluding themselves socially in societies.(10)"
		},
		{
			"Year":"2013",
			"Question":"5(b)Define social movement. Elucidate the role of reformist movements in social change.(10)"
		},
		{
			"Year":"2013",
			"Question":"5(c)”Science has empirical means to logical ends and religion has non-empirical means to logical ends” – Comment.(10)"
		},
		{
			"Year":"2013",
			"Question":"5(d)Examine the social dimensions of displacement induced by development.(10)"
		},
		{
			"Year":"2013",
			"Question":"5(e)Analyse the gender bias in the present society with examples.(10)"
		},
		{
			"Year":"2013",
			"Question":"6.(a)How do Karl Marx and weber differ in terms of their analysis of social stratification?(20)"
		},
		{
			"Year":"2013",
			"Question":"6(b)Examine the social impact globalization on labour and society.(20)"
		},
		{
			"Year":"2013",
			"Question":"6(c)Examine the relevance of parsonian Social system in the present society.(10)"
		},
		{
			"Year":"2013",
			"Question":"7.(a) Evaluate how do civil society and democracy mutually reinforce each other.(20)"
		},
		{
			"Year":"2013",
			"Question":"7(b)Examine the emerging trends in marriage and family as a response to the changes in economic and social order.(20)"
		},
		{
			"Year":"2013",
			"Question":"7(c) Critically examine the role of civil society in democracy.(10)"
		},
		{
			"Year":"2013",
			"Question":"8.(a) Illustrate the conflicts and tensions experienced by societies undergoing social change.(20)"
		},
		{
			"Year":"2013",
			"Question":"8(b)Critically examine the cultural theories of social change with suitable examples.(20)"
		},
		{
			"Year":"2013",
			"Question":"8(c)Is religion antithetical to science? comment. (10)"
		},
		{
			"Year":"2013",
			"Question":"1(a)Andre Beteille definition of class.(10)"
		},
		{
			"Year":"2013",
			"Question":"1(b)M.N Srinivas concept of westernisation.(10)"
		},
		{
			"Year":"2013",
			"Question":"1(c)Satya Sodhak movement of Mahatma Jyotiba Phule.(10)"
		},
		{
			"Year":"2013",
			"Question":"1(d)Classes in agrarian society in India.(10)"
		},
		{
			"Year":"2013",
			"Question":"1(e)Other Backward classes.(10)"
		},
		{
			"Year":"2013",
			"Question":"2.(a)what are the features that distinguish tribes from the rest of the population?(20)"
		},
		{
			"Year":"2013",
			"Question":"2(b)Write a note on ethnicity and integration in the context of tribes.(20)"
		},
		{
			"Year":"2013",
			"Question":"2(c)How does the new Forest act affects tribals?(10)"
		},
		{
			"Year":"2013",
			"Question":"3.(a)What are the main features of Dr. B.R. Ambedkar’s views on annihilation of caste?(20)"
		},
		{
			"Year":"2013",
			"Question":"3(b)Critically evaluate Louis Dumont’s Homo Hierarchius.(20)"
		},
		{
			"Year":"2013",
			"Question":"3(c)What are the features of M.N. Srinivas concept of dominant caste? How effective is it in understanding today’s reality?(10)"
		},
		{
			"Year":"2013",
			"Question":"4.(a)Distinguish between formal and informal sectors in india.(20)"
		},
		{
			"Year":"2013",
			"Question":"4(b)Examine the influence of industrialisation on caste.(15)"
		},
		{
			"Year":"2013",
			"Question":"4(c)Discuss the salient features of Indian middle class.(15)"
		},
		{
			"Year":"2013",
			"Question":"5(a)Five Year Plans.(10)"
		},
		{
			"Year":"2013",
			"Question":"5(b)Mahatma Gandhi National Rural Employment Guarantee Scheme.(10)"
		},
		{
			"Year":"2013",
			"Question":"5(c)Green Revolution.(10)"
		},
		{
			"Year":"2013",
			"Question":"5(d)Child Labour.(10)"
		},
		{
			"Year":"2013",
			"Question":"5(e)Sex Ratio.(10)"
		},
		{
			"Year":"2013",
			"Question":"6.(a)Bring out the main features of farmers movements in modern india.(20)"
		},
		{
			"Year":"2013",
			"Question":"6(b)Discuss the sociological aspects of movements for separate states.(15)"
		},
		{
			"Year":"2013",
			"Question":"6(c)Explain the inter-linkages between poverty, deprivation and inequality.(15)"
		},
		{
			"Year":"2013",
			"Question":"7.(a)Write an analytical note on slums in cities.(15)"
		},
		{
			"Year":"2013",
			"Question":"7(b)Discuss the problems of working women in India.(20)"
		},
		{
			"Year":"2013",
			"Question":"7(c)What are the main causes of female mortality in India?(15)"
		},
		{
			"Year":"2013",
			"Question":"8.(a)Analyse the role of communalism in undermining democracy in india.(15)"
		},
		{
			"Year":"2013",
			"Question":"8(b)What is Dalit movement? Examine the issues highlighted by it.(20)"
		},
		{
			"Year":"2013",
			"Question":"8(c)Discuss the salient features of right to education.(15)"
		},
		{
			"Year":"2014",
			"Question":"1(a)How is objectivity different from value neutrality? Discuss with reference to weber’s views on methodology."
		},
		{
			"Year":"2014",
			"Question":"1(b)How did the emergence of industrial society change the family life in western Europe?"
		},
		{
			"Year":"2014",
			"Question":"1(c)How is sociological approach to human actions different from that of psychological approach?"
		},
		{
			"Year":"2014",
			"Question":"1(d)In what way biographies could be used to study social life?"
		},
		{
			"Year":"2014",
			"Question":"1(e)How can we use reference group theory to understand fashion in society?"
		},
		{
			"Year":"2014",
			"Question":"2.(a)Which research technique would be most suitable for the study of consumer behaviour and its social correlates? Explain."
		},
		{
			"Year":"2014",
			"Question":"2(b)Identify the similarities and differences between Marx’s theory of ‘alienation and Durkheim’s theory of ‘anomie’."
		},
		{
			"Year":"2014",
			"Question":"2(c)How could one use Merton’s concept of deviance to understand the traffic problem in urban India?"
		},
		{
			"Year":"2014",
			"Question":"3.(a)What do you understand by gender? How does it shape ‘male’ identity?"
		},
		{
			"Year":"2014",
			"Question":"3(b)According to Max Weber ‘class’ and ‘status’ are two different dimensions of power. Discuss."
		},
		{
			"Year":"2014",
			"Question":"3(c)Using Merton’s concepts of ‘manifest’ and ‘latent’ functions, explain the persistence of corruption in Indian Society."
		},
		{
			"Year":"2014",
			"Question":"4.(a)How does weber use the notion of ‘ideal types’ in his theory of bureaucracy?"
		},
		{
			"Year":"2014",
			"Question":"4(b)In what way ‘interpretative’ method is different from ‘Positivist’ approach in the study of social phenomena?"
		},
		{
			"Year":"2014",
			"Question":"4(c)Using Mead’s theory of symbolic interactionism, discuss the stages in the formation of gender identity."
		},
		{
			"Year":"2014",
			"Question":"5(a)For marx, class divisions are outcomes of ‘exploitation’. Discuss."
		},
		{
			"Year":"2014",
			"Question":"5(b)What are the distinctive features of social organization of work in slave society? How is it different from feudal society?"
		},
		{
			"Year":"2014",
			"Question":"5(c)Discuss T.H. Marshall’s views on citizenship."
		},
		{
			"Year":"2014",
			"Question":"5(d)Distinguish between political parties and pressure groups."
		},
		{
			"Year":"2014",
			"Question":"5(e)“According to Durkheim, the essence of religion in modern society is the same as religion in primitive society”. Comment."
		},
		{
			"Year":"2014",
			"Question":" 6.(a)”Power is not a zero-sum game” Discuss with reference to weber’s and parsons’ views."
		},
		{
			"Year":"2014",
			"Question":"6(b)Critically examine the functionalist views on the institution of family. How do those help us in understanding family in the present times?"
		},
		{
			"Year":"2014",
			"Question":"6(c)what do you understand by institutionalization of ‘live-in relationship’?"
		},
		{
			"Year":"2014",
			"Question":"7.(a)How is religious revivalism different from communalism? Elaborate with suitable examples from the Indian context."
		},
		{
			"Year":"2014",
			"Question":"7(b)Education is often viewed as an agency of social change. However in reality it could also reinforce inequalities and conservatism. Discuss."
		},
		{
			"Year":"2014",
			"Question":"7(c)According to Marx, Capitalism transforms even the personal relationships between men and women. Critically examine with illustrations from the contemporary Indian context."
		},
		{
			"Year":"2014",
			"Question":"8.(a)How is the increasing use of technology changing the status of women in indian society?"
		},
		{
			"Year":"2014",
			"Question":"8(b)write a short essay on the latin American perspective on ‘ dependency’."
		},
		{
			"Year":"2014",
			"Question":"8(c)what do you understand by social movement? How has the mobilization by schedules castes helped them in constructing a new identity?"
		},
		{
			"Year":"2014",
			"Question":"1(a)Gandhi’s efforts on communal harmony"
		},
		{
			"Year":"2014",
			"Question":"1(b)Modernisation of Indian traditions"
		},
		{
			"Year":"2014",
			"Question":"1(c)Types of Kinship systems in India"
		},
		{
			"Year":"2014",
			"Question":"1(d)Features of caste system"
		},
		{
			"Year":"2014",
			"Question":"1(e)G.S.Ghurye’s Indological approach to understand society in india."
		},
		{
			"Year":"2014",
			"Question":"2.(a)Analyse the different views on integration and autonomy of tribes in India."
		},
		{
			"Year":"2014",
			"Question":"2(b)Discuss the social background of Indian nationalism."
		},
		{
			"Year":"2014",
			"Question":"2(c)Define Patriarchy. How does it impact the overall entitlement of girl child in India?"
		},
		{
			"Year":"2014",
			"Question":"3.(a)Give a sociological analysis of problems of migrant urban poor."
		},
		{
			"Year":"2014",
			"Question":"3(b)Discuss the problems of religious minorities in India."
		},
		{
			"Year":"2014",
			"Question":"3(c)Write some of the important social reforms in india for the removal of untouchability."
		},
		{
			"Year":"2014",
			"Question":"4.(a)Discuss the status of women among the emerging urban middle class."
		},
		{
			"Year":"2014",
			"Question":"4(b)Describe the impact of land reforms on the peasants of Indian society."
		},
		{
			"Year":"2014",
			"Question":"4(c) What is the idea of ‘Indian Village’? Explain."
		},
		{
			"Year":"2014",
			"Question":"5(a)Trends of Infant Mortality Rate among females"
		},
		{
			"Year":"2014",
			"Question":"5(b)Domestic Violence Act, 2005"
		},
		{
			"Year":"2014",
			"Question":"5(c)Dynamics of contemporary Dalit movements"
		},
		{
			"Year":"2014",
			"Question":"5(d)Impact privatisation on educational disparities"
		},
		{
			"Year":"2014",
			"Question":"5(e)Rural landless labourers and development induced displacement"
		},
		{
			"Year":"2014",
			"Question":"6.(a)What are the main features of the second wave of women’s movement in Indian context?"
		},
		{
			"Year":"2014",
			"Question":"6(b)Discuss the ‘Chipko movement’ as an example of eco-feminism."
		},
		{
			"Year":"2014",
			"Question":"6(c)Discuss the impact of globalisation on the workers in the Informal sector."
		},
		{
			"Year":"2014",
			"Question":"7.(a)what are the demographic projections for the ageing population(60+) fro the next decade? What are the implications for formulating policy for them?"
		},
		{
			"Year":"2014",
			"Question":"7(b)What are the possible underlying causes of the spurt of increased violence against women in public spaces in the last decade?"
		},
		{
			"Year":"2014",
			"Question":"7(c)How do caste and class come together in creating the category of extreme poor?"
		},
		{
			"Year":"2014",
			"Question":"8.(a)’Many caste conflicts are between castes which are close to each other on the hierarchical scale.’ Give a sociological explanation for this phenomenon."
		},
		{
			"Year":"2014",
			"Question":"8(b)”Tribal conflicts based on ethnic differences often camouflage a struggle for political and economic advantage.’ Substantiate with examples."
		},
		{
			"Year":"2014",
			"Question":"8(c)Who are the elites? Discuss their roles in bringing social transformation."
		},
		{
			"Year":"2015",
			"Question":"1(a)Is sociology a science? Give reasons for your answer."
		},
		{
			"Year":"2015",
			"Question":"1(b)Discuss the relevance of historical method in the study of society."
		},
		{
			"Year":"2015",
			"Question":"1(c)What are variables? Discuss their role in experimental research."
		},
		{
			"Year":"2015",
			"Question":"1(d)Which concepts did weber use to analyse the forms of legitimate domination?"
		},
		{
			"Year":"2015",
			"Question":"1(e)“No society can either be absolutely open or absolutely closed” Comment."
		},
		{
			"Year":"2015",
			"Question":"2.(a)Discuss the role of Calvinist ethic in the development of capitalism."
		},
		{
			"Year":"2015",
			"Question":"2(b)Examine the problems of maintaining objectivity and value neutrality in social science research."
		},
		{
			"Year":"2015",
			"Question":"2(c)”Self and Society are twin – born” Examine the statement of Mead."
		},
		{
			"Year":"2015",
			"Question":"3.(a)Why is random sampling said to have more reliability and validity in research?"
		},
		{
			"Year":"2015",
			"Question":"3(b)Differentiate between Marxian and Weberian theories of social stratification."
		},
		{
			"Year":"2015",
			"Question":"3(c)How had Enlightenment contributed to the emergence of Sociology?"
		},
		{
			"Year":"2015",
			"Question":"4.(a)“Non-Positivistic methodology is essential for understanding human behaviour”. Discuss."
		},
		{
			"Year":"2015",
			"Question":"4(b)How is social equilibrium maintained in Parsonian framework?"
		},
		{
			"Year":"2015",
			"Question":"4(c)”Anomie is rooted in social structure” Explain with reference to R.K.Merton’s contribution."
		},
		{
			"Year":"2015",
			"Question":"5(a)Distinguish between the social organization of work in feudal society and in capitalist society."
		},
		{
			"Year":"2015",
			"Question":"5(b)Ideology is crucial for social transformation in a democracy.” Discuss."
		},
		{
			"Year":"2015",
			"Question":"5(c)Distinguish between sects and cults with illustrations."
		},
		{
			"Year":"2015",
			"Question":"5(d)Is male authority absent in matrilineal society? Discuss."
		},
		{
			"Year":"2015",
			"Question":"5(e)Explain the relevance of idea of ‘Cultural lag’ in understanding social change."
		},
		{
			"Year":"2015",
			"Question":"6.(a)”Education helps in perpetuating social and economic inequalities.” Critically examine the statement."
		},
		{
			"Year":"2015",
			"Question":"6(b)Explain the conditions under which a collective action transforms into a social movement."
		},
		{
			"Year":"2015",
			"Question":"6(c)How do the rules of descent and alliance in kinship differ from each other? Illustrate."
		},
		{
			"Year":"2015",
			"Question":"7.(a)Define Secularisation. What are its major dimensions in the modern world?"
		},
		{
			"Year":"2015",
			"Question":"7(b)The increasing importance of the tertiary sector has weakened the formal organization of work in recent times. Examine the statement."
		},
		{
			"Year":"2015",
			"Question":"7(c) Caste ideology appears to have strengthened democracy. Comment."
		},
		{
			"Year":"2015",
			"Question":"8.(a)”Globalization involves DE-terrorization.” Examine with reference to the nation-state."
		},
		{
			"Year":"2015",
			"Question":"8(b)Examine the dialectical relation between tradition and modernity in the study of social change."
		},
		{
			"Year":"2015",
			"Question":"8(c)Elaborate the views of Durkheim on “The Elementary Forms of Religious Life”.  "
		},
		{
			"Year":"2015",
			"Question":"1(a)Verrier Elwins views on freedom for the tribals"
		},
		{
			"Year":"2015",
			"Question":"1(b)Jyotirao Phule as an agrarian radical"
		},
		{
			"Year":"2015",
			"Question":"1(c)Louis Dumont’s perspective on Indian caste system"
		},
		{
			"Year":"2015",
			"Question":"1(d)How far Gandhi was trusted by the untouchables?"
		},
		{
			"Year":"2015",
			"Question":"1(e)Feminization of poverty"
		},
		{
			"Year":"2015",
			"Question":"2.(a)In caste system changing, weakening or disintegrating in India?"
		},
		{
			"Year":"2015",
			"Question":"2(b)Give some of the important studies relating to the structural changes in the Indian family system."
		},
		{
			"Year":"2015",
			"Question":"2(c)Broadly compare the kinship system of North and South India."
		},
		{
			"Year":"2015",
			"Question":"3.(a)Discuss the paradigm of modernization of Indian tradition in analysing social change in India."
		},
		{
			"Year":"2015",
			"Question":"3(b)What is patriarchy? How does it affect the child socialization pattern in India?"
		},
		{
			"Year":"2015",
			"Question":"3(c)Discuss the problems of elderly in India. What are the different perspectives to solve their problems?"
		},
		{
			"Year":"2015",
			"Question":"4.(a)Discuss Marxist approach to the analysis of Indian nationalism."
		},
		{
			"Year":"2015",
			"Question":"4(b)What are the basic tenets of Hindu religion? Is Hinduism based on monotheism or Polytheism?"
		},
		{
			"Year":"2015",
			"Question":"4(c)Why is it necessary to implement PCPNDT Act in India?"
		},
		{
			"Year":"2015",
			"Question":"5(a)Important components of National Education Policy in India"
		},
		{
			"Year":"2015",
			"Question":"5(b)Main objectives of Tribal Sub-Plan(TSP)"
		},
		{
			"Year":"2015",
			"Question":"5(c)Effect of displacement through development on the rural landless and marginal farmers"
		},
		{
			"Year":"2015",
			"Question":"5(d)Issues relating to the informal labour market in urban India"
		},
		{
			"Year":"2015",
			"Question":"5(e)How far Srinivas’ Sanskritization is modernizing force or traditionalizing force in understanding the changes in caste system?"
		},
		{
			"Year":"2015",
			"Question":"6.(a) Discuss the impact of post-1970 feminist movement on Indian middles class."
		},
		{
			"Year":"2015",
			"Question":"6(b)What are the major concerns of ethnic identity and religious identity in India?"
		},
		{
			"Year":"2015",
			"Question":"6(c)How serious is the problem of trafficking against women and children in india?"
		},
		{
			"Year":"2015",
			"Question":"7.(a) Discuss B.R. Ambedkar as a wise democrat."
		},
		{
			"Year":"2015",
			"Question":"7(b)Discuss the main features of farmers’ movements in Independent India."
		},
		{
			"Year":"2015",
			"Question":"7(c)To what extent the Muslim personal Law Board is in agreement with Islamic feminist agenda?"
		},
		{
			"Year":"2015",
			"Question":"8.(a)Analyse Gandhi a moralist, ascetic and a man of  action through his Hind Swaraj."
		},
		{
			"Year":"2015",
			"Question":"8(b)Human development approach affirms that education and health-care growth are more important than economic growth. Discuss this Issue in the light of post-liberalized Indian Society."
		},
		{
			"Year":"2015",
			"Question":"8(c)Write a brief note on freedom of press."
		},
		{
			"Year":"2016",
			"Question":"1(a)”Sociology is pre-eminently study of modern societies.” Discuss."
		},
		{
			"Year":"2016",
			"Question":"1(b)What is ‘value-free sociology’? Clarify."
		},
		{
			"Year":"2016",
			"Question":"1(c)Analyse the importance of qualitative methods in social research."
		},
		{
			"Year":"2016",
			"Question":"1(d)Evaluate Marx’s ideas on mode of production."
		},
		{
			"Year":"2016",
			"Question":"1(e)“Vertical mobility brings structural change even in a closed social system.” Comment."
		},
		{
			"Year":"2016",
			"Question":"2.(a)Elucidate the basic premises of Davis’ structural-functional theory of social stratification. How far is it relevant in understanding contemporary Indian society?"
		},
		{
			"Year":"2016",
			"Question":"2(b)Describe the functional prerequisites of social system as given by Talcott Parsons. Examine in the context of a university as a social system."
		},
		{
			"Year":"2016",
			"Question":"2(c)Is sociology common sense? Give reasons in support of your argument."
		},
		{
			"Year":"2016",
			"Question":"3.(a)Analyse the manifest and latent functions of ‘security of the tenure of bureaucrats’ in light of Merton’s theory."
		},
		{
			"Year":"2016",
			"Question":"3(b)Describe the basic postulates of scientific method. How far are these followed in sociological research?"
		},
		{
			"Year":"2016",
			"Question":"3(c)Hypothesis is a statement of the relationship between two or more variables.” Elucidate by giving example of poverty and illiteracy."
		},
		{
			"Year":"2016",
			"Question":"4.(a)Examine Max Weber’s method of maintaining objectivity in social research."
		},
		{
			"Year":"2016",
			"Question":"4(b)”Participant observation is the most efficient tool for collecting facts.” Comment."
		},
		{
			"Year":"2016",
			"Question":"4(c)Discuss the relationship between poverty and social exclusion."
		},
		{
			"Year":"2016",
			"Question":"5(a)Describe the nature of social organization of work in industrial society."
		},
		{
			"Year":"2016",
			"Question":"5(b)Discuss the importance of ‘Power elite’ in democracy."
		},
		{
			"Year":"2016",
			"Question":"5(c)Is religion playing an important role in increasing fundamentalism? Give reasons for your answer."
		},
		{
			"Year":"2016",
			"Question":"5(d)To what extent is patriarchy a cause for the problems of women? Discuss."
		},
		{
			"Year":"2016",
			"Question":"5(e)“Social Conflict is both a cause and a consequence of social change.” Explain. "
		},
		{
			"Year":"2016",
			"Question":"6.(a)”Globalization has pushed the labour into informal organization of work.” Substantiate your answer with suitable examples."
		},
		{
			"Year":"2016",
			"Question":"6(b)Social Change can be brought about through development .” Illustrate from the contemporary situation of India."
		},
		{
			"Year":"2016",
			"Question":"6(c)Examine the role of Protest movements in changing the status of Dalits in India."
		},
		{
			"Year":"2016",
			"Question":"7.(a) “Religious pluralism is the order of present-day societies.” Explain by giving suitable examples."
		},
		{
			"Year":"2016",
			"Question":"7(b) Discuss the contemporary trends in family as a response to social change in modern society."
		},
		{
			"Year":"2016",
			"Question":"7(c)To what extent revolution replaces the existing order of society? Discuss."
		},
		{
			"Year":"2016",
			"Question":"8.(a)”Education is a major source of social mobility in contemporary society.” Explain."
		},
		{
			"Year":"2016",
			"Question":"8(b)How is Durkheim’s theory of religion different from Max Weber’s theory of religion?"
		},
		{
			"Year":"2016",
			"Question":"8(c)Distinguish between family and household as sociological concepts."
		},
		{
			"Year":"2016",
			"Question":"1(a)Salient features of A.R. Desai’s Marxist Sociology"
		},
		{
			"Year":"2016",
			"Question":"1(b)Significance of village studies in Indian Sociology"
		},
		{
			"Year":"2016",
			"Question":"1(c)‘Isolationism’ as a dominant features of colonial tribal policy"
		},
		{
			"Year":"2016",
			"Question":"1(d)Anti-Brahmanical movements during the colonial period"
		},
		{
			"Year":"2016",
			"Question":"1(e)Patriarchy as a form of dominance"
		},
		{
			"Year":"2016",
			"Question":"2.(a) How has B.R. Ambedkar identified the features of caste system? How is it different from the mainstream treatment of caste features?"
		},
		{
			"Year":"2016",
			"Question":"2(b)Discuss Andre Beteille’s account of the relationship between caste, class and power as a change from symmetrical to asymmetrical one."
		},
		{
			"Year":"2016",
			"Question":"2(c)Analyse the major components of Land Reforms Acts. Show their effectiveness in curbing rural inequality."
		},
		{
			"Year":"2016",
			"Question":"3.(a)Bring out the significance of the difference between family and household."
		},
		{
			"Year":"2016",
			"Question":"3(b)Elucidate the concepts of ‘majoritarianism’ and ‘minoritarianism’ in accentuating communal tensions in India."
		},
		{
			"Year":"2016",
			"Question":"3(c)Comment on the increasing significance of caste in politics."
		},
		{
			"Year":"2016",
			"Question":"4.(a)How is the tribal question related with the issues of integration and autonomy in modern India?"
		},
		{
			"Year":"2016",
			"Question":"(4b)Comment on the factors behind the changing status of women in urban India."
		},
		{
			"Year":"2016",
			"Question":"(4c)What accounts for the growth and consolidation of the middle classes in modern India?"
		},
		{
			"Year":"2016",
			"Question":"5(a)Privatization of education and increasing inequalities"
		},
		{
			"Year":"2016",
			"Question":"5(b)Mahatma Gandhi National Rural Employment Guarantee Scheme foe rural development"
		},
		{
			"Year":"2016",
			"Question":"5(c)Different forms of Dalit assertion"
		},
		{
			"Year":"2016",
			"Question":"5(d)Empowerment through ‘Right to Education’"
		},
		{
			"Year":"2016",
			"Question":"5(e)Differential sex-ratio and its implications"
		},
		{
			"Year":"2016",
			"Question":"6.(a)Write a note on the uneven impact of ‘Green Revolution’ on rural society."
		},
		{
			"Year":"2016",
			"Question":"6(b)Discuss the emerging forms of ‘inequalities’ and ‘acute poverty’ as major challenges of social transformation in india."
		},
		{
			"Year":"2016",
			"Question":"6(c)Discuss the various forms of environmental movements waged in India."
		},
		{
			"Year":"2016",
			"Question":"7.(a)Write a detailed note on effects of growing slums in urabn areas."
		},
		{
			"Year":"2016",
			"Question":"7(b)Discuss the changing nature of the problems of working class in the informal sector of the economy."
		},
		{
			"Year":"2016",
			"Question":"7(c)What are the factors accounting for the resurgence of ethnic identity movements in India?"
		},
		{
			"Year":"2016",
			"Question":"8.(a)Bring out the impact of the declining significance of the agrarian economy."
		},
		{
			"Year":"2016",
			"Question":"8(b)Examine the impact of industrialization and urbanization on family structure."
		},
		{
			"Year":"2016",
			"Question":"8(c)How is ageing becoming an emerging issue in Indian society?"
		},
		{
			"Year":"2017",
			"Question":"1(b)Examine ethnomethodological and phenomenological perspectives as critique of positivism."
		},
		{
			"Year":"2017",
			"Question":"1(c)Illustrate with example the significance of variables in sociological research."
		},
		{
			"Year":"2017",
			"Question":"1(d)Critically analyse Talcott Parsons’ conception of ‘Pattern Variables’."
		},
		{
			"Year":"2017",
			"Question":"1(e)Can we equate ‘Poverty’ with ‘Poor Living’” Elaborate your answer."
		},
		{
			"Year":"2017",
			"Question":" 2.(a)Discuss the changing equations of discipline of sociology with other social sciences."
		},
		{
			"Year":"2017",
			"Question":"2(b)Examine the basic postulates of Positivism and Post-Positivism."
		},
		{
			"Year":"2017",
			"Question":"2(c)Elaborate the main tenets of interpretative perspective in sociology."
		},
		{
			"Year":"2017",
			"Question":"3.(a)Discuss distinct sociological method adopted by Emile Durkheim in his study of ‘Suicide’."
		},
		{
			"Year":"2017",
			"Question":"3(b)Analyse Marxian conception of historical materialism as a critique of Hegelian dialectics."
		},
		{
			"Year":"2017",
			"Question":"3(c)Examine epistemological foundations of qualitative methods of social research."
		},
		{
			"Year":"2017",
			"Question":"4.(a)What is weberian critique of Marxist notion of social stratification?"
		},
		{
			"Year":"2017",
			"Question":"4(b)Examine gender, ethnicity and race as major dimensions of social stratification."
		},
		{
			"Year":"2017",
			"Question":"4(c)How can one resolve the issue of reliability and validity in the context of sociological research on inequality?"
		},
		{
			"Year":"2017",
			"Question":"5.(a)What do you understand by ‘informartionalisation of labour’? write your answer with special reference to india."
		},
		{
			"Year":"2017",
			"Question":"5(b)Discuss the changing interface between state and civil society in post-independent India."
		},
		{
			"Year":"2017",
			"Question":"(5c)Give an assessment of Durkheimian notion of ‘sacred’ and ‘profane’ in sociology of religion."
		},
		{
			"Year":"2017",
			"Question":"(5d)Examine ‘Patriarchal bargain’ as gendered division of work in contemporary India."
		},
		{
			"Year":"2017",
			"Question":"5(e)Assess the role of mass media as an agent of social change."
		},
		{
			"Year":"2017",
			"Question":"6.(a)Trace the changing nature of organization of work in capitalist society over the years."
		},
		{
			"Year":"2017",
			"Question":"6(b)What is new in ‘new social movements’? Elaborate your answer with special reference to India."
		},
		{
			"Year":"2017",
			"Question":"6(c)Examine the dynamics of pressure groups in multi- party political system."
		},
		{
			"Year":"2017",
			"Question":"7.(a)Examine the relationship between the contemporary trends in marriage and changing forms of family."
		},
		{
			"Year":"2017",
			"Question":"7(b)Discuss the regional variations of kinship system in Indian Society."
		},
		{
			"Year":"2017",
			"Question":"7(c)Problematize the concept of secularism in the present context."
		},
		{
			"Year":"2017",
			"Question":"8.(a)Examine any two theories of social change in detail."
		},
		{
			"Year":"2017",
			"Question":"8(b)Critically analyse the role of science and technology in bringing about social change."
		},
		{
			"Year":"2017",
			"Question":"8(c)Elaborate on various types of religious practices prevalent in Indian Society. "
		},
		{
			"Year":"2017",
			"Question":"1(a)Write a critique of the structural and functional perspective used by M.N. Srinivas in the understanding of Indian Society."
		},
		{
			"Year":"2017",
			"Question":"1(b)Which is more significant, the principle of ‘hierarchy’ or the principle of ‘difference’, in inter-caste relations in the present day?"
		},
		{
			"Year":"2017",
			"Question":"1(c)What the distinct features of Islam are as practised in India, and how have they changed over time?"
		},
		{
			"Year":"2017",
			"Question":"1(d) How have the struggles against untouchability changed their forms and perspectives from Gandhian to Ambedkarite positions?"
		},
		{
			"Year":"2017",
			"Question":"1(e)Write a short note on ‘changing means of production and increased rural poverty.’"
		},
		{
			"Year":"2017",
			"Question":"2.(a)The main objectives of socio-religious movements during the colonial rule in india were reforming and synthesizing Hinduism. Write on any two such important movements."
		},
		{
			"Year":"2017",
			"Question":"2(b)Discuss Yogendra singh’s thesis on Modernisation on Indian Tradition, and evaluate its applicability in the present day context."
		},
		{
			"Year":"2017",
			"Question":"2(c)What are the changes in the cultural and structural aspects of the caste system since independence."
		},
		{
			"Year":"2017",
			"Question":"3.(a)Indebtedness is one of the serious issues leading to farmers’ suicides. Discuss reasons and suggest solutions."
		},
		{
			"Year":"2017",
			"Question":"3(b)Clarify the distinction between ‘household’ and ‘family’ and evaluate whether joint families have completely disintegrated."
		},
		{
			"Year":"2017",
			"Question":"3(c)Compare the North Indian Kinship System with South Indian Kinship System."
		},
		{
			"Year":"2017",
			"Question":"4.(a)Explain the concepts of ‘Dominant caste’ and ‘vote bank’ , giving examples from specific regions."
		},
		{
			"Year":"2017",
			"Question":"4(b)What is the nature of religious change among tribals communities? Illustrate with two examples from colonial and post- independence times."
		},
		{
			"Year":"2017",
			"Question":"4(c)Compare the pressing problems of a dalit poor family living in an urban slum with a similar type of family living in a rural setting. "
		},
		{
			"Year":"2017",
			"Question":"5.(a)What are the reasons for the escalation of violence against women in the public domain?"
		},
		{
			"Year":"2017",
			"Question":"5(b)Write a note on Education and Equality in India."
		},
		{
			"Year":"2017",
			"Question":"5(c)Give an account of the problems relating to the “creamy layer”."
		},
		{
			"Year":"2017",
			"Question":"5(d)Do you agree that the issue of child labour raises questions about and beyond the informal sector? Give reasons."
		},
		{
			"Year":"2017",
			"Question":"5(e)What are the emerging concerns on women’s reproductive health?"
		},
		{
			"Year":"2017",
			"Question":"6.(a)Discuss some striking issues of development induced imbalances that need urgent attention."
		},
		{
			"Year":"2017",
			"Question":"6(b)Examine the impact of heritage tourism on urban socio-spatial patterns in India."
		},
		{
			"Year":"2017",
			"Question":"6(c)What are the causes and solutions for the low female sex-ratio in the DEMARU states of Punjab, Haryana, Himachal and Gujarat?"
		},
		{
			"Year":"2017",
			"Question":"7.(a)Despite gains from the women’s movement and state policy of women empowerment, gender equality is far from achieved. Identify two major challenges that prevent this goal from being reached."
		},
		{
			"Year":"2017",
			"Question":"7(b)To what extent does nation building depend on strengthening of pluralities in Indian Society?"
		},
		{
			"Year":"2017",
			"Question":"7(c)Explain the issues relating to ethnicity and sub-ethnicity."
		},
		{
			"Year":"2017",
			"Question":"8.(a)What is cultural Revivalism? Give some examples from performing arts, Language dissemination and arts and crafts in recent times."
		},
		{
			"Year":"2017",
			"Question":"8(b)What, according to you, are the two fundamental axes of social discrimination in Indian Society? Are they changing?"
		},
		{
			"Year":"2017",
			"Question":"8(c)Why have we started using another category of tribes called the particularly vulnerable Tribal Groups (PVTGs)? Why are they so called?"
		},
		{
			"Year":"2018",
			"Question":"1(a)The focal point of sociology rests on interaction. How do you distinguish it from common sense?"
		},
		{
			"Year":"2018",
			"Question":"1(b)Distinguish between fact and value in weber’s protestant Ethic and spirit of capitalism."
		},
		{
			"Year":"2018",
			"Question":"1(c)Do you think ‘I’ and ‘Me’ are central terms in Mead’s work?"
		},
		{
			"Year":"2018",
			"Question":"1(d)What is the difference between natural and social inequality? Give examples from caste and class dimensions. "
		},
		{
			"Year":"2018",
			"Question":"1(e)What are the new forms of family in developed societies? Discuss."
		},
		{
			"Year":"2018",
			"Question":"2.(a)Is non-positivistic methodology scientific? Illustrate."
		},
		{
			"Year":"2018",
			"Question":"2(b)Explain Durkheim’s basic arguments on Suicide. Can you analyse high suicide rate of contemporary Indian Society with Durkheim’s theory?"
		},
		{
			"Year":"2018",
			"Question":"2(c) Evaluate if social stratification is functional for society."
		},
		{
			"Year":"2018",
			"Question":"3.(a)Does collapse of functionalism and bankruptcy of Marxism coincide with the rupture of modernity? Discuss."
		},
		{
			"Year":"2018",
			"Question":"3(b)Define Patriarchy. How does patriarchy manifest in interpersonal relations?"
		},
		{
			"Year":"2018",
			"Question":"3(c)What is the difference between anomie in Merton and Durkheim? Explain."
		},
		{
			"Year":"2018",
			"Question":"4.(a) According to Marx, how are human beings alienated from their human potential and what does he suggest to change this?"
		},
		{
			"Year":"2018",
			"Question":"4(b)Schooling does not ensure upwards mobility of all members of the society. Discuss with reference to class societies."
		},
		{
			"Year":"2018",
			"Question":"4(c)Discuss the challenges thrown by religious revivalism to a secular nation-state."
		},
		{
			"Year":"2018",
			"Question":"5(a)Is this theory of cultural lag valid in present times? Discuss."
		},
		{
			"Year":"2018",
			"Question":"5(b)Are social movements primordial in means and progressive in agenda? Explain."
		},
		{
			"Year":"2018",
			"Question":"5(c)Does Scientific method make Sociology a science? Illustrate your answer with Durkheim’s method."
		},
		{
			"Year":"2018",
			"Question":"5(d)Distinguish between quantitative and qualitative techniques of data collection with suitable examples from Indian society."
		},
		{
			"Year":"2018",
			"Question":"5(e)Is social mobility possible in closed systems of stratification? Illustrate from research work."
		},
		{
			"Year":"2018",
			"Question":"6.(a) Discuss the nature of social Organisation of work in capitalist society with reference to ‘Limits of the working day’."
		},
		{
			"Year":"2018",
			"Question":"6(b)Distinguish between family and household with reference to the concept of development of the household."
		},
		{
			"Year":"2018",
			"Question":"6(c)Explain with examples, the explanatory and explanatory designs of social research."
		},
		{
			"Year":"2018",
			"Question":"7.(a)How can Parsons’ AGIL framework used to analyse key problems in a society? Discuss."
		},
		{
			"Year":"2018",
			"Question":"7(b)What is labour commitment? Discuss it with reference to studies of manufacturing industry."
		},
		{
			"Year":"2018",
			"Question":"7(c)What, according to Pareto, are the basic characteristics of elites? Discuss."
		},
		{
			"Year":"2018",
			"Question":"8.(a)“The sociological imagination enables us to grasp history and biography and explain the relationship between the two in a society.”- C.W. Mills. Explain."
		},
		{
			"Year":"2018",
			"Question":"8(b) What are sects? Discuss their role in multi religious societies with empirical examples."
		},
		{
			"Year":"2018",
			"Question":"8(c)In what way did Durkheim perceive religion as functional to society?"
		},
		{
			"Year":"2018",
			"Question":"1(a)Write a note on G.S. Ghurye’s Indological perspective of understanding Indian society."
		},
		{
			"Year":"2018",
			"Question":"1(b)Give a critical analysis of Andre Beteille’s study of Tanjore Village."
		},
		{
			"Year":"2018",
			"Question":"1(c)Media is the fourth pillar of democracy. Discuss."
		},
		{
			"Year":"2018",
			"Question":"1(d)Write a note on the changing roles of middle-class women in India."
		},
		{
			"Year":"2018",
			"Question":"1(e)Discuss the growth of religious sects in India."
		},
		{
			"Year":"2018",
			"Question":"2.(a) Analyse A.R. Desai’s views on India’s path of development."
		},
		{
			"Year":"2018",
			"Question":"2(b)Examine sociological dynamics of Champaran peasant movement in colonial India."
		},
		{
			"Year":"2018",
			"Question":"2(c)How do the recommendations of swamiNathan commission (2004-2006) ensure food and nutrition security for the Indian masses?"
		},
		{
			"Year":"2018",
			"Question":"3.(a)What do you understand by discrete castes and muddles hierarchies? Substantiate your answer with suitable illustrations."
		},
		{
			"Year":"2018",
			"Question":"3(b)Discuss development – induced displacement in the context of tribal uprising in India. Substantiate your answer with any one details illustration from India."
		},
		{
			"Year":"2018",
			"Question":"3(c)Illustrate the importance of ‘Kanyadan’ and ‘Kulabadhu’ in changing institutions of marriage and family."
		},
		{
			"Year":"2018",
			"Question":"4.(a)How has the New Economic Policy(1991) affected the lifestyle and life-chances of new middle class in India?"
		},
		{
			"Year":"2018",
			"Question":"4(b)Write a critical narrative on the concerns of religious minorities in India."
		},
		{
			"Year":"2018",
			"Question":"4(c)Discuss the issues relating to the entitlement to transgender in Indian society."
		},
		{
			"Year":"2018",
			"Question":"5(a)Elaborate the concept of constitutional morality as given by B.R. Ambedkar."
		},
		{
			"Year":"2018",
			"Question":"5(b)Construct a sociological narrative on the increasing trend of child abuse in India."
		},
		{
			"Year":"2018",
			"Question":"5(c)Explain the dynamics of neo-farmers’ movement in contemporary India."
		},
		{
			"Year":"2018",
			"Question":"5(d)Assess the role of the state in promoting education of girl child."
		},
		{
			"Year":"2018",
			"Question":"5(e)Elaborate the ‘Me Too’ Movement and its impact in India."
		},
		{
			"Year":"2018",
			"Question":"6.(a)How do you relate the growth of development of metropolis and its impact on the mental and social life of people in India?"
		},
		{
			"Year":"2018",
			"Question":"6(b)Has ‘Green Revolution’ led to the transformation of new power in rural India? Elaborate your answer."
		},
		{
			"Year":"2018",
			"Question":"6(c)Write a note on Basic Services to Urban Poor (BSUP) and Integrated Housing and Slum Development (IHSD) programmes provided for the urban poor."
		},
		{
			"Year":"2018",
			"Question":"7.(a) Has caste system hindered democracy and adult franchise in India? Discuss."
		},
		{
			"Year":"2018",
			"Question":"7(b) Elaborate various forms of Dalit assertions in contemporary India. What is its implication on the Indian Political system?"
		},
		{
			"Year":"2018",
			"Question":"7(c)With increase in education and economic development in Indian society becoming more secular?"
		},
		{
			"Year":"2018",
			"Question":"8.(a)What are the issues relating to male migration and its impact on birth-rate? Does it necessarily result in skewed sex ratio?"
		},
		{
			"Year":"2018",
			"Question":"8(b)Western patriarchy which surrenders feminine principles is the new development project in India. Do you agree with this view? Why?"
		},
		{
			"Year":"2018",
			"Question":"8(c)assess the impact of ban on ‘Triple Talak’ on marriage and divorce among the Muslim community in India."
		}
	]
